[
  {
    "jobTitle": "PHP Laravel Developer needed full-time",
    "jobDescriptionUrl": "https://hubstafftalent.net/jobs/php-laravel-developer-needed-full-time-3",
    "payRate": "$12/hr",
    "companyName": "HeyCarson",
    "companyUrl": "https://www.heycarson.com/",
    "jobLocation": "Hong Kong, Hong Kong, Hong Kong",
    "isRemote": false,
    "createdDate": "June 21, 2024 at 10:09 am",
    "jobDescription": "Hi there! We are an officially listed Shopify expert team based internationally. Founded in 2015, we have established ourselves as the #1 place for brands on Shopify to outsource their development and design projects of all sizes and complexity.\nWe are looking for a back-end developer to work on our company’s internal products, including the site, dashboard, and others.\nWe need someone who can help continually maintain our products and server setup and who can also help with the analysis and implementation of new features and optimization of the products.\nThe job offer is for fully remote, long-term work, 40 hrs/week, Monday to Friday. The shift is in the CET time zone, preferably from 8 a.m. to 5 p.m. CET (UTC+1), including an hour's break. \nProficiency in English, good communication skills, and attitude will factor heavily in our decision. You need to be adaptable, responsible and devoted to the project. \nTECHNICAL REQUIREMENTS: \n\nAPI/Backend: PHP 7.2+, Laravel 5.6+\nUI/front end: JavaScript ES5/6, SvelteKit/Tailwind\nServer/MySQL: Docker\nClean Code/SOLID principles \nUI/UX Experience \nReact Experience preferred \nYou’ve heard about or used Webpack or other modular architectures/tools\nFamiliar with the requirements of unit testing \n\nWHAT’S IN IT FOR YOU:\n\nSteady and predictable compensation starting at $2000/month and will be reviewed based on performance and added value\nDaily communication with our international team via internal communication platform\nAwesome team and healthy work environment \nOpportunity to work in the comfort of your home office \nFor long-term contractors – paid vacation, access to medical fund.\n\nINTERVIEW PROCESS:\n\nWe review your CV and Motivation letter, and if your profile fits our search ->\nWe ask you to fill in our questionnaire ->\nWe offer a test task that may take up to 3 hours of your time ->\nFinal interview with the Hiring Manager\n\nPlease only apply to the job post if you are ready to swiftly go through all these steps.\nIf that sounds like something you would like to be part of, please contact us.",
    "skills": [],
    "jobID": "ac19652c-6bb4-4332-acb5-9d08f0e22f37"
  },
  {
    "jobTitle": "Sales Executive",
    "jobDescriptionUrl": "https://hubstafftalent.net/jobs/sales-executive-b50217",
    "payRate": "",
    "companyName": "NoBroker",
    "companyUrl": "http://nobroker.in/",
    "jobLocation": "Bangalore, Karnataka, India",
    "isRemote": false,
    "createdDate": "June 21, 2024 at  9:56 am",
    "jobDescription": "Role and Responsibility – Sales Executive\n• Identifies business opportunities by identifying prospects.\n• Sells products by establishing contact and developing relationships with prospects recommending\nsolutions.\n• Outbound calling on data collected through lead generation activities / secondary data\nsources. • Daily follow-ups on older leads and work on new leads.\n• Maintains quality service by establishing and enforcing organization standards. • Must be\nenergetic, well-spoken, and eager to close sales deals and generate revenue for the\norganization.\nAbout Training- Training will be provided for initial few days for an employee to understand end\nto end process.\nQualification / Education and other Requirements:\n• Education- Any Undergraduate (BBA,B.Tech, B,A) etc.\n• Excellent verbal and written communication.\n• Good Interpersonal skills, numerical and analytical ability.\n• Decision making skills.\n• Language required: English & Hindi\n(mandatory), Kannada/Tamil/Marathi/Telugu\n(optional)\n• Proficient in MS-Office (Excel, Word).\n• Should be flexible for day shift- (9-hour of login between 8 AM - 10 PM). •\nComfortable with working 6 days a week and the week off will be on weekday.\n**Laptop with webcam and good speed Internet connection is a must",
    "skills": [],
    "jobID": "2f38b952-5a14-4b58-8026-e73f9bc37da5"
  },
  {
    "jobTitle": "Brand Manager for Influencer Collaborations",
    "jobDescriptionUrl": "https://hubstafftalent.net/jobs/brand-manager-for-influencer-collaborations",
    "payRate": "",
    "companyName": "Go Premier Media",
    "companyUrl": "https://gopremiermedia.com/",
    "jobLocation": "Minneapolis, MN, United States",
    "isRemote": false,
    "createdDate": "June 21, 2024 at  9:31 am",
    "jobDescription": "Hello, Brand Managers!\nMy name is Nate Ginsburg and I am a serial entrepreneur. I'm the founder of SellerPlex, host of the Ecom Exits Podcast, and partner in a handful of other online businesses.\nAbout the company:\nSellerPlex is growing fast and we need awesome people to help us give value to our clients and build awesome professional relationships with them.\nOur mission is to help empower e-commerce/FBA entrepreneurs to run better businesses by supporting them with Supply Chain, Finance, and Operations services. We’re a huge believer in the importance of being a culture fit for long-term success.\nAbout the role:\nWe are looking for a strategic and dynamic Brand Manager to join our team. This high-level strategist will oversee our influencer collaboration projects, working closely with our team to build brands, launch products, and develop exciting new businesses. This position will likely start off part-time but has the potential to transition to full-time based on performance and opportunities.\nThis is a Part-Time/Hourly Remote position with potential ongoing work depending on performance.\nBenefits:\n\nWorking completely remote\nLocation independence\nGreat opportunity to grow\nYou’ll be joining a high-level and fast-paced team, working with exciting businesses and projects\n\nIf this sounds interesting to you please proceed with your application.\nKindly be advised that the recruitment process is being managed by Premier Media. For any further details or inquiries, please reach out to the Premier Media recruitment team, as they oversee all our hiring procedures.\nThanks and I look forward to hearing from you!",
    "skills": [],
    "jobID": "29cb59fa-1fda-43ed-bb39-337dbb1ba9e7"
  },
  {
    "jobTitle": "SEO Blog Writer",
    "jobDescriptionUrl": "https://hubstafftalent.net/jobs/seo-blog-writer-5",
    "payRate": "$5/hr",
    "companyName": "Kolleqtive",
    "companyUrl": "http://kolleqtive.com/",
    "jobLocation": "Belper, Derbyshire, United Kingdom",
    "isRemote": false,
    "createdDate": "June 21, 2024 at  7:43 am",
    "jobDescription": "Hello,\nI am looking for a reliable blog/article writer for www.kolleqtive.com/blog.\nI have been consistantly increasing my traffic through this blog on a monthly basis and would now like to find support in continuing to do so.\nI am currently writing 2 or 3 blogs a week and using AI to do so. This keeps the time and costs down and seems to work very well for me. I am getting 80/100 score on each blog.\nI am also creating the images with AI and I love these images, so would like to continue with this style.\nMy audience are young professionals and the content is self-empowerment, motivation, productivity, goals, well-ness, business success etc.\nIf you are interested please give me your best quote for 10- 15 blogs a month.\nIf you have experience and any suggestings on how I can improve things, I am always interested in hearing them.\nI look forward to hearing from you.\nMany thanks,\nSusie",
    "skills": [],
    "jobID": "464498b2-4dab-4904-a664-61c82cf3d510"
  },
  {
    "jobTitle": "Ethereum Dapp developer",
    "jobDescriptionUrl": "https://hubstafftalent.net/jobs/ethereum-dapp-developer",
    "payRate": "$50/hr",
    "companyName": "gglaborg",
    "companyUrl": "https://gglaborg.org/",
    "jobLocation": "Palo Alto, California, United States",
    "isRemote": false,
    "createdDate": "June 21, 2024 at  6:29 am",
    "jobDescription": "We are seeking a talented and motivated Blockchain Developer to join our team. The ideal candidate will have experience in developing and implementing blockchain-based solutions, with a focus on decentralized finance (DeFi) and cryptocurrency tools. This role will involve working on a variety of innovative features aimed at enhancing the cryptocurrency trading and management experience.\nResponsibilities:\nDevelop and maintain a feature to track all sellers of a specific token, with the ability to input a list of wallets to specifically track. Implement a ranking system based on a calculated aggression metric.\nCreate an airdrop tool that allows for the distribution of tokens using a CSV template. Ensure compatibility with any EVM chain and Solana.\nImplement token creation functionality for SPL and ERC tokens, providing a seamless experience for users to generate new tokens.\nDevelop a flow chart feature that visualizes the flow of funds between wallets, including wallet balances and transaction paths. Show the deployment process of contract addresses (CA).\nBuild a system to display current top traders across various tracked coins. Integrate an admin panel for configuring the list of coins to be monitored.\nDevelop a Chrome extension that audits contract addresses (CA) from Dextools, utilizing an existing auditing backend.\nQualifications:\nProven experience in blockchain development, particularly with EVM chains and Solana.\nStrong understanding of decentralized finance (DeFi) concepts and cryptocurrency trading.\nProficiency in smart contract development using Solidity and Rust.\nExperience with front-end technologies such as React.js or Vue.js.\nFamiliarity with database management and backend development.\nAbility to work independently and manage multiple tasks effectively.\nStrong problem-solving skills and attention to detail.\nPreferred Skills:\nExperience developing Chrome extensions.\nKnowledge of tokenomics and cryptocurrency market trends.\nUnderstanding of security best practices in blockchain development.",
    "skills": [],
    "jobID": "f389c3de-6edc-438c-b15f-4488eff38189"
  },
  {
    "jobTitle": "Ocean Freight Sales Manager",
    "jobDescriptionUrl": "https://hubstafftalent.net/jobs/ocean-freight-sales-manager",
    "payRate": "",
    "companyName": "AWATAC USA INC.",
    "companyUrl": "https://www.awatacgroup.com/",
    "jobLocation": "Mckinney, TEXAS, United States",
    "isRemote": false,
    "createdDate": "June 21, 2024 at  6:03 am",
    "jobDescription": "Job Description for Sales/BDM position:\n\nLooking for applicants with ready book of business.\nAttractive commissions and/or incentives will be offered for outstanding candidates.\nPlan the sales strategy, target, & process for Global logistics company.\nSell end to end services international freight, transport, warehousing and distribution services\nMaximize profitability by reviewing/linking sales source and company’s capabilities\nDevelop sales plan for attracting new customers and retaining existing and finally target for profit generation.\nExpand business scale with customers, seek for new business, new customers to contribute to achieve total budget of revenue.\nDevelop and execute country sales plan in line with global sales direction and keep continuous growth at company’s target market / product.\n\nTechnical Qualifications:\n\nStrategic thinking, good negotiation skills and strong networking abilities\nExperience of global freight forwarding, contract logistics & transportation operations and markets.\nCross selling experience across various countries.\nStrong selling & presentation skills and have solid experience in working in a diverse cultural environment.\n\nExperience : 3+ years of experience is MUST in Ocean Freight Sales.\nLocations: Remote\nSalary: As per Industry.\nNote: References will be highly appreciated.",
    "skills": [],
    "jobID": "8f0bd03f-6f47-4b46-8a7b-f4bcbbc75e9d"
  },
  {
    "jobTitle": "Blockchain Game Developer",
    "jobDescriptionUrl": "https://hubstafftalent.net/jobs/blockchain-game-developer",
    "payRate": "$120/hr",
    "companyName": "LeverX",
    "companyUrl": "https://leverx.com/",
    "jobLocation": "Florida, Miami, Russian Federation",
    "isRemote": false,
    "createdDate": "June 20, 2024 at 11:15 pm",
    "jobDescription": "Hi, Everyone\nI have an idea for a project I'd like to work on and I think your skills and experience would be really valuable.\nI'm putting together a team to work on a new project, and I think your background and experience would make you an ideal fit.\nI can share more details about the scope and goals, if you're open to it.\nhttps://github.com/DavidBeanvide/Jetracing\nIf you're interested in getting involved with this open-source project, to test your skills please build the project from GitHub and review the our source code and project details.\n**use node version 16.20.0 **\nnpm i\nnpm run start\nThere will be preliminary interviews to evaluate your overall background, experience, and fit for the role of this project.\nIf you are interested in this opportunity, please submit your resume and we can provide more details about the role, the interview process, and next steps, and contact : https://t.me/davidbenavide\nThanks",
    "skills": [],
    "jobID": "fd1f25a0-0a19-4b30-8c37-8c1acea69876"
  },
  {
    "jobTitle": "LastPass Administrator | Project-based",
    "jobDescriptionUrl": "https://hubstafftalent.net/jobs/lastpass-administrator-project-based-2",
    "payRate": "NA",
    "companyName": "Fidelity Business Partners",
    "companyUrl": "https://fidelitybps.com/",
    "jobLocation": "Carlsbad, California, United States",
    "isRemote": false,
    "createdDate": "June 20, 2024 at 10:22 pm",
    "jobDescription": "We are seeking a skilled and experienced LastPass Administrator to join our team. The LastPass Administrator will be responsible for managing and maintaining our organization's LastPass password management system. The ideal candidate will have a strong understanding of cybersecurity best practices, experience with LastPass and the ability to effectively communicate and collaborate with team members.\nResponsibilities:\n\nSet-up and configure LastPass accounts for users and the organization\nManage and administer the LastPass password management system for the organization\nCollaborate with the team to integrate LastPass with other systems and tools\nProvide training and support to employees on how to use LastPass effectively\nCreate and enforce password policies to ensure the security of sensitive information\nTroubleshoot and resolve technical issues related to LastPass\n\nQualifications:\n\nBachelor's degree in Computer Science, Information Technology, or related field\nProven experience as a LastPass Administrator\nStrong knowledge of cybersecurity principles and best practices\nExcellent communication and interpersonal skills\nAbility to work independently and as part of a team\nRelevant certification (e.g., LastPass Certified Administrator) is a plus\n\nWork Schedule:\n\nMust be able to work during Central Standard Time Zone business hours.  The team works between 9:00 am – 5:00 pm CST \nProject completion: 2-3 weeks\n\nFixed Rate: $200-$250, to be paid upon completion of the following:\n\nLastPass users and organization accounts setup\nCreation of LastPass administrator’s video guide\nCreation of LastPass user’s video guide\nCreation of FAQs",
    "skills": [],
    "jobID": "b1449b9e-ddbe-4f4d-98fd-412ec826262e"
  },
  {
    "jobTitle": "Technical Delivery Manager",
    "jobDescriptionUrl": "https://hubstafftalent.net/jobs/technical-delivery-manager-2",
    "payRate": "",
    "companyName": "Crossbridge Global Partners",
    "companyUrl": "https://careers.gocrossbridge.com/",
    "jobLocation": "Boise, Idaho, United States",
    "isRemote": false,
    "createdDate": "June 20, 2024 at  8:17 pm",
    "jobDescription": "The perfect candidate works on integration with Data Fabric, Developing and remediating applications. It needs to be good working and have hands on knowledge on Google cloud, with SDLC/Agile development experience working with large data management and migration teams. Should have excellent knowledge in core JAVA, java backend, Apache beam, Big Query, Angular, Microservices etc. With 5+ years of experience with an excellent communication and being a team player.\nResponsibilites:\n•You will ensure that the appropriate in TEC staff resources are utilised across our 6 locations and that stakeholders are regularly informed\n•Ensure your team is sized and skilled in line with company growth, product development strategy, and sales demand.\n•Ensure the Technical Delivery team delivers product orders on time, quality, and on budget.\nRequirements:\n• Minimum 14 years of experience as a Technical Program Manager\n•Experience defining and driving quality, consistency, and excellence in all aspects of the in TEC group technical delivery function.\n•Experience managing the dependencies and the interfaces between orders, projects, licenses, third parties and platforms, as well as the risks and issues jeopardising your team’s success.\n•Experience working in a proactive not reactive manner.\n• Experienced leader of people and the ability to influence other stakeholders to get buy-in.\n• Experienced multi-methodology project manager (Agile, Waterfall, Hybrid, ITIL elements).\n• Master in IT / Bachelor’s Degree in IT With relevant experience in Software development in Java, Oracle, UI/UX, Angular, Microservices, and Full stack. With Min. 14 Years of experience",
    "skills": [],
    "jobID": "bd034a40-eacb-4128-9aab-20bdc87eedde"
  },
  {
    "jobTitle": "IT Technician II",
    "jobDescriptionUrl": "https://hubstafftalent.net/jobs/it-technician-ii",
    "payRate": "$7.35/hr",
    "companyName": "intelligent technical solutions",
    "companyUrl": "https://www.itsasap.com/job-openings",
    "jobLocation": "las vegas, nevada, United States",
    "isRemote": false,
    "createdDate": "June 20, 2024 at  6:16 pm",
    "jobDescription": "Join Intelligent Technical Solutions, a dynamic and growing company, as our Technician II. We're looking for a collaborative problem-solver with excellent customer service skills and a detail-oriented mindset. In this role, you'll be pivotal in providing remote IT support, ensuring our clients receive top-notch technical assistance. You'll handle a range of tasks, from system updates to hands-on troubleshooting, playing a critical role in maintaining our high standards of IT service.\nThis role is expected to be able to resolve the following technical issues with little or no assistance:\n\nWorkstation operating system issues of any kind.\nPrinter issues of any kind.\nStandard business application (Office, etc.) issues of any kind.\nLine-of-business application issues for common applications (SAGE ERP, QuickBooks), and for more niche applications with vendor assistance.\nBasic server issues.\nBasic networking issues.\nAnswer incoming Quick Fix calls from clients.\n\n\nExperience with Windows and Mac OS troubleshooting.\nMinimum two years in Helpdesk support or a similar role.\nSkilled in application troubleshooting, PC deployments/imaging, and user profile management.\nBasic knowledge of Firewalls, Switches, Network architecture, and troubleshooting.\nProficient in supporting Office 365, MS Office, Adobe, Active Directory, backup software, endpoint cybersecurity, mobile devices, and various business applications.\nExperience with Managed Service Providers (MSPs) is highly desirable.\nActive IT Certifications are preferred.\n\n\nFirst-touch closed: Each ticket that is completed with only one time entry contributes to this number\nUtilization: The percentage of time that you are on the clock and billing time to client tickets\nCSAT: Scores filled out by clients using the rating system in tickets\n\n\nA home office set up that meets the following:\nA working computer with minimum of 8gb RAM, i5 Windows10 or macOS Big Sur. \nStable internet connection with at least 5mbps download and upload.\nA quality headset with noise cancellation feature for meetings. \nA mobile phone that has the capacity to install the Microsoft Authentication app. \nHD webcam\n2nd Monitor \nUPS (Uninterruptible Power Supply_) _if using a desktop (Not needed if using a laptop)\nNote:  If you don't have a UPS or a secondary monitor, the company is willing to cover the initial expenses for acquiring these items. The total cost will be deducted from your salary over a three-month period.\nA very strong cultural fit the ITS way (Our core values will be discussed during the interview) \nExcellent command of the English language both spoken and written \nAble to work full time 40 hours a week - 8:00AM to 5:00PM, Pacific Standard Time (PST) from Monday to Friday.\nAble to pass our online behavior and cognitive assessments. \nPreferably at least 2 of the following certifications: CompTIA A+, CompTIA Network+, CompTIA Security+, 3cx Basic Certified Engineer.\nAble to provide NBI Clearance (for PH applicants).\n\nPay rate starts at **$7.35/hr **and vary by experience and location.\n\nPaid US Holiday\nNight Shift Bonus\nPaid Time Off (15 Vacation Days per year)\nComprehensive Health Plans / HMO (Employee & Dependent/s)\nLife and Accident Insurance\nAccident and Disability Coverage\nCompany-paid training and certification\nHealth & Wellness Program\nDental & Vision\nSalary Advancement",
    "skills": [],
    "jobID": "0c6f368d-91c6-4e64-85fd-55c7428fcf6b"
  },
  {
    "jobTitle": "Operations Manager",
    "jobDescriptionUrl": "https://hubstafftalent.net/jobs/operations-manager-8ac000",
    "payRate": "$9/hr",
    "companyName": "Virtual Work World",
    "companyUrl": "https://www.virtualworkworld.com/",
    "jobLocation": "Dover, Delaware, United States",
    "isRemote": false,
    "createdDate": "June 20, 2024 at  4:26 pm",
    "jobDescription": "Role : Operations Manager\nContract; Full-Time (40 hours weekly)\nBusiness Hours: Mon - Fri at 8 AM to 5 PM EST \nRate: $1,440 USD monthly / $17,280 USD annually\nAvailability to Start: As soon as possible\nAdditional Info: Additional perks included in the compensation structure \nWhat you'll do\nThis company is looking for a highly autonomous and detail-oriented Operations Manager whom they can trust implicitly. This pivotal role entails overseeing internal and external operations with precision, managing processes, fostering strong partnerships, and ensuring seamless client experiences. The ideal candidate will exhibit exceptional organizational skills, adeptness in leadership, and a proactive approach to problem-solving. Key responsibilities for this role encompass, but are not limited to:\n\nProcess Management and SOPs:\nDevelop, refine and maintain Standard Operating Procedures (SOPs) to optimize efficiency and ensure consistency.\nSoftware Proficiency:\nDemonstrate proficiency in Tango, WordPress (Divi), Zoho, HubSpot, and Notion, with particular emphasis on WordPress backend management.\nPartner and Vendor Management:\nCreate and manage CRM profiles for Partners and Vendors. \nLiaise with Partners and Vendors to coordinate services for Client reservations, bookings, events and concierge services. \nManage Vendor and Partner relationships, overseeing invoicing, issue resolution, and service coordination.\nClient Services:\nClient Management:\nCreate and manage client profiles, preferences, and service requests, ensuring seamless concierge experiences.\nWork directly with Partners and Vendors to execute client requests. \nEvent Management:\nPlan and execute event logistics, coordinating with vendors and partners to meet client expectations.\nEnsure all event fees and expenses are accurately tracked.\nCollaboration with Leadership:\nAlign operational strategies with organizational goals, providing regular updates and insights to leadership.\nProject Management\nManage project timelines, status updates and adherence to deadlines, ensuring all relevant teams and leadership are notified of pending deliverables. \nInterdepartmental Communication:\nFacilitate collaboration between departments, ensuring smooth communication channels.\nTeam Management:\nManage an Operations Assistant and monitor KPIs, productivity and performance. \nProvide guidance, allocate tasks efficiently, conduct performance reviews, and foster a culture of growth and development within the team.\nReporting:\nDeliver daily task reports and monthly operational summaries.\n\nWhat you should have\n\nMinimum five years of experience in Operations, preferably in a remote or virtual environment for a company in the USA, Canada, or EU. \nProven leadership, process improvement, partner management, and project management skills.\nProficiency in WordPress, Google Workspace, Zapier, Zoho, Notion, and Canva is required.\nStrong attention to detail, time management, and organizational skills.\nPrevious experience in the hospitality industry is advantageous.\nExceptional client service and team management abilities.\nProblem-solving aptitude, flexibility, and adaptability.\nLeadership qualities with a continuous improvement mindset.\n\nWho you are\n\nYou possess a keen ability to develop, refine, and maintain Standard Operating Procedures (SOPs) to optimize efficiency and ensure consistency throughout the organization. Your strategic mindset enables you to foresee potential challenges and proactively implement solutions.\nWith a knack for building strong partnerships, you excel in managing relationships with both partners and vendors. From creating and managing client profiles to overseeing vendor invoicing and issue resolution, your interpersonal skills ensure seamless service coordination and client satisfaction.\nWhether it's planning and executing event logistics or managing project timelines, your meticulous attention to detail ensures nothing falls through the cracks. You thrive in environments where precision and accuracy are paramount, consistently delivering results that exceed expectations.\nAs a collaborative leader, you excel in aligning operational strategies with organizational goals and facilitating interdepartmental communication. Your ability to effectively manage teams, allocate tasks, and foster a culture of growth and development ensures the success of cross-functional initiatives and projects.",
    "skills": [],
    "jobID": "f8ffa5e2-2fb7-4cc6-b86a-6335e8d93333"
  },
  {
    "jobTitle": "Operations Virtual Assistant",
    "jobDescriptionUrl": "https://hubstafftalent.net/jobs/operations-virtual-assistant-3",
    "payRate": "$5/hr",
    "companyName": "Virtual Work World",
    "companyUrl": "https://www.virtualworkworld.com/",
    "jobLocation": "Dover, Delaware, United States",
    "isRemote": false,
    "createdDate": "June 20, 2024 at  4:23 pm",
    "jobDescription": "Role : Operations Virtual Assistant\nContract: Part-Time (20 hours weekly)\nBusiness Hours : Mon - Fri between 6 AM to 8 PM EST \nRate: $400 USD monthly / $4,800 USD annually\nAvailability to Start: As soon as possible\nAdditional Info: Additional perks included in the compensation structure \nWhat you'll do\nThis company is looking for a skilled Administrative and Operations Assistant to support the Operations Manager. This role requires exceptional organizational abilities, a keen eye for detail, and a proactive approach to supporting team members and client requests. The successful candidate will play a crucial role in maintaining efficient operations and supporting the Operations Department. Key responsibilities for this role encompass, but are not limited to:\n\nAdministrative Support:\nProvide comprehensive administrative assistance, including proficient data entry, meticulous document organization, and file management.\nAssist in scheduling appointments, coordinating meetings, and managing shared inboxes. \nClient Services and Concierge Assistance:\nAid in client and concierge services by supporting vendor and partner coordination. \nAssist in generating payment links for client services, ensuring accuracy and timeliness.\nCollaborate with the Operations Manager to ensure prompt follow-up on specific client requests and inquiries.\nProject Coordination and Reporting:\nAssist with documenting processes and procedures to support the Operations Department SOPs. \nAssist in tracking project progress, updating task lists, and maintaining comprehensive project documentation, ensuring that the Operations Manager is reminded of deadlines. \nContribute to generating end-of-day reports and monitoring productivity metrics to ensure efficiency.\nCollaboration and Communication:\nCollaborate effectively with team members, communicating progress, challenges, and assistance needed clearly and professionally.\nMaintain open lines of communication with the Operations Manager, seeking guidance and feedback as needed.\nReceive mentorship and guidance from the Operations Manager, leveraging their expertise to execute tasks effectively.\nSoftware Proficiency:\nDevelop proficiency in essential software platforms such as Tango, Zoho, and Notion to support Operational procedures. \nUpdate and maintain databases, including partner and client profiles, under guidance from the Operations Manager.\n\nWhat you should have\n\nMinimum of two years of experience in Operations, preferably in a remote or virtual environment for a company in the USA, Canada or UK.\nBackground in administration and operations assistance and project management. \nProficiency in WordPress, Google Workspace, Zapier, Zoho, Notion, and Canva is required.\nStrong attention to detail, time management, and organizational skills.\nPrevious experience in the hospitality industry is advantageous.\nProblem-solving aptitude, flexibility, and adaptability.\nA continuous improvement mindset.\n\nWho you are\n\nYou excel in providing comprehensive administrative support meticulously handling data entry, document organization, and file management tasks. Your attention to detail ensures accuracy and efficiency in all administrative processes, contributing to the smooth operation of the department.\nYou thrive in assisting with client and concierge services, facilitating vendor and partner coordination, and generating payment links on platforms. Your dedication to ensuring accuracy and timeliness in client interactions enhances the overall customer experience and strengthens client relationships.\nYou actively contribute to documenting processes and procedures, supporting the development of Standard Operating Procedures (SOPs). Your commitment to process documentation and training helps streamline operations and maintain consistency within the department.\nYou embrace collaboration and effective communication, fostering open lines of communication with team members and the Operations Manager. Your proactive approach to seeking guidance, providing updates, and addressing challenges ensures seamless collaboration and enables the successful execution of tasks.",
    "skills": [],
    "jobID": "70ef57c6-99e8-4b6d-980e-e27f924a6727"
  },
  {
    "jobTitle": "Administrative and Client Support Coordinator",
    "jobDescriptionUrl": "https://hubstafftalent.net/jobs/administrative-and-client-support-coordinator",
    "payRate": "$5/hr",
    "companyName": "Virtual Work World",
    "companyUrl": "https://www.virtualworkworld.com/",
    "jobLocation": "Dover, Delaware, United States",
    "isRemote": false,
    "createdDate": "June 20, 2024 at  4:18 pm",
    "jobDescription": "Role: Administrative and Client Support Coordinator\nContract: Full-time Remote Contractor (160 hours monthly)\nBusiness Hours:\n\n9 AM to 6 PM EST, Monday to Friday\n9 AM to 5 PM EST (Monday to Friday) and 10 AM to 3 PM EST (Saturday)\n\n(with lunch and breaks included)\nPayment Range: $800 - $1,000 USD monthly (Salary is negotiable based on experience and location)\nAvailability to Start: August 1, 2024\nAdditional Info: Additional perks included in the compensation structure \nClient's Profile\nThis company is a passionate team of Indian wedding planners in the USA focused on creating memorable experiences that last a lifetime. They strive to ensure couples that they are a good match for their wedding. They are committed to excellence, providing precise coordination and prompt service delivery with professionalism and a positive attitude. Whether couples desire assistance planning their South-Asian wedding from start to finish, need guidance with the selection process, or simply require day-of coordination, the company will be there for them!\nWhat you'll do\nAs the Admin and Client Support Coordinator, you will manage client relationships, ensure effective communication, address inquiries while tracking sales leads, and assist in proposal creation. You will handle financial and administrative tasks, including client invoicing, travel expense management, and maintaining vendor directories. Additionally, you will provide general administrative support to enhance productivity, assist in policy and procedure documentation, and manage data entry and research projects. In HR, you will coordinate team events, manage interview schedules, and support onboarding processes. Moreover, you will collaborate with the marketing team by supplying necessary information and coordinating with photographers and videographers for content creation, offering additional support. Your responsibilities will include:\n\nClient Relationship Management:\nManage client communications, especially for onboarded clients awaiting service commencement.\nRespond to sales inquiries and update the sales tracker.\nFollow up with active leads and assist in creating proposals.\nFinancial and Administrative Tasks:\nHandle client invoicing and manage travel expense reports post-events.\nCompile and submit expense reports for approval and client reimbursement.\nArrange flights, hotel bookings, and other travel logistics.\nMaintain and update a vendor directory.\nOrganize inboxes and contact lists to ensure efficient communication flow.\nGeneral Administrative Support:\nProvide clerical and administrative support to maximize productivity.\nAssist in writing, filing, and updating policies and procedures.\nConducted data entry and research and supported special ad-hoc projects as required.\nHuman Resources Support:\nSchedule team events and coordinate on-site teams based on established processes.\nAssist with hiring tasks, including scheduling interviews and onboarding processes.\nMarketing Support:\nCollaborate with the marketing team by providing information to the social media coordinator, such as vendor information.\nCoordinate with photographers and videographers for content creation.\nOffer ad hoc support as needed.\n\nWhat you should have\n\nAt least two years of experience in positions such as Executive or Administrative Assistant, Operations Manager, Chief of Staff, or any other relevant roles.\nExperience working remotely with a company in the US, Canada, UK, and/or AU. \nExperience with Google Workspace or Microsoft Office Suite (Doc, Sheets, Slides, etc.).\nExperience with Cognito Forms and Zapier is crucial for the company's operations.\nExperience in handling staff communications, scheduling, and event coordination\nExperience in Project Management, including managing tasks and deadlines, updating assignees, and reporting (ClickUp experience is a plus!).\nFamiliarity with Slack for communication and proficiency in managing and updating content on Squarespace.\nOutstanding organizational and time management skills.\nNice to haves\nExperience in event planning or wedding planning is a plus. \nFamiliarity with South Asian customs is a big plus!\nComfortable in a start-up environment with the ability to adapt to changing priorities.\n\nWho you are\nWe hope you are someone who: \n\nCommunicates effectively and openly with the team and clients.\nIs open and honest in all communications and interactions.\nIs proactive in foreseeing and addressing tasks before being asked.\nHas robust skills in coordinating with a team of 35-40 people.\nHandles diverse responsibilities and tasks with flexibility.\nMaintains a positive and professional demeanor in all interactions.",
    "skills": [],
    "jobID": "5fdd7930-8add-4a78-b450-a913638535be"
  },
  {
    "jobTitle": "Credit Card Processing Manager",
    "jobDescriptionUrl": "https://hubstafftalent.net/jobs/credit-card-processing-manager",
    "payRate": "",
    "companyName": "G2 Business Solutions Inc.",
    "companyUrl": "http://www.g2-businesssolutions.com/",
    "jobLocation": "Valley Center, CA, United States",
    "isRemote": false,
    "createdDate": "June 20, 2024 at  3:57 pm",
    "jobDescription": "Applicant must have experience working in the Credit Card Processing industry & must be based in the Philippines. - No Exceptions to either criteria. G2 has been helping small business with payroll since 2014 and is now expanding into Merchant Processing. We are looking for an experienced individual with knowledge of how credit card processing works from pricing to service. The candidate must speak good English and has opportunity for advancement as this division of G2 grows. The hours of operation are in California, US Pacific time zone. The job is part time to start with likelihood to become full time as the company grows. Pay will be hourly plus revenue sharing for someone with the right skills.",
    "skills": [],
    "jobID": "6740c50e-2ff1-4048-b9dd-2fabea5ea2c6"
  },
  {
    "jobTitle": "Software Developer",
    "jobDescriptionUrl": "https://hubstafftalent.net/jobs/software-developer-6602b7",
    "payRate": "",
    "companyName": "Classboxes Technologies",
    "companyUrl": "http://www.classboxes.com/",
    "jobLocation": "Piscataway, New Jersey, United States",
    "isRemote": false,
    "createdDate": "June 20, 2024 at  3:52 pm",
    "jobDescription": "Job Description:\nWe are seeking a talented Java Developer to join our dynamic team. The ideal candidate will have a strong background in Java development, with a passion for creating high-quality, scalable software solutions.\nResponsibilities:\nDesigning, developing, and maintaining high-performance Java applications\nCollaborating with cross-functional teams to define, design, and ship new features\nTroubleshooting and debugging issues to optimize performance\nWriting clean, efficient, and maintainable code\nParticipating in code reviews and providing constructive feedback\nKeeping up-to-date with the latest industry trends and technologies\nRequirements:\nBachelor's degree in Computer Science, Engineering, or related field\nProven experience as a Java Developer, with a strong portfolio of projects\nProficiency in Java programming language and related frameworks (e.g., Spring, Hibernate)\nExperience with web development technologies (HTML, CSS, JavaScript)\nFamiliarity with relational databases (e.g., MySQL, PostgreSQL)\nExcellent problem-solving and communication skills\nAbility to work independently and as part of a team in a fast-paced environment\nPreferred:\nExperience with Agile development methodologies\nKnowledge of cloud computing platforms (e.g., AWS, Azure)\nFamiliarity with microservices architecture\nUnderstanding of software testing principles and practices\nBenefits:\nCompetitive salary\nHealth, dental, and vision insurance\nRetirement savings plan\nFlexible work hours\nOpportunities for professional development and growth",
    "skills": [],
    "jobID": "a2cea46d-93d9-4856-a793-cb625892cdf8"
  }
]