[
  {
    "jobTitle": "Translation",
    "companyName": "Andromache books",
    "jobLocation": "occasional travel",
    "jobDescriptionUrl": "https://remote.com/jobs/andromache-books-c1lc7acu/translation-j15gg6sk",
    "jobSalary": "NA",
    "jobType": "Part-time",
    "Description": [
      "",
      "We are seeking freelance translators from the following countries:",
      "- Philippines (Cantonese and Tagalog)",
      "- Spain (Spanish)",
      "- Brazil (Portuguese)",
      "- Turkey (Turkish)",
      "- Hong Kong (Cantonese and Chinese)",
      "- China (Chinese)",
      "- Japan (Japanese)",
      "*Requirements:*",
      "- Native-level fluency in the target language",
      "- Excellent translation skills",
      "- Ability to work independently",
      "- Familiarity with translation tools and software (preferable)",
      "*Interested applicants should send their:*",
      "- Resume",
      "- Language pair(s) expertise",
      "- Samples of previous translation work (if available)",
      "Note: Only freelancers from the specified countries will be considered for this opportunity."
    ],
    "jobID": "c580131d-3863-4799-8d58-92fa3bbc72c5"
  },
  {
    "jobTitle": "Project Manager",
    "companyName": "The Time Capsule Project CIC",
    "jobLocation": "fully remote",
    "jobDescriptionUrl": "https://remote.com/jobs/the-time-capsule-project-cic-c1l2n986/project-manager-j1bvn2m1",
    "jobSalary": "90k - 120k USD",
    "jobType": "Full-time",
    "Description": [
      "We seek an experienced Project Manager to oversee the coordination and administration of all aspects of an ongoing project including planning, organizing, staffing, leading, and controlling program activities.",
      "Key Responsibilities:",
      "- Project Execution: Oversee the detailed execution of international cultural preservation projects from initiation to completion. Manage timelines and resources, and ensure project milestones are met.",
      "- Team Coordination: Coordinate cross-functional teams across different time zones to ensure effective communication and collaboration. Act as the point of contact for all project-related communications.",
      "- Stakeholder Engagement: Maintain continuous communication with internal and external stakeholders, adjusting project scopes, timelines, and outcomes in response to stakeholder input.",
      "- Documentation & Compliance: Ensure all project documentation is maintained according to standards, and comply with regulatory and governance frameworks.",
      "- Quality Control: Implement and oversee project quality control processes, ensuring deliverables meet the expected quality and are consistent with project goals.",
      "- Budget Management: Develop and monitor project budgets; ensure financial accountability and cost-efficiency.",
      "Required Skills:",
      "- Proven experience as a Project Manager, preferably with experience in international projects.",
      "- Familiarity with both Agile and Waterfall project management methodologies.",
      "- Strong leadership skills and experience in project/program management.",
      "- Excellent communication and interpersonal skills, with an ability to handle complex negotiations and promote collaboration.",
      "- Ability to work under pressure, meet deadlines, and adjust to changing priorities.",
      "- Advanced proficiency with project management software tools, methodologies, and best practices.",
      "- Bachelor’s degree in Project Management, Business Administration, or related field.",
      "Type: Full-time",
      "Level: Mid-Senior Level",
      "Salary: $90,000 - $120,000 per year, commensurate with experience",
      "Benefits: Comprehensive health coverage, generous paid time off, wellness program, professional development opportunities, flexible working hours."
    ],
    "jobID": "7467d7e7-aafb-4c42-b201-11d81e8fa16e"
  },
  {
    "jobTitle": "International Import and Export Trade Assistant",
    "companyName": "SUERGIT LTD",
    "jobLocation": "remote - Vietnam only",
    "jobDescriptionUrl": "https://remote.com/jobs/suergit-ltd-c1xrnu3t/international-import-and-export-trade-assistant-j11aa0qa",
    "jobSalary": "NA",
    "jobType": "Full-time",
    "Description": [
      "Job Advertisement: International Import and Export Trade Assistant",
      "We are looking for an International Import and Export Trade Assistant to join our team. This role involves researching food distributors abroad and gathering customs data on importers and exporters.",
      "Key Responsibilities:",
      "Researching food distributors in multiple countries.",
      "Collecting and analyzing customs data for importers and exporters.",
      "Assisting in preparing detailed reports for management.",
      "Requirements:",
      "Interest in international trade, import, and export.",
      "Strong analytical and communication skills.",
      "Ability to work independently.",
      "To apply, please send your resume and cover letter.",
      "Tuyển dụng: Trợ lý Thương mại Xuất nhập khẩu Quốc tế",
      "Chúng tôi đang tìm kiếm một Trợ lý Thương mại Xuất nhập khẩu Quốc tế để tham gia vào đội ngũ của chúng tôi. Vị trí này bao gồm việc nghiên cứu các nhà phân phối thực phẩm ở nước ngoài và thu thập dữ liệu hải quan về các nhà nhập khẩu và xuất khẩu.",
      "Nhiệm vụ chính:",
      "Nghiên cứu các nhà phân phối thực phẩm ở nhiều quốc gia khác nhau.",
      "Thu thập và phân tích dữ liệu hải quan cho các nhà nhập khẩu và xuất khẩu.",
      "Hỗ trợ trong việc chuẩn bị các báo cáo chi tiết cho ban quản lý.",
      "Yêu cầu:",
      "Có hứng thú với thương mại quốc tế, nhập khẩu và xuất khẩu.",
      "Kỹ năng phân tích và giao tiếp tốt.",
      "Có khả năng làm việc độc lập.",
      "Để ứng tuyển, vui lòng gửi CV và thư xin việc của bạn.",
      "招聘国际进出口贸易助理",
      "我们正在寻找一位国际进出口贸易助理加入我们的团队。这个职位的工作内容包括研究海外食品分销商并收集进出口商的海关数据。",
      "主要职责：",
      "研究多个国家的食品分销商。",
      "收集并分析进出口商的海关数据。",
      "协助准备管理层所需的详细报告。",
      "职位要求：",
      "对国际贸易、进出口有兴趣。",
      "具备较强的分析能力和沟通技巧。",
      "能够独立工作。",
      "如果您有意向加入我们，请将您的简历和求职信发送给我们。",
      "Anuncio de Trabajo: Asistente de Comercio Internacional de Importación y Exportación",
      "Estamos buscando un Asistente de Comercio Internacional de Importación y Exportación para unirse a nuestro equipo. Este rol implica la investigación de distribuidores de alimentos en el extranjero y la recopilación de datos aduaneros sobre importadores y exportadores.",
      "Responsabilidades Principales:",
      "Investigar distribuidores de alimentos en varios países.",
      "Recopilar y analizar datos aduaneros de importadores y exportadores.",
      "Colaborar en la preparación de informes detallados para la dirección.",
      "Requisitos:",
      "Interés en comercio internacional, importación y exportación.",
      "Habilidades analíticas y de comunicación sólidas.",
      "Capacidad para trabajar de forma independiente.",
      "Para aplicar, por favor envíe su currículum y carta de presentación.",
      "Annonce d'Emploi : Assistant(e) de Commerce International Import-Export",
      "Nous recherchons un(e) Assistant(e) de Commerce International Import-Export pour rejoindre notre équipe. Ce rôle implique la recherche de distributeurs alimentaires à l'étranger et la collecte de données douanières sur les importateurs et exportateurs.",
      "Responsabilités Principales :",
      "Recherche de distributeurs alimentaires dans plusieurs pays.",
      "Collecte et analyse de données douanières pour les importateurs et exportateurs.",
      "Assistance dans la préparation de rapports détaillés pour la direction.",
      "Exigences :",
      "Intérêt pour le commerce international, l'importation et l'exportation.",
      "Bonnes compétences analytiques et de communication.",
      "Capacité à travailler de manière autonome.",
      "Pour postuler, veuillez envoyer votre CV et lettre de motivation.",
      "إعلان وظيفي: مساعد تجارة دولية للاستيراد والتصدير",
      "نبحث عن مساعد تجارة دولية للانضمام إلى فريقنا. يتضمن هذا الدور البحث عن موزعين للأغذية في الخارج وجمع بيانات جمركية حول المستوردين والمصدرين.",
      "المسؤوليات الرئيسية:",
      "البحث عن موزعين للأغذية في عدة دول.",
      "جمع وتحليل البيانات الجمركية للمستوردين والمصدرين.",
      "المساعدة في إعداد تقارير مفصلة للإدارة.",
      "المتطلبات:",
      "اهتمام بالتجارة الدولية والاستيراد والتصدير.",
      "مهارات تحليلية واتصال قوية.",
      "القدرة على العمل بشكل مستقل.",
      "للتقديم، يرجى إرسال سيرتك الذاتية ورسالة تغطية."
    ],
    "jobID": "af060866-e4ec-46d7-a829-2f252925c5ca"
  },
  {
    "jobTitle": "Engineering Manager, Platform",
    "companyName": "Fleetio",
    "jobLocation": "remote - Canada +2 more",
    "jobDescriptionUrl": "https://remote.com/jobs/fleetio-c1vr8pe1/engineering-manager-platform-j17gdubt",
    "jobSalary": "NA",
    "jobType": "Full-time",
    "Description": [
      "The Fleetio Engineering Team is looking for a Platform Engineering Manager to lead our Platform Engineering efforts. In this role, you will lead the platform engineering team that handles SRE (Site Reliability Engineering), Infrastructure, Developer Experience, and our public-facing API.",
      "You will influence the following areas: platform engineering vision, setting goals for your team, hiring engineering talent, and driving platform engineering efforts. You will collaborate closely with fellow engineering leaders, product managers, and other stakeholders to provide reliable service to our customers and a great developer experience for our developers that enables developer productivity and consistent delivery. You will also develop our engineering talent and grow their careers at Fleetio!",
      "If you are an engineering leader with strong technical expertise, excellent leadership skills, and a passion for providing a great experience for customers and developers, we would love to connect with you!",
      "A little about us… Fleetio is a modern software platform that helps thousands of organizations around the world manage their fleet operations. Transportation technology is a hot market and we’re leading the charge, with raving fans and new customers signing up every day. We raised $144M in Series C in June of 2023 and are on an exciting trajectory as a company. Fleetio is also a proud founding member of the Rails Foundation!",
      "Watch our culture videos: https://fleet.io/culture",
      "Fleetio overview video: https://www.youtube.com/watch?v=IlvIbwZT3oU",
      "Our careers page: https://www.fleetio.com/careers",
      "This is a remote opportunity and is open to candidates in the United States, Canada, or Mexico.",
      "The ideal candidate for this role possesses a blend of technical expertise, leadership skills, business acumen, and the ability to forge a vision for Fleetio’s Platform Engineering team. You have a solid background in Site Reliability, Infrastructure Engineering/DevOps, Developer Experience and building APIs. Your leadership experience includes successfully managing and inspiring high-performing engineering teams, driving innovation, and fostering a collaborative work culture. You exhibit strong problem-solving skills and adaptability to a fast-paced environment. This role is part of the Engineering Leaders group and will report to the VP of Engineering.",
      "Drive SRE efforts to provide a highly reliable and performant service to our customers",
      "Partner with engineering managers to address any performance issues or bottlenecks",
      "Continuously plan, optimize, and scale our infrastructure to support the growth of our platform",
      "Maintain an excellent developer experience for our engineers that aids in improving developer productivity and happiness",
      "Advance, scale and support our API to help meet the needs of external users/developers",
      "Drive mobile platform engineering work by partnering with the mobile team",
      "Holistically mentor and guide direct reports in professional development and career growth",
      "Foster a positive and productive work environment that boosts the morale of your team",
      "Review your teams' code as necessary to ensure quality, maintain consistency, and share knowledge",
      "Advocate for and mentor the team on engineering best practices",
      "Communicate timely updates and progress on initiatives to relevant stakeholders",
      "2+ years of experience leading platform engineering teams as a Manager or as a Director",
      "Proven expertise in leading SRE, DevOps, or Infrastructure Engineering teams",
      "Prior experience building applications using Ruby-on-Rails or similar frameworks",
      "Solid expertise in the latest development, build, test, and deploy practices that drive agility, consistent delivery, and quality",
      "Strong passion and track record of attracting, developing, and retaining engineers",
      "Experience utilizing APM tools to monitor and troubleshoot issues",
      "Excellent written and verbal communication skills",
      "Be sure to mention \"coffee\" in your application so we know you read this",
      "Multiple health/dental coverage options",
      "Vision insurance",
      "Incentive stock options",
      "401(k) match of 4%",
      "PTO - 4 weeks",
      "12 company holidays + 2 floating holidays",
      "Parental leave- birthing parent (12 weeks paid) non-birthing (4 weeks)",
      "FSA & HSA options",
      "Short and long term disability (short term 100% paid)",
      "Community service funds",
      "Professional development funds",
      "Wellbeing fund - $150 quarterly",
      "Business expense stipend- $125 quarterly",
      "Mac laptop + new hire equipment stipend",
      "Monthly catered lunches",
      "Fully stocked kitchen with tons of drinks & snacks",
      "Remote working friendly since 2012 #LI-REMOTE",
      "Fleetio provides equal employment opportunities to all employees and applicants and prohibits discrimination and harassment. We celebrate diversity and are committed to creating an inclusive environment for all. All employment is decided on the basis of qualifications, merit and business need.",
      "This application is not intended to and does not create a contract or offer of employment. Employment with Fleetio is at will.",
      "If you have a disability or a special need that requires an accommodation to fill out the online application, please let us know by calling (205) 718-7500."
    ],
    "jobID": "86f0c514-25c3-4bf1-b5c1-5db895e18401"
  },
  {
    "jobTitle": "Engineering Manager, Workflow Experience (NZT-CST)",
    "companyName": "Zapier",
    "jobLocation": "remote - New Zealand only",
    "jobDescriptionUrl": "https://remote.com/jobs/zapier-c1gf7noi/engineering-manager-workflow-experience-nzt-cst-j1mc92qo",
    "jobSalary": "184k - 276k USD",
    "jobType": "Full-time",
    "Description": [
      "Job Posted: April 1, 2024",
      "Location: Given the team's geographical distribution, we are only able to consider candidates who are based in New Zealand, PST, MST and CST",
      "",
      "Hi there!",
      "We're looking for an Engineering Manager to join the team at Zapier. We’re on a mission to make everyone more productive at work. Zapier has helped millions of people build businesses through the power of automation.",
      "Zapier’s Observe team is on a mission to revolutionize admins’ interaction with our platform, focusing on enhancing visibility, insights, and trust. Our aim includes:",
      "Identifying opportunities to provide admins with real-time insights into task usage and performance, increasing value awareness across Zapier.",
      "Collaborating closely with Design, Product, and Engineering to create an intuitive, user-centric experience.",
      "Owning the entire process of notification management, performance reporting, and log content refinement.",
      "Continuously innovating and implementing new features such as a resolution center and alarm capabilities to proactively manage potential issues.",
      "Constantly sharing learnings and insights with other teams, promoting knowledge exchange within Zapier.",
      "We’re a globally distributed team, from New Zealand to the Americas, working together to make Zapier the trusted, go-to partner for business automation.",
      "If you’re interested in advancing your career at a fast-growing, profitable, impact-driven company, then read on…",
      "Our Commitment to Applicants",
      "Culture and Values at Zapier",
      "Zapier Guide to Remote Work",
      "Zapier Code of Conduct",
      "Diversity and Inclusivity at Zapier",
      "",
      "You are an effective team builder. This isn't your first rodeo. You have at least four years of experience managing teams of at least 4-5 engineers Backend & Frontend Engineers. You know how to hire, train, and develop engineers from all backgrounds. You understand the benefits of building a diverse and inclusive engineering team.",
      "You have experience with experimentation. Utilizing experiments to drive continuous improvements.  These include a combination of bold changes (”shark bites”) and smaller improvements (”fish bites”).  You understand how to optimize for rapid experimentation and follow-up iteration.",
      "You’re a product thinker. As an Engineering Manager, you’ve worked to set goals, metrics, and a strategy for a product-focused Engineering team. You push your team to prioritize impactful work to meet the company’s goals.  You can articulate how engineering-driven projects (aka addressing tech debt) help the team meet team and company goals, and can work with your product counterpart to prioritize them appropriately.",
      "You can keep track of, prioritize, and lead multiple projects. There's no shortage of things you could be doing in a day. You'll carve out time for functional projects and make sure they solve real problems the team faces -- ideally making development even easier.",
      "You have excellent communication skills. You regularly work with engineers and other stakeholders from various disciplines, balancing engineering concerns, such as technical debt, with product concerns. Ideally, you find solutions that address both the team and user needs, but if not, help build understanding around difficult decisions.",
      "You are a skilled engineering leader. You've got a strong background in leading a team of Engineers working in our stack (Python, Django or React, AWS infrastructure, etc.).  You understand how your team’s services work and can provide feedback on designs proposed by your engineers. You hold a high standard for operational excellence, monitoring service health and addressing issues.",
      "You're adaptable. You've been in fast-growing companies and know how to build, change, and adapt to the needs of a company as it grows.",
      "",
      "Work closely with your engineering function, peer design function, and product function to create a trio that tackles user problems and solutions.",
      "Develop effective ways to communicate, monitor, and lead your team through weekly one-on-ones and team meetings.",
      "Keep the leadership team informed on your team’s progress in ways that are easy and enjoyable to receive, like one-on-ones, update posts, and regular team hangouts.",
      "Build rapport with each member of the Engineering Team and support them through coaching and mentorship to help level up their skills.",
      "Drive continuous improvement through sprint retros, process improvements, and removal of technical blockers.",
      "Ensure your team defines and executes technical solutions in alignment with Zapier security requirements, architectural guidelines, system design principles, and engineering best practices.",
      "Collaborate across various disciplines (Product Managers, Designers, Researchers) to help set quarterly roadmaps that will achieve business goals through engineering best practices.",
      "Actively recruit, onboard, and train new engineers at Zapier. This might involve tweaking the skills portions of interviews or writing better documentation.",
      "Keep in touch with customer needs by reviewing or participating in customer interviews, sales calls, and user testing sessions.",
      "",
      "At Zapier, we believe that diverse perspectives and experiences make us better, which is why we have a non-standard application process designed to promote inclusion and equity. We're looking for the best fit for each of our roles, regardless of the type of education or companies in your background, so we encourage you to apply even if your skills and experiences don’t exactly match the job description. All we ask is that you answer a few in-depth questions in our application that would typically be asked at the start of an interview process. This helps speed things up by letting us get to know you and your skillset a bit better right out of the gate. Please be sure to answer each question; the resume and CV fields are optional.",
      "After you apply, you are going to hear back from us—even if we don’t see an immediate fit with our team. In fact, throughout the process, we strive to never go more than seven days without letting you know the status of your application. We know we’ll make mistakes from time to time, so if you ever have questions about where you stand or about the process, just ask your recruiter!",
      "Zapier is an equal-opportunity employer and we're excited to work with talented and empathetic people of all identities. Zapier does not discriminate based on someone's identity in any aspect of hiring or employment as required by law and in line with our commitment to Diversity, Inclusion, Belonging and Equity. Our code of conduct provides a beacon for the kind of company we strive to be, and we celebrate our differences because those differences are what allow us to make a product that serves a global user base. Zapier will consider all qualified applicants, including those with criminal histories, consistent with applicable laws.",
      "Zapier is committed to inclusion. As part of this commitment, Zapier welcomes applications from individuals with disabilities and will work to provide reasonable accommodations. If reasonable accommodations are needed to participate in the job application or interview process, please contact jobs@zapier.com.",
      "",
      "The anticipated application window is 30 days from the date job is posted, unless the number of applicants requires it to close sooner or later, or if the position is filled.",
      "Even though we’re an all-remote company, we still need to be thoughtful about where we have Zapiens working. Check out this resource for a list of countries where we currently cannot have Zapiens permanently working."
    ],
    "jobID": "2d196a86-2636-4880-a928-ede63a01b966"
  },
  {
    "jobTitle": "Engineering Manager - Ubuntu Systems Management",
    "companyName": "Canonical",
    "jobLocation": "fully remote",
    "jobDescriptionUrl": "https://remote.com/jobs/canonical-c11tjiq0/engineering-manager-ubuntu-systems-management-j1ug5f4m",
    "jobSalary": "NA",
    "jobType": "Full-time",
    "Description": [
      "This is an engineering management role to lead the reboot of our Landscape systems management solution for Ubuntu.",
      "Ubuntu is growing rapidly in the enterprise, with estates expanding from cloud, to bare metal servers, to vSphere clusters, and of course desktops and devices. Ubuntu is easy to deploy and configure, one node at a time, but it's difficult to know where you stand on policy and compliance, patch management, or access control across a large estate. Ubuntu used to be under the radar in the enterprise, but it is now becoming an official platform for many companies. Those enterprises very much want a high quality way to manage their Ubuntu estate.",
      "We started work on Landscape many years ago, and the current generation of the service reflects the choices of the day. We now have the opportunity to invest significantly in a team to bring a fresh new vision for large-scale Ubuntu estate management to the project. That doesn't make this a greenfield opportunity - we have a system that serves thousands of deployments - but we know we want to step back and give it a big new push, letting go of some things that are no longer so important, and embracing a range of new priorities. This role is the critical engineering leadership role for that mission.",
      "Today we use Python, PostgreSQL, RabbitMQ, HAProxy, and have a ReactJS front end. In other web services projects we use more Golang these days. Our next wave of Landscape engineering is an opportunity to raise the bar on SAAS and on-prem solution technologies, architectures, patterns and operations. Our goal is to make it easy for enterprises to own a few Landscape instances that serve their global estate, and to be able to apply policy and know intuitively where they stand - globally - in a very complex world of mixed Ubuntu versions, substrates and flavours.",
      "Engineering managers at Canonical bring both technical and management skills to the leadership of their teams. You will work closely with product managers, and produce an engineering roadmap with ambitious and achievable goals. A successful applicant will be capable of growing a team of engineers, collaborating with other engineering and business teams at Canonical, and providing periodic updates about successes and areas of improvement.",
      "As an engineering manager at Canonical you must be technically strong, but your responsibility is to run an effective team and develop the colleagues you manage. You are expected to help them grow as engineers, do important work, do it outstandingly well, find professional and personal satisfaction, and work well with colleagues and community. Technical leadership experience and a background in software engineering are necessary prerequisites for this role. You will be expected to lead, challenge, and develop strong engineers, positively influence the culture, facilitate technical delivery, and work with your team on strategy and execution.",
      "We work in Python and Golang, and expect engineering managers to be fluent in the language, architecture and components that their team uses. Code reviews and architectural leadership are part of the job. As manager, the commitment to healthy engineering practices, documentation, quality and performance optimisation are equally important technical responsibilities, as is the requirement for fair and clear management, and the obligation to ensure a high performing team.",
      "Build and lead a team of engineers in your region",
      "Develop talent through coaching, mentoring, feedback, and hands-on career development",
      "Demonstrate sound engineering principles and directly contribute toward your team's goals",
      "Set and manage expectations with other engineering teams, management, and external stakeholders",
      "Lead modern, agile software development practices",
      "Ensure a healthy, collaborative engineering culture in line with the company values",
      "Be an active part of the leadership team and collaborate with other leaders in the organisation",
      "Build automated, highly reliable image delivery, testing and publication pipelines",
      "Engage with many other teams at Canonical, as well as the open source community and commercial partners",
      "Work from home with global travel 4-6 weeks per year for internal and external events",
      "You love to mentor, develop and grow people, and have a track record of doing it",
      "You are knowledgeable and passionate about software development",
      "You are focused on success and the delivery of timely, high quality software",
      "You have experience and commitment to agile development methodologies",
      "You have a Bachelor’s or equivalent in Computer Science, STEM or similar degree",
      "Software development experience in Python or Golang",
      "Effective written and verbal communication skills",
      "Practical experience with Linux system administration",
      "Personal learning and development budget",
      "Annual compensation review",
      "Recognition rewards",
      "Annual leave",
      "Priority Pass for travel",
      "Canonical is a growing international software company that works with the open-source community to deliver Ubuntu, the world’s best free software platform. Our services help businesses worldwide reduce costs, improve efficiency and enhance security with Ubuntu.",
      "We are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products. Whatever your identity we will give your application fair consideration.",
      "#LI-remote"
    ],
    "jobID": "89c9b8cb-7a5c-45e0-b69b-dc00f0814a6b"
  },
  {
    "jobTitle": "Senior Director, Product Design - Traffic",
    "companyName": "Turo",
    "jobLocation": "remote - Canada +4 more",
    "jobDescriptionUrl": "https://remote.com/jobs/turo-c1axoih7/senior-director-product-design-traffic-j1yssmue",
    "jobSalary": "230k - 275k USD",
    "jobType": "Full-time",
    "Description": [
      "As the world's largest car sharing marketplace, Turo is growing and hiring talent in the US, Canada, United Kingdom, France, and Australia. Our collaborative teams encourage you to be curious and bring new ideas that will drive our company’s mission. At Turo, we care deeply about our customers and one another; we celebrate diversity, support career growth, and empower teams to do their best work.",
      "About Our Team:",
      "At Turo, we recognize that great design is the cornerstone of our mission to revolutionize how the world uses its 1.5+ billion cars. It's not just about looks; it's about enabling entrepreneurial hosts to thrive, helping guests find their ideal car for every journey, and supporting them before, during, and after their trip. Here, design is not just valued—it's essential, driving our commitment to research and data-informed, customer-centric experiences that empower our community and enhance every trip.",
      "What you will do:",
      "As the Senior Director of Product Design for our Traffic domain, reporting to the SVP of Design, you will leverage your inspirational design leadership skills to shape and execute the UX strategy for our Traffic initiatives. Your mission is to help attract and engage millions of new Turo guests through innovative product design solutions. You will be a driving force behind our customer acquisition and engagement strategy, integrating our SEO, CRM efforts, and significant marketing investments. You and your team will be empowered to design every aspect of how our product attracts and engages new users, from a connected ecosystem of notifications to entirely new user acquisition and engagement flows. You will lead your team to consistently deliver impact on company-level growth objectives and key results, while enhancing quality and optimizing efficacy across our product through design craft.",
      "In this newly created role, you will collaborate closely with cross-functional teams, including data analysts, marketers, researchers, product managers, and engineers, to define and implement our product strategy. You will lead the design of traffic and engagement experiments, creating seamless experiences across multiple touchpoints in the funnel. As this is a newly established domain at Turo, in addition to having some player/coach responsibilities early on, you will also be responsible for building a top-tier product design team, and attracting and hiring talented designers as Turo continues to grow.",
      "Design Strategy: Develop and communicate a compelling UX roadmap that includes both short-term experiments and long-term initiatives for traffic and engagement experiences, collaborating closely with cross-functional partners.",
      "Design Oversight: Lead the planning, execution, culture, process, and outcomes of the traffic domain. Oversee multiple experiments, projects, and initiatives to attract and engage new Turo guests.",
      "Team Growth: Define resourcing plans, assess needs, make necessary adjustments, and advocate for headcount.",
      "Mentorship and Team Development: Manage and nurture the growth of IC Product Designers, providing coaching and mentorship to develop their skills and align their contributions with Turo’s design principles and career development rubric.",
      "Design Vision: Deliver innovative 'north star' designs that add new value and drive Turo forward, embodying our design principles and commitment to redefining the car-sharing experience through design.",
      "Functional Leadership: Serve as a dynamic role model within the design function, fostering a culture of design craft, quality, and data-informed design decisions.",
      "Tools and Operational Enhancements: Collaborate with design leadership to continuously evolve and enhance our design tools, operations, and processes to boost efficiency, creativity, and consistency across the design function.",
      "Your profile:",
      "Proven experience leading teams focused on increasing market awareness, attracting a wider consumer base, new user acquisition, and first-time user experience (e.g., growth or top-of-funnel traffic teams).",
      "A compelling portfolio showcasing work executed by a team under your leadership, including detailed narratives of how your design contributions led to quantifiable business and user experience improvements.",
      "Deep understanding of experimentation practices, including how and when to use methods like research deep dives, user interviews, and A/B testing to increase confidence and validate hypotheses, accelerating time to impact.",
      "Experience with data-informed design methodologies and a demonstrated history of partnering with data teams to launch and improve impactful solutions for customers and the business.",
      "At least 5 years of experience leading and managing a design team, with a proven track record of nurturing talent and fostering a collaborative and innovative design culture.",
      "Minimum of 8 years experience in designing consumer mobile products successfully shipped to the public, demonstrating deep expertise in native mobile design.",
      "Strong commitment to a user-centered approach in designing software, focusing on understanding and meeting customers' needs.",
      "Experience in attracting, hiring, and nurturing design talent, building a team that excels in craft and innovation, and consistently delivering quality.",
      "Collaborative, low-ego approach to working with others, valuing teamwork and collective problem-solving.",
      "Flexibility and good judgment.",
      "Bonus if you have:",
      "We will consider both remote candidates and candidates local to the San Francisco Bay Area. If you are local, you will benefit from bonding with most of the Product Development organization in person and taking advantage of our San Francisco office location for in-person collaboration. We believe these face-to-face connections can enrich teamwork and enhance the design process.",
      "This role may include Product Development team members based in France, so experience and flexibility in working with international team members is a plus.",
      "The San Francisco base salary target range for this full-time position is $230,000 - $275,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target for new hire salaries for the position in this location. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your work location during the hiring process.",
      "#LI-ZS1"
    ],
    "jobID": "fcf7ac4b-bea7-406c-9227-81cd94c9a744"
  },
  {
    "jobTitle": "Staff Web Designer",
    "companyName": "Mozilla",
    "jobLocation": "fully remote",
    "jobDescriptionUrl": "https://remote.com/jobs/mozilla-c1fpl22i/staff-web-designer-j1efgdi4",
    "jobSalary": "NA",
    "jobType": "Full-time",
    "Description": [
      "Why Mozilla?",
      "Mozilla Corporation is the non-profit-backed technology company that has shaped the internet for the better over the last 25 years. We make pioneering brands like Firefox, the privacy-minded web browser, and Pocket, a service for keeping up with the best content online. Now, with more than 225 million people around the world using our products each month, we’re shaping the next 25 years of technology and helping to reclaim an internet built for people, not companies. Our work focuses on diverse areas including AI, social media, security and more. And we’re doing this while never losing our focus on our core mission – to make the internet better for people.",
      "The Mozilla Corporation is wholly owned by the non-profit 501(c) Mozilla Foundation. This means we aren’t beholden to any shareholders — only to our mission. Along with thousands of volunteer contributors and collaborators all over the world, Mozillians design, build and distribute open-source software that enables people to enjoy the internet on their terms.",
      "About this team and role:",
      "As a Staff Web Designer, you will be responsible for overseeing and executing the design of marketing websites. Your deep understanding of design, design systems, and design-to-code principles will be essential in creating visually stunning and functional web experiences that align with the Mozilla brand and mission. You will work to create and elevate designs on high-traffic websites such as mozilla.org while working with UX and product teams to maintain consistency and quality across our digital platforms.",
      "The Marketing Websites Team is a cross-functional team in the marketing organization that manages multiple web properties, including www.mozilla.org. We deliver web and digital experiences that tell the Mozilla story and provide users access to Mozilla products and services. The websites we build and maintain reach millions of users every month. We view our web properties as an extension of the Mozilla mission, and we strive to keep very high standards for security, accessibility, and compatibility.",
      "What you'll do:",
      "Collaborate with product and UX designers to understand project requirements and objectives.",
      "Lead and actively participate in design brainstorming sessions and critiques.",
      "Create designs for marketing websites.",
      "Ensure all design work adheres to established brand guidelines and design systems.",
      "Prepare and document designs, and work with developers to translate designs into code.",
      "Ensure designs meet the Mozilla standard for accessibility",
      "Manage multiple design projects simultaneously, meeting project timelines and deadlines.",
      "Contribute to the development of design and component systems, ensuring scalability and reusability.",
      "What you'll bring:",
      "Extensive Web Design Experience: A proven track record with several years of experience in web design, particularly focused on marketing websites.",
      "Design-to-Code Skills: Proficiency in understanding how designs turn into functional code, and an understanding of how design decisions impact development.",
      "Design Systems Knowledge: Familiarity with design systems and the ability to create and maintain design and component libraries for consistency.",
      "Creative Problem Solving: Proven ability to creatively solve design challenges and find innovative solutions.",
      "Collaboration: Excellent teamwork and communication skills, with the ability to work closely with cross-functional teams.",
      "Accessibility Advocate: A commitment to inclusive design, ensuring that websites are usable and enjoyable by a wide range of users, including those with disabilities.",
      "Bonus Points for…",
      "Brand Design: An understanding of branding principles and the ability to incorporate brand identity into web design.",
      "Experience with web animations: Strong consideration will be provided to candidates who understand web capabilities for layout, design, and animation, and bring that knowledge and understanding into their designs.",
      "A/B Testing: Experience with A/B testing methodologies and how design can help optimize website performance and conversion rates.",
      "What you’ll get:",
      "Generous performance-based bonus plans to all eligible employees - we share in our success as one team",
      "Rich medical, dental, and vision coverage",
      "Generous retirement contributions with 100% immediate vesting (regardless of whether you contribute)",
      "Quarterly all-company wellness days where everyone takes a pause together",
      "Country specific holidays plus a day off for your birthday",
      "One-time home office stipend",
      "Annual professional development budget",
      "Quarterly well-being stipend",
      "Considerable paid parental leave",
      "Employee referral bonus program",
      "Other benefits (life/AD&D, disability, EAP, etc. - varies by country)",
      "About Mozilla",
      "Mozilla exists to build the Internet as a public resource accessible to all because we believe that open and free is better than closed and controlled. When you work at Mozilla, you give yourself a chance to make a difference in the lives of Web users everywhere. And you give us a chance to make a difference in your life every single day. Join us to work on the Web as the platform and help create more opportunity and innovation for everyone online.",
      "Commitment to diversity, equity, inclusion, and belonging",
      "Mozilla understands that valuing diverse creative practices and forms of knowledge are crucial to and enrich the company’s core mission.  We encourage applications from everyone, including members of all equity-seeking communities, such as (but certainly not limited to) women, racialized and Indigenous persons, persons with disabilities, persons of all sexual orientations, gender identities, and expressions.",
      "We will ensure that qualified individuals with disabilities are provided reasonable accommodations to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment, as appropriate. Please contact us at hiringaccommodation@mozilla.com to request accommodation.",
      "We are an equal opportunity employer. We do not discriminate on the basis of race (including hairstyle and texture), religion (including religious grooming and dress practices), gender, gender identity, gender expression, color, national origin, pregnancy, ancestry, domestic partner status, disability, sexual orientation, age, genetic predisposition, medical condition, marital status, citizenship status, military or veteran status, or any other basis covered by applicable laws.  Mozilla will not tolerate discrimination or harassment based on any of these characteristics or any other unlawful behavior, conduct, or purpose.",
      "Group: C",
      "#LI-DNI",
      "Req ID: R2373"
    ],
    "jobID": "14bec817-4fb2-42bb-9323-25a688e22efa"
  },
  {
    "jobTitle": "Senior Product Design Manager, Design Systems",
    "companyName": "Gusto",
    "jobLocation": "remote - United States only",
    "jobDescriptionUrl": "https://remote.com/jobs/gusto-c1h6mxlf/senior-product-design-manager-design-systems-j1hm44hl",
    "jobSalary": "174k - 254k USD",
    "jobType": "Full-time",
    "Description": [
      "About the Role:",
      "Gusto is looking for an experienced design leader to join our Design Systems team. We’re looking for someone who’s equally interested in building a thriving team and thoughtfully designed products for our customers.",
      "This role will lead the design for Workbench, our design system. Workbench is the integral backbone to our product design practice and this leader will play a key role in leveling up the quality of our craft.",
      "This is a player-coach role where your responsibilities will include both people management and product design. You’ll be involved in the entire product development process from setting the long term vision to initial strategic planning; all the way to launching and iterating on components that solve for real customer experiences.",
      "Here’s what you’ll do day-to-day:",
      "Contribute to high-level strategic decisions around product design and development",
      "Establish and articulate design systems standards, usage guidelines and best practices to ensure a consistent and high quality user experience",
      "Provide design feedback to internal stakeholders that advocates for users and pushes the quality bar",
      "Ship with speed and consistency; you’ll need to have the ability to work on immediate needs while setting the future vision",
      "Coach, manage, and develop your team of designers",
      "Partner with PM and Engineering Leads to create a holistic system that works well for both our customers and our internal teams and establish approaches to measure the effectiveness of the system",
      "Collaborate with senior design leadership to set the overall design direction of the product and ensure the design systems aligns with the overall vision and direction of the product",
      "Inspire and educate the greater product design organization at Gusto to continue raising the bar on our experiences",
      "Here’s what we're looking for:",
      "8+ years' experience with at least 3 years focused on design systems",
      "Interest in and ability to work in a combination role: people management and contributing as an IC designer",
      "Strong, inclusive design background (accessibility in particular is important to us), with a track record of shipping high quality products and the systems that power them",
      "Someone with the technical proficiency to understand how to build and scale systems — we’re not looking for an engineer, but we do need someone who can understand technical concepts that are critical to shaping strategy and approach",
      "Ability to be pragmatic and solutions-oriented to ship iterative improvements to the system while balancing long term system integrity",
      "Strategic thinker who has experience working at different altitudes, across the entire customer journey",
      "Excellent communication and storytelling skills with the ability to rationalize the “why” behind design decisions",
      "Expertise collaborating with – and speaking the language of – product design, accessibility, engineering, brand design, and product management within the context of a design system",
      "Bonus",
      "Experience leading a visual design refresh and setting up scalable foundational approaches",
      "Experience building a native mobile design system alongside a web design system",
      "Experience designing products for small business owners and their unique needs",
      "At Gusto, we strive to provide rewards that empower employees to achieve their financial and personal goals. We offer competitive compensation packages with a strong emphasis on equity based compensation (ownership in Gusto). Our cash compensation amount for this role is targeted at $174,000 - $235,000/ year in Denver & most remote locations, and $204,000 - $254,000/ year for New York, Seattle and San Francisco. Final offer amounts are determined by multiple factors including candidate experience and expertise and may vary from the amounts listed above."
    ],
    "jobID": "3a4e36bf-6111-4bd0-83e9-63b3d3dacb1f"
  },
  {
    "jobTitle": "Vice President, Inside Sales",
    "companyName": "ExtraHop",
    "jobLocation": "fully remote",
    "jobDescriptionUrl": "https://remote.com/jobs/extrahop-c1ya1mij/vice-president-inside-sales-j1pmu1r1",
    "jobSalary": "197k - 245k USD",
    "jobType": "Full-time",
    "Description": [
      "ExtraHop is a leading provider of network detection and response (NDR) solutions, empowering enterprises to protect and accelerate their digital business. Our innovative approach to cybersecurity uses advanced machine learning and real-time analytics to provide deep visibility into network activity and detect threats before they can cause harm. We are committed to helping our customers secure their critical assets and ensure operational resilience in an ever-evolving threat landscape.",
      "We are seeking an experienced and dynamic Vice President of Inside Sales to lead our global inside sales team and drive revenue growth. The VP of Inside Sales will be responsible for building and scaling a high-performing, geographically diverse inside sales organization, developing and executing a strategic sales plan, and fostering a culture of excellence and accountability. The ideal candidate will have a proven track record in technology sales, a deep understanding of the cybersecurity landscape, and the ability to inspire and motivate a global sales team.",
      "",
      "Key Responsibilities:",
      "Develop and implement a comprehensive inside sales strategy to achieve global revenue targets and business growth objectives.",
      "Build, scale, and lead a geographically diverse team of inside sales representatives, ensuring high levels of performance and professional development across all regions.",
      "Collaborate with marketing, product management, and other departments to align global sales strategies with company goals and ensure seamless execution of sales initiatives.",
      "Analyze global sales metrics and performance data to identify areas for improvement and drive continuous optimization of sales processes.",
      "Foster a customer-centric culture within the global sales team, ensuring exceptional service and support throughout the sales cycle.",
      "Drive the adoption and utilization of modern sales tools and technologies to enhance productivity and effectiveness across all regions.",
      "Develop and maintain strong relationships with key customers and partners worldwide, acting as a trusted advisor and advocate for their needs.",
      "Prepare and present regular reports on global sales performance, forecasts, and market insights to the executive leadership team.",
      "Coach and guide early-in-career team members to be able to have effective conversations with executive buyers (CIO/CTO, VP/Dir. levels)",
      "Partner with sales leadership to develop a career progression plan for team members, laying the foundation for them to succeed in future roles.",
      "",
      "Qualifications:",
      "Bachelor’s degree in Business, Marketing, or a related field; MBA or equivalent advanced degree preferred.",
      "10+ years of experience in sales leadership roles, with a focus on inside sales within the technology sector.",
      "Proven track record of achieving and exceeding sales targets and driving significant revenue growth on a global scale.",
      "Deep understanding of the cybersecurity industry and the competitive landscape.",
      "Strong leadership and people management skills, with a demonstrated ability to build, scale, and motivate high-performing, geographically diverse teams.",
      "Excellent communication, negotiation, and interpersonal skills.",
      "Analytical mindset with the ability to leverage data to drive decision-making and process improvements.",
      "Proficiency with CRM software (e.g., Salesforce) and modern data enhancement technologies (e.g. LinkedIn Sales Navigator, Zoominfo, Groove, Highspot) and sales enablement tools.",
      "Ability to thrive in a fast-paced, dynamic environment and manage multiple priorities effectively.",
      "Experience with international markets and the complexities of global sales operations.",
      "Willingness to travel as needed.",
      "",
      "What We Offer:",
      "Competitive salary and performance-based bonuses",
      "Comprehensive benefits package, including health, dental, and vision insurance",
      "401(k) plan with company match",
      "Generous paid time off and holidays",
      "Opportunities for professional development and career advancement",
      "A collaborative and inclusive work culture",
      "",
      "ExtraHop is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees.",
      "",
      "Compensation for this role ranges from $197,00 to 245,000 base salary, 65/35 split, stock options"
    ],
    "jobID": "1daa14fc-7712-4410-97c7-1a71a05b5e12"
  },
  {
    "jobTitle": "Regional Sales Director, Emerging Markets -ASEAN",
    "companyName": "Zscaler",
    "jobLocation": "remote - Indonesia +3 more",
    "jobDescriptionUrl": "https://remote.com/jobs/zscaler-c1d2z165/regional-sales-director-emerging-markets-asean-j1yr505r",
    "jobSalary": "NA",
    "jobType": "Full-time",
    "Description": [
      "",
      "The Regional Sales Director, Emerging Growth Large Enterprise Segment, ASEAN will report to Regional Vice President, ASEAN & GCR  and will be responsible for building, directing and managing all field sales within the segment. You will have the opportunity to direct and drive new business, build customer loyalty, ensure high product renewal rates and support and promote corporate strategies and initiatives. Critical to success is the ability to build and manage high-performance teams, develop and execute area business plans, allocate appropriate resources, and develop internal and external relationships.The Zscaler sales team is composed of smart and tenacious people who are passionate about our vision of a secure, cloud-enabled digital future. By using their talent to share that vision, Zscaler sales teams are bringing the power and agility of cloud transformation to organizations around the world. Be a part of it!",
      "Responsibilities/What You’ll Do:",
      "Passionate, driven and results-oriented executive who can lead, develop and execute a regional sales strategy for Emerging Growth Countries including designing the Go-To-Market to best capture the addressable market together with the Marketing, Channels, and ecosystems team.",
      "Lead and mentor a team of Regional Sales Manager in the emerging growth market segment (Field Sales Reps) to drive rapid new business growth and deliver customer success in the segment that ensures quarterly sales quota achievement and over achieve sales goals with key account strategy mapped-out",
      "Recruit, hire and develop world class sales talent to be part of the team",
      "Engage and develop strong trusted relationships with customer C-suite executives and effectively influence on how Zscaler can assist in their security transformation journey and delivering customer success",
      "Actively lead the team in territory planning, account planning and opportunity development",
      "Establish a structured sales methodology and process, including opportunity validation, pursuit & closure, and a strong sales operating cadence, providing an accurate forecast and pipelines to our business",
      "Optimize sales tools and provide greater visibility, predictability, consistency and actionable data for targeted sales efforts",
      "Retain and grow existing customer base with engagement activities and create a good list of customers’ advocacy and references",
      "Bachelor's degree or global equivalent in a related field",
      "10 plus years of Enterprise Sales Leadership experience in software/SaaS",
      "Have demonstrated and delivered 2x growth in in initial growth phase in previous Enterprise Sales leadership role",
      "Multi-geography experience across 4 to 5 distinct markets with sales experience in Malaysia, Thailand, Philippines and Indonesia etc",
      "Proven track record of building and leading successful sales teams and engagement in complex deals structuring and managing Large Enterprise accounts",
      "Possessed strong existing network with C-suite executives in client organizations and track record in building C-suite relationships",
      "Track record of leading the sales team in structuring and closing large and complex deals",
      "Strong sales process and methodology around territory planning, assessment, and resource allocation.",
      "Strong leadership, planning, execution, people-management, and coaching skills",
      "Extensive business travel within the region - approximately 75 percent",
      "Strong communication skills and demonstrated ability to establish credibility and trust with customers and to build influential relationships with partners in the business, including Finance, Legal, HR, Inside Sales, Channel Partners and R&D",
      "Understand both business and people, including their drivers and success factors",
      "Understand and communicate the business value and/or ROI of installed and proposed products and solutions",
      "#LI-LK2"
    ],
    "jobID": "99da5176-0ba2-4c29-9a87-a3039f8cce0e"
  },
  {
    "jobTitle": "Senior Sales Operation Manager (Remote, UK)",
    "companyName": "Grafana Labs",
    "jobLocation": "remote - United Kingdom (UK) only",
    "jobDescriptionUrl": "https://remote.com/jobs/grafana-labs-c17v751x/senior-sales-operation-manager-remote-uk-j1znnnmq",
    "jobSalary": "94k - 112k GBP",
    "jobType": "Full-time",
    "Description": [
      "We're looking for a Sales Operations Manager to serve as a Business Partner to our EMEA and APAC Sales team with a specific emphasis on partnering with our sales leadership to provide operational rigor for our largest growth markets. In this role, you will serve as a key foundational hire in helping to scale our overall operational capabilities as we develop the guidelines and standards for establishing localized Sales Operations teams across our Americas, EMEA and APAC regions. The position requires strong business partnering skills, financial and business reporting, planning and modeling, process implementation skills and good business acumen.",
      "Key Responsibilities:",
      "This role will partner with our Americas BP, Sales Operations team, and overall Revenue Operations team to evaluate the general health of the sales organization in EMEA & APAC which represents Grafana’s highest growth regions by revenue",
      "Lead high quality and efficient operational programs to drive forecast accuracy & visibility, sales productivity, sales activity tracking, territory management, and policies across our EMEA & APAC sales organization",
      "Provide comprehensive analysis of territory alignment decisions; advise on sales quota setting process, execute on territory planning framework across the regions and segments in the EMEA & APAC region; help manage ongoing integrity of territories",
      "Provide guidance, insights and recommendations to the sales leadership team focused on increased revenue growth while improving overall sales team performance and effectiveness",
      "Create and distribute sales reports, dashboards, and intelligence to sales leadership and sales teams",
      "Requirements:",
      "Qualified candidates will have experience building and scaling Sales Operations in a high growth environment",
      "4+ years of experience in an analytical leadership role, and providing strategic guidance and operational oversight in Sales Operations within a software sales environment with an emphasis on prior business partnering support for an EMEA / APAC sales team",
      "Have solid project management skills including: planning work, managing details, keeping multiple tasks/projects on track, working with cross functional stakeholders, and navigating ambiguity to deliver results",
      "Experience with forecasting and opportunity management as well as analytics in Clari and Salesforce",
      "Experience in advanced Excel / Google Sheets modeling skills including analytics such as import functions, index matches and pivot tables",
      "Have an enthusiastic “roll up your sleeves” mentality",
      "Project management experience delivering quality product in a fast moving environment",
      "Team player with strong interpersonal skills and ability to take a leadership role",
      "Excellent facilitation and presentation skills across a range of roles from individual contributor to senior leader",
      "We are a remote first company so you should be experienced and skilled at working remotely with an international team",
      "We’re a high growth company, so your job duties will be varied and complex and will require strong judgment, collaboration, and leadership",
      "In the United Kingdom, the OTE compensation range for this role is £94,000 - £112,000.  Actual compensation may vary based on level, experience, and skillset as assessed in the interview process. Benefits include equity, bonus (if applicable), and other benefits listed on our careers page."
    ],
    "jobID": "08ca97a1-9093-4cb2-8f5b-0267d2ff4ecb"
  },
  {
    "jobTitle": "Customer Success Enablement Manager",
    "companyName": "HopSkipDrive",
    "jobLocation": "remote - United States only",
    "jobDescriptionUrl": "https://remote.com/jobs/hopskipdrive-c18udc50/customer-success-enablement-manager-j1t6yal5",
    "jobSalary": "75k - 90k USD",
    "jobType": "Full-time",
    "Description": [
      "Your role",
      "We are seeking a dynamic and motivated Customer Success Enablement Manager to join our innovative team. The selected candidate will play a crucial role in fostering a successful customer success environment by equipping our customer success team with the tools, knowledge, and support they need to maximize their performance, ensure the best success for our customers and drive revenue growth. The Customer Success Enablement Manager will collaborate cross-functionally, analyzing processes, creating training programs, and developing effective resources to empower our Customer Success team to achieve their targets.",
      "You have a strong sense of ownership and an entrepreneurial spirit, excited to grow and build within a rapidly growing technology company. You thrive in a fast-paced environment. You are honest and exhibit high integrity. You are proactive and excited to bring new ideas to the company. You adjust quickly to changes in priorities and conditions and cope effectively with complexity and change. You have high attention to detail. You are an excellent communicator who enjoys collaborating with others and has a strong understanding of customer success and/or sales enablement.",
      "At HopSkipDrive, we know that to tackle our toughest challenges, we need different approaches, unique perspectives, and new ways of thinking. We are building a team of creative problem-solvers from many different backgrounds. Above all, you want to help build something that fundamentally changes the lives of families for the better.",
      "What you’ll do",
      "The Customer Success Enablement Manager will:",
      "Collaborate with Revenue and Customer Success leadership to assess and identify team efficiency gaps and opportunities for improvement.",
      "Partner with the Director of Marketing, the Sales Enablement Manager, Product Marketing, Lifecycle Marketing, Revenue leadership, and more to implement, and maintain an effective enablement strategy aligned with organizational goals.",
      "Develop and execute impactful, data-driven solutions for elevating the customer success process and maximizing team productivity.",
      "Create training programs and deliver coaching sessions to the customer success team, focusing on customer success methodologies, product knowledge, objection handling, and overall customer success management and skills enhancement.",
      "Design and deliver training content incorporating various formats, such as presentations, e-learning modules, videos, playbooks, and scripts.",
      "Develop and maintain a comprehensive customer success knowledge base, including competitor analysis, industry trends, and customer success collateral.",
      "Assist in the onboarding process by conducting new hire training and providing ongoing support to ensure continuous development and success.",
      "Collaborate with the marketing and communications team to generate compelling customer success enablement collateral, including case studies, customer success decks, and product presentations.",
      "Continuously assess and enhance customer success training programs based on feedback, performance metrics, and evolving market dynamics.",
      "Regularly evaluate customer success team performance, identifying areas where additional support or skill improvement may be required.",
      "Monitor and promote adoption and utilization of customer success enablement tools, such as CRM systems and content management tools.",
      "Stay informed about emerging trends, technologies, and best practices in enablement to drive innovation and bring new ideas to the team.",
      "You will report directly to the Director of Marketing, while working very closely with Revenue and Customer Success leadership.",
      "What you bring",
      "Bachelor's degree in Business Administration, Marketing, Communications, or a related field (or equivalent experience).",
      "Proven experience in customer success and/or sales enablement, training, or a similar role within a B2B environment.",
      "Strong understanding of customer success processes, methodologies, and best practices.",
      "Excellent communication and presentation skills, with the ability to convey complex ideas in a clear and concise manner.",
      "Exceptional analytical and problem-solving abilities to identify gaps and design effective training interventions.",
      "Proficiency in using enablement tools, such as CRM systems, content management systems, and automation platforms.",
      "Ability to build strong relationships and collaborate with cross-functional teams, including revenue, marketing, and operations.",
      "Self-motivated and proactive mindset with the ability to work both independently and within a team, and a passion for our mission to create opportunity for all through mobility.",
      "High attention to detail and organizational skills to manage multiple projects simultaneously.",
      "Strong business acumen and a passion for staying abreast of market trends and competitive landscape.",
      "You lead with empathy. You understand the challenges of the Customer Success role because you have done it in the past or have worked closely with individuals who have.",
      "Experience digesting and leveraging data in order to draft a compelling story on how to improve product, process, or people.",
      "Familiarity with prioritization and time management best practices especially at a company experiencing high growth.",
      "Nice to have",
      "Experience working for a large tech organization, ideally in the EdTech space.",
      "Experience using Hubspot, Salesforce, WorkRamp, Seismic, and Google Suite",
      "Experience working with a smaller enablement function where responsibility is broad",
      "A growth mindset that enables you to receive and offer constructive feedback for the continuous development of the team.",
      "Our Investment In You",
      "We want you to be an owner in our company and share in executing our vision, so every full-time employee has equity. In addition, we offer competitive market comp, flexible vacation, FSA, medical, dental and vision, 401(k), and an opportunity to work for a uniquely positioned, VC-backed company in a hugely attractive space with significant upside potential. HopSkipDrive is committed to fair and equitable compensation practices. The salary range for this role is $75,000 to $90,000. Final compensation for this role will be determined by several factors such as a candidate’s relevant work experience, skill set and specific work location. The total compensation package for this role also includes equity stock options.",
      "",
      "HopSkipDrive is proud to be an equal opportunity employer.  All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, veteran status, or any other protected class.",
      "* This role will be fully remote in one of the following states AZ, CA, CO, CT, DC, FL, GA, IL, IN, KS, MA, MD, MI, MN, MO, NC, NJ, NM, NV, NY, OH, OK, OR, SC, TN, TX, UT, VA, WA, WI**",
      ""
    ],
    "jobID": "978542ae-d5a9-4eec-a209-e043c45b841c"
  },
  {
    "jobTitle": "Director, Enterprise Customer Success",
    "companyName": "SevenRooms",
    "jobLocation": "remote - United States only",
    "jobDescriptionUrl": "https://remote.com/jobs/sevenrooms-c1o6okf1/director-enterprise-customer-success-j1u5mdgj",
    "jobSalary": "165k - 175k USD",
    "jobType": "Full-time",
    "Description": [
      "As Director, Enterprise Customer Success, you will be responsible for ensuring the success, satisfaction and retention of SevenRooms’ enterprise customers around the globe.  You will lead a team of Enterprise and Key Accounts Customer Success Managers in North America, EMEA and APAC who are committed to building strong relationships with customers - your team will understand their needs and help them realize the full potential and capabilities of the SevenRooms platform. You will set the overall vision, direction and strategy of how our CSMs operate and how success is measured, using this data and insights to drive operational and process improvements for our global team.",
      "This role will report directly to our VP, Customer Success.",
      "Enterprise Customer Success Strategy:",
      "Set the overall vision and strategic plan for the Enterprise & Key Accounts CSM organization, focusing on driving customer health, product adoption, leading a positive customer experience, and driving growth through renewals and net retention improvements.",
      "In partnership with our VP, Customer Success and VP, Revenue Operations, define customer success metrics and KPIs and take an active role in monitoring customer health and overall team progress, proactively addressing issues or challenges",
      "Define and optimize customer lifecycle by driving programs and initiatives to improve engagement approaches based on customer segmentation and leading a culture of continuous improvement",
      "Help define and improve Enterprise & Key Accounts CSM onboarding and training to ensure every CSM has the knowledge, tools and resources to be successful",
      "Customer Health & Product Adoption:",
      "Collaborate with Customer Onboarding and Customer Support team to ensure smooth onboarding, implementation, handoff and long-term adoption and success",
      "Work closely with regional Enterprise & Key Accounts teams to understand nuance of client use-cases in NAM, EMEA and APAC and create programs that facilitate adoption and customer growth",
      "Influence future lifetime value through higher product adoption, customer satisfaction and overall health scores",
      "Customer Retention & Lifetime Value:",
      "Implement strategies to improve customer retention and reduce churn",
      "In partnership with Sales, create mechanisms & processes to identify & execute expansion opportunities within global enterprise customer base",
      "Work closely with sales to drive revenue growth",
      "Work closely with the sales management and Regional leaders to align on strategies, renewal forecasting, coverage plans, and account opportunities (i.e., opportunities and risks)",
      "Customer Feedback and Insights:",
      "Create system and mechanism for collecting and analyzing customer feedback in order to identify areas for improvement",
      "Advocate for customer needs/wants and provide input to product management and engineering teams through customer feedback loops",
      "Partner with Product for Enterprise and Key Account feature requestLeverage data and insights to make informed decisions and drive overall customer success initiatives",
      "Address escalated client issues with speed and urgency, orchestrating resources across the company as appropriate",
      "Team Leadership & Management:",
      "Manage and coach/develop a team of high performing Managers, Client Success throughout the globe, establishing goals and driving results",
      "Build and lead world-class global CSM team:",
      "Recruit and develop a high performing team",
      "Develop company-wide customer success motion integrating processes, content and data to/from stakeholder organizations (e,g., Marketing, Sales, Product/Engineering, etc)",
      "Drive operational practices to track performance of teams and individuals",
      "Deliver transformational leadership so that our global Enterprise & Key Accounts CSM team is highly motivated and engaged. Be an inspirational role model by challenging and maximizing the strength of the team and aligning their efforts to the mission and vision of the organization.",
      "A strategic leader with experience overseeing Global Enterprise and Key Account teams",
      "Experience in navigating change management",
      "Organized, thoughtful leader with experience creating SOPs and deliverables",
      "Executive presence, with the ability to support individual contributors",
      "A fresh start with a flexible and independent working schedule: SevenRooms provides all employees with their first two (2) weeks of employment as paid time off to relax and recharge before starting their journey with us. You'll also have access to unlimited paid time off, including tenure-based PTO minimums, paid parental leave, and the option to work anywhere at any time.",
      "Equitable compensation: Our compensation packages are based on external market data. At SevenRooms, you can expect to be paid well for your contributions towards transforming the hospitality industry. We also offer equity for all employees as part of our commitment to everyone being an owner and working together to build an outstanding company.",
      "The salary range for this role is $165,000.00 - $175,000.00. This is the range SevenRooms in good faith believes is the range of possible compensation for this role at the time of the posting. This range is only applicable for jobs to be performed remotely in any US state. Base pay offered may vary depending on, but not limited to education, experience, skills, geographic location, travel requirements, sales or revenue-based metrics, and business needs. This range may be modified in the future. This job is also bonus eligible. No amount is considered to be wages or compensation until such amount is earned, vested, and determinable.",
      "Comprehensive benefits package: We offer a full slate of benefits for our employees and their families: comprehensive medical, dental, and vision benefits, commuter benefits, gym reimbursement, 401K plan, life insurance, and unique wellness offerings including One Medical, Spring Health, Carrot, and Headspace.",
      "Employee programs and recognition: Through our Roomie's Choice program, all employees at SevenRooms receive a monthly stipend to spend however they see fit. You'll receive an additional quarterly dining credit to use towards SevenRooms clients and a unique milestone reward for every year you're a part of our team.",
      "Opportunities for training and professional development: Your manager will partner with you on establishing quarterly goals that not only benefit our organization but aid in your overall career development and advancement. SevenRooms also provides financial support for continuing education, certifications, or participation in external training programs."
    ],
    "jobID": "3f5fcd2d-0b84-42f1-bd55-245574dbbec4"
  },
  {
    "jobTitle": "Dedicated Customer Success Manager (IC)",
    "companyName": "Gusto",
    "jobLocation": "remote - United States only",
    "jobDescriptionUrl": "https://remote.com/jobs/gusto-c1h6mxlf/dedicated-customer-success-manager-ic-j1tl4lbn",
    "jobSalary": "91k - 119k USD",
    "jobType": "Full-time",
    "Description": [
      "About Dedicated Customer Success",
      "The Dedicated Customer Success team focuses on supporting our current customers as their businesses grow and their needs change. We do this through cultivating an ongoing professional relationship and proactive outreach to our customers during key moments in their lifecycle to drive more feature adoption (EVI) and extend the customer tenure and lifetime value with Gusto.",
      "Like a private business banker, you will be the go-to advisor for our clients to help them sustain growth through optimal utilization of the Gusto People Platform.",
      "We are looking for a Dedicated Customer Success Manager to join our Customer Success team at Gusto. You will work to drive customer education and EVI, maintain customer satisfaction, and increase retention with our largest and fastest growing customers. You will be part of our founding team that will grow into a best-in-class customer success engine for our highest value customers.",
      "Together we will be at the leading edge of our efforts to increase customer love, eradicate customer pain, and create a holistic, integrated customer journey. Our customers’ success is Gusto’s success.",
      "Here’s what you’ll do day-to-day:",
      "Management of a book of business for our Premium customers during their lifecycle and moments that matter on Gusto.",
      "Proactively educate and introduce features and apps to customers to drive product usage and overall “stickiness.”",
      "Build professional and psychological trust with our Premium customers by engaging regularly and being an expert about their business leverages Gusto",
      "Own your bias to drive strategic and intentional recommendations to our customers, matching their business and people growth with our capabilities.",
      "Lean into data to measure business insights, product feedback, market research",
      "Measure - we collect business insights, product feedback, marketing research with our content rich touchpoints with clients. We methodically collect, organize, and report on our findings to our cross-functional partners at Gusto",
      "Support navigation - helping our clients navigate Gusto’s CX organization",
      "Use your deep Gusto product knowledge and Sandler skills to help our current customers adopt the features they need to support their business needs",
      "Gather and share insights from your touchpoints from cross functional Gusto partners. They rely on our data gathering to make decisions on product roadmaps",
      "Represent the voice of the customer! You will fuel the feedback engine to inform our sales processes, our product roadmap, and help shape Gusto to be the product of our customers’ dreams.",
      "Here’s what we're looking for:",
      "2-4 years experience in high-volume customer facing roles (Customer Care, Customer Success, Account Manager, Sales Development Representative), preferably in the tech industry.",
      "Passionate about helping small business owners achieve more success through empathetic and consultative conversations.",
      "Comfort with ambiguity and willingness to experiment as we continue to build this team",
      "Exceptional communication skills with the ability to explain complex topics like payroll and R&D tax credits in an easy-to-understand way.",
      "Analytic and strategic thinker with the ability to translate individual conversations into themes and recommendations",
      "Energized by learning new skills to do the best work of your life",
      "Proficient in Gusto tools & systems (SFDC, Panda, GSuite)",
      "Resilience strongly preferred",
      "Strong to advanced Sandler skills",
      "Comfortable with data analysis and data storytelling",
      "Our cash compensation range for this role is $91,000 to $119,000 OTE in Denver, and Detroit locations.  Remote locations will vary based on our geographical pay approach. Final offer amounts are determined by multiple factors, including candidate location, experience and expertise, and may vary from the amounts listed above."
    ],
    "jobID": "87a7f155-11cd-4af2-94a5-d4008dc709fe"
  }
]