[
  {
    "jobTitle": "Seeking Expert Guidance on Maca and Its Benefits for Various Conditions",
    "jobDescriptionUrl": "https://app.connectively.us/#/queries/51849",
    "jobID": "364f8466-6643-4077-a04d-7bfbd5bb8938",
    "queryDescription": "We are currently developing an article focused on Maca and its benefits for various conditions. We are reaching out to experts in nutrition, dietetics, and the medical field to gather valuable insights. Our goal is to include expert opinions in our article to provide readers with useful information.\n\nWe would appreciate your expertise on the following questions:\n\nDoes Maca increase progesterone or estrogen?\nHow much Maca powder do you need daily for hormone balance?\nWhat happens when you take a lot of Maca powder?\nHow long does it take for Maca to balance hormones?\nAre there any important considerations to take while using Maca?\nWho shouldn’t take Maca?",
    "topics": [
      "Consumer General Interest",
      "Healthcare",
      "Lifestyle"
    ],
    "deadline": "Jul 5, 2024 - 11:00 PM",
    "mediaOutlet": "WowMD"
  },
  {
    "jobTitle": "Seeking Expert Advice on Ways to Boost Semen Volume and Sexual Stamina",
    "jobDescriptionUrl": "https://app.connectively.us/#/queries/51847",
    "jobID": "",
    "queryDescription": "We are working on a comprehensive article focused on natural methods to enhance semen volume and improve sexual stamina. We are reaching out to nutritionists, urologists, sexologists, and certified sexual health experts for their valuable insights. Your expertise could significantly enrich our content and help readers make informed decisions about their sexual well-being. If you have knowledge and experience in this area, we would love to hear from you.\n\n\nQuestions\n\n1. What foods naturally boost semen volume? \n2. How does hydration affect semen volume and quality? \n3. Can regular exercise improve sexual stamina? \n4. What role do vitamins and minerals play in increasing sexual stamina? \n5. What are some natural supplements that can enhance semen production?",
    "topics": [
      "Consumer General Interest",
      "Healthcare",
      "Lifestyle"
    ],
    "deadline": "Jul 2, 2024 - 10:00 PM",
    "mediaOutlet": "peakerect.com"
  },
  {
    "jobTitle": "Handymen wanted for tips on how to install blackout curtains properly for online article",
    "jobDescriptionUrl": "https://app.connectively.us/#/queries/51843",
    "jobID": "",
    "queryDescription": "Hi, \n\nI am looking for some professional handymen to share their step-by-step for installing blackout curtains properly to stop light leaking for a truly dark room for an online article. \n\nIt would be great to hear the step-by-step, the tools required (product recommendations welcome), and why it is important to take your time and do it properly. \n\nThanks and best, \nChiana.",
    "topics": [
      "Consumer General Interest",
      "Lifestyle"
    ],
    "deadline": "Jun 26, 2024 - 1:30 PM",
    "mediaOutlet": "Homes and Gardens"
  },
  {
    "jobTitle": "US-based interior designer to explain why marble checkered flooring is big at the moment,",
    "jobDescriptionUrl": "https://app.connectively.us/#/queries/51841",
    "jobID": "",
    "queryDescription": "I'm looking for a US-based interior designer to explain why marble checkered flooring is big at the moment, going into why it's popular, what to style it with, and how to bring it into the home with ways both renter-friendly and suitable for homeowners. If you have any pictures that match that you own the rights to, please send them my way! Thanks in advance.",
    "topics": [
      "Lifestyle"
    ],
    "deadline": "Jun 27, 2024 - 2:30 PM",
    "mediaOutlet": "Real Homes"
  },
  {
    "jobTitle": "US-based interior designer to comment on Taylor Swift's quiet luxury kitchen",
    "jobDescriptionUrl": "https://app.connectively.us/#/queries/51840",
    "jobID": "",
    "queryDescription": "I'm looking for a US-based interior designer to comment on Taylor Swift's quiet luxury kitchen (seen in the second video here https://www.instagram.com/p/C8e4dDJJLbD/?igsh=MXBwN3hieDlwMW91dw==). This will be going into the classic white and marble scheme, the glass cabinets, the centerpiece marble kitchen island in the middle, and the red rug that adds coziness, explaining why they all work well and how people can recreate the look at home. Thanks in advance!",
    "topics": [
      "Lifestyle"
    ],
    "deadline": "Jun 25, 2024 - 9:30 PM",
    "mediaOutlet": "Real Homes"
  },
  {
    "jobTitle": "US-based cleaning experts to share the products they love using the most",
    "jobDescriptionUrl": "https://app.connectively.us/#/queries/51839",
    "jobID": "",
    "queryDescription": "I'm looking for US-based cleaning experts to share the specific products they love using the most, explaining why they're great products, their specific benefits, and why people should have them in their cleaning cupboards. Ideally, these need to be on Amazon! Thanks in advance.",
    "topics": [
      "Lifestyle"
    ],
    "deadline": "Jun 26, 2024 - 2:30 PM",
    "mediaOutlet": "Real Homes"
  },
  {
    "jobTitle": "Exterior Window Experts",
    "jobDescriptionUrl": "https://app.connectively.us/#/queries/51838",
    "jobID": "",
    "queryDescription": "Looking for US-based experts in exterior windows to tell me some popular ideas for exterior window trims. \n\nPlease give a brief 1-2 sentence explanation about each idea and why they are a popular choice for homeowners. (Any images of projects you've worked on are welcome). \n\nThanks!\n(Unrelated experts will not be considered)",
    "topics": [
      "Consumer General Interest",
      "Lifestyle"
    ],
    "deadline": "Jun 27, 2024 - 1:30 PM",
    "mediaOutlet": "Fixr.com"
  },
  {
    "jobTitle": "Seeking Expert Advice for Crafting a Productive Home Workspace",
    "jobDescriptionUrl": "https://app.connectively.us/#/queries/51837",
    "jobID": "",
    "queryDescription": "Compiling a comprehensive guide on establishing a productive and efficient home workspace and seeking insights from experts in remote work environments, ergonomic design, technology integration, and wellness. Specifically, we're interested in:\n\n1. Comprehensive strategies for designing a workspace that meets\ndiverse work requirements while maintaining a clutter-free,\nefficient environment. This includes selecting an ideal\nlocation, ergonomic furniture, and technology integration to\nsupport productivity and health. \n\n2. Practical advice on managing both physical and digital workspaces to minimize distractions and optimize focus, alongside routines and wellness practices that enhance productivity and well-being in a remote work\nsetting.\n\nRequirements:\n\nLooking for input from productivity coaches, interior designers, ergonomics experts, technology integrators, wellness advisors, and remote work specialists. Please include your qualifications and any specific experiences that inform your advice.",
    "topics": [
      "Technology",
      "Business"
    ],
    "deadline": "Jun 26, 2024 - 10:30 PM",
    "mediaOutlet": "intercoolstudio"
  },
  {
    "jobTitle": "Seeking Luxury Hotels in NYC",
    "jobDescriptionUrl": "https://app.connectively.us/#/queries/51836",
    "jobID": "",
    "queryDescription": "Hello, \n\nI am writing a piece for The Independent 'travel section' focusing on the most LGBT+ friendly hotels in NYC. Please get in touch if you represent a luxury property in NYC you feel would match this criteria. A press review would be expected to be included. The current unique monthly visitors of The Independent sits at around 110 million per month.\n\nFeel free to follow me on IG @Sypped to see other pitch inspiration too across my TV/radio slots. \n\nMany thanks!\n\nAidy",
    "topics": [
      "Travel",
      "Consumer General Interest",
      "Lifestyle"
    ],
    "deadline": "Aug 11, 2024 - 10:30 PM",
    "mediaOutlet": "The Independent"
  },
  {
    "jobTitle": "How to plant grass seed",
    "jobDescriptionUrl": "https://app.connectively.us/#/queries/51835",
    "jobID": "",
    "queryDescription": "I am putting together an article with step-by-step advice on planting grass seed for a wonderfully lush lawn or repairing bare spots. I am looking for expert tips and advice on how to plant grass seeds successfully.\n\nWhat are the best months to start sowing grass seed?\nHow should homeowners choose the best seed for their location?\nWhat are the pros and cons of sowing seeds by hand?\nDo you need to press the grass seed down after sowing?\nHow often should you water newly sown grass seed?",
    "topics": [
      "Consumer General Interest",
      "Lifestyle"
    ],
    "deadline": "Jun 27, 2024 - 4:30 PM",
    "mediaOutlet": "Homes and Gardens"
  },
  {
    "jobTitle": "Garden experts for tips on homemade rose fertilizers",
    "jobDescriptionUrl": "https://app.connectively.us/#/queries/51834",
    "jobID": "",
    "queryDescription": "I am writing an article on making homemade rose fertilizer and am looking for tips and advice from experienced rose growers and gardeners on the types of DIY feeds you can use and how to make them. \nI have included some questions below:\nWhat is the best homemade fertilizer for roses?\nCan kitchen scraps be used as a rose fertilizer, and how?\nCan you make rose fertilizer from other plants or weeds?\nAre there any other DIY rose fertilizers you would recommend?",
    "topics": [
      "Consumer General Interest",
      "Lifestyle"
    ],
    "deadline": "Jun 26, 2024 - 9:30 PM",
    "mediaOutlet": "Homes and Gardens"
  },
  {
    "jobTitle": "Seeking a US-based PharmD to comment on an article on collagen supplementation",
    "jobDescriptionUrl": "https://app.connectively.us/#/queries/51833",
    "jobID": "",
    "queryDescription": "I am seeking a PharmD practicing in the United States to comment on an article that I'm writing on collagen supplements and when best to take them. Basically, I will share with you a few questions that you can respond to. \n\nHere are the few questions I have drafted out:\n\n1) What is the recommended daily dose of collagen? \n\n2) How long does it take for collagen to work, and does this vary based on what it’s used to treat?\n\n3) Are there are any medications, vitamins, supplements, or foods that could affect the efficacy of collagen, especially if taken together? Please mention them and how they can interact with collagen\n\nIf interested in being featured in this article, please send in a pitch under this query and include a link to your profile, bio page, or website for linking. Thank you!",
    "topics": [
      "Consumer General Interest",
      "Healthcare",
      "Lifestyle",
      "Sports"
    ],
    "deadline": "Jun 28, 2024 - 4:30 PM",
    "mediaOutlet": "SingleCare"
  },
  {
    "jobTitle": "Seeking a US-based medical doctor to comment on an article on collagen supplementation",
    "jobDescriptionUrl": "https://app.connectively.us/#/queries/51832",
    "jobID": "",
    "queryDescription": "I am seeking an MD practicing in the United States (preferably one with expertise in treating conditions that may necessitate recommending collagen supplements to patients) to comment on an article that I'm writing on collagen supplements and when best to take them. Basically, I will share with you a few questions that you can respond to. \n\nHere are the few questions I have drafted out:\n\n1) When is the best time of the day to take collagen supplement? And does the recommendation varies based on the intended benefit of your collagen use? (This is the most important for this topic, and I’d appreciate a response that would give a reader a clear understanding of when best they can take this supplement, i.e., if there’s a best time)\n\n2) Is there a particular way that’s best to take it for increased efficacy, or how can one get the best benefit from it? (E.g., take it with or without food, dissolving in water before taking or not, taking in pill form or powder form?)\n\n3) What are the effects a person may notice once they start taking collagen?\n\n4) Is it safe to take collagen daily? Is it safe for children? At what age should a person start taking it?\n\nIf interested in being featured in this article, please send in a pitch under this query and include a link to your profile, bio page, or website for linking. Thank you!",
    "topics": [
      "Consumer General Interest",
      "Healthcare",
      "Lifestyle",
      "Sports"
    ],
    "deadline": "Jun 28, 2024 - 4:30 PM",
    "mediaOutlet": "SingleCare"
  },
  {
    "jobTitle": "PRESS OPPORTUNITY: How to kill red ants",
    "jobDescriptionUrl": "https://app.connectively.us/#/queries/51831",
    "jobID": "",
    "queryDescription": "I'm seeking expert contributors to an upcoming article entitled 'How to kill red ants' — for leading online magazine RealHomes.com. \n\nTo take part, please email avt.features@gmail.com with:\n- a detailed, step by step guide for how to kill red ants.\n- at least two different products you'd recommend.\n\nIf you haven't been featured in Real Homes before, we will also require:\n- A detailed, third-person biography explaining the credentials of both you and your company\n- A quality, colour profile photo in jpeg format (>100kb)\n\nPlease note that the deadline for submissions is fast approaching.\n\nThose who are selected for inclusion will be notified.\n\nWith thanks\n\nAndy",
    "topics": [
      "Consumer General Interest",
      "Education",
      "Lifestyle",
      "Healthcare"
    ],
    "deadline": "Jun 26, 2024 - 10:30 PM",
    "mediaOutlet": "Real Homes - realhomes.com"
  },
  {
    "jobTitle": "Academic or an industry expert needed to comment on AI chatbots (AI friends) and their security",
    "jobDescriptionUrl": "https://app.connectively.us/#/queries/51830",
    "jobID": "",
    "queryDescription": "Hello,\n\nI am writing an article about AI chatbots and their implications for society.\n\nMy questions cover various topics, including tech, cybersecurity, psychology, and law. Therefore, if you don't know the answers to all of them, please answer the one(s) that is relevant to your field of expertise. That would be enough.\n\nI prioritize answers sent to me directly by the experts themselves. Please don't send answers generated with chatbots. Many thanks for considering my request!\n\n1. Companies like Luka (Replica), character.AI, and countless others offer virtual friends, romantic partners, and various AI-based characters. What are the psychological benefits of using so-called AI friends, and what risks do they pose to society?\n\n2. Users often share sensitive data with their AI-friends. What methods do these companies use to protect users' data? Can these companies be trusted?\n\n3. Facebook, Instagram, and Snapchat users can now talk with AI chatbots. Are these social networks going to expand offerings by bringing more virtual characters to their social networks? Will AI-based characters be common in social media in 5 years? Will they be the new norm?\n\n4. Companies like Eternos or HereAfterAI offer to recreate the dead in the digital world. What ethical and legal questions do they pose? How can they be addressed?",
    "topics": [
      "Technology"
    ],
    "deadline": "Jun 26, 2024 - 4:30 PM",
    "mediaOutlet": "Cybernews"
  },
  {
    "jobTitle": "What Do You Think About Starlink Mini?",
    "jobDescriptionUrl": "https://app.connectively.us/#/queries/51829",
    "jobID": "",
    "queryDescription": "I'm writing an FAQ piece about the new Starlink Mini.\n\nIf you're an internet expert, a digital nomad influencer, or a current or former Starlink user, I want you to tell me what you think about Starlink Mini.\n\nWould you use it? Do you like the concept? Or do you see issues with it? Do you think it's innovative?\n\nPlease write your response in a conversational style and use full sentences as much as possible. Thank you!",
    "topics": [
      "Travel",
      "Technology",
      "Consumer General Interest",
      "Lifestyle"
    ],
    "deadline": "Jun 26, 2024 - 3:30 AM",
    "mediaOutlet": "Reviews.org"
  },
  {
    "jobTitle": "Mortgage Insurance Details",
    "jobDescriptionUrl": "https://app.connectively.us/#/queries/51828",
    "jobID": "",
    "queryDescription": "What are some ways to reduce the burden of mortgage insurance? Is it advisable to cancel your mortgage insurance once you have the equity to do so?\n\nHow do the mortgage insurance requirements for FHA loans differ from the requirements for conventional loans?",
    "topics": [
      "Education",
      "Business"
    ],
    "deadline": "Jun 27, 2024 - 10:30 PM",
    "mediaOutlet": "Own Up Blog"
  },
  {
    "jobTitle": "How much are escrow fees?",
    "jobDescriptionUrl": "https://app.connectively.us/#/queries/51827",
    "jobID": "",
    "queryDescription": "I'm updating an article on escrow fees and looking to add some expert quotes. I'd like to know:\n\n— What specific costs are included under the umbrella of \"escrow fees\"? Can you provide a detailed list? Which costs are more and less common? Are HOA fees included?\n— How much do escrow fees typically cost? What factors determine the cost? Have fees increased in the last couple of years? How are escrow fees calculated?\n— Who pays for escrow fees? What factors determine who pays? \n— How are escrow fees paid? Who are these fees paid to? How does that process work?\n— Are escrow fees tax deductible?\n— Can people avoid paying escrow fees or pay less? What tips do you have for avoiding or saving money on escrow fees?\n— How can people vet an escrow company or escrow service to ensure it is reputable and trustworthy? Who can people trust to refer them to good escrow services?\n\nRequirements: Licensed escrow officer, lender, or real estate agent with expertise in escrow. We don't accept pitches that are off-topic, written by AI, or written by people without the proper credentials.\n\nPlease respond with your credentials and a link to your website or LinkedIn profile. Thank you!",
    "topics": [
      "Consumer General Interest",
      "Business"
    ],
    "deadline": "Jul 2, 2024 - 10:30 AM",
    "mediaOutlet": "Clever Real Estate"
  },
  {
    "jobTitle": "Did you buy a house with student loan debt? Id love to feature your story.",
    "jobDescriptionUrl": "https://app.connectively.us/#/queries/51826",
    "jobID": "",
    "queryDescription": "I'm writing an article for New American Funding about buying a home while managing student loan debt. If you have done this, I'd love to hear and feature your story! Your journey could inspire many. Please reach out! \n\nLet me know your name, age, what you do for a living and where you bought your house.\n\nHow did you do it? How much did you owe in student loans? What challenges did you have to overcome, what advice would you give to others?",
    "topics": [],
    "deadline": "Jun 29, 2024 - 7:30 AM",
    "mediaOutlet": "New American Funding"
  },
  {
    "jobTitle": "Best alternatives to plywood",
    "jobDescriptionUrl": "https://app.connectively.us/#/queries/51825",
    "jobID": "",
    "queryDescription": "Looking for expert opinions on the best alternatives to plywood for furniture making and interior/exterior building construction, particularly other wood alternatives, but open to other materials. Open to opinions from anyone who works with sheet goods regularly.",
    "topics": [
      "Lifestyle"
    ],
    "deadline": "Jul 2, 2024 - 9:30 PM",
    "mediaOutlet": "Anonymous"
  }
]