[
  {
    "jobTitle": "Strategist",
    "jobDescriptionUrl": "https://4dayweek.io/remote-job/strategist-brandish",
    "companyName": "Brandish",
    "jobID": "",
    "queryDescription": "Job Title: Strategist\n\nDepartment: Strategy\n\nReports To: Director, Strategy\n\nLocation: Canada – Preference given to candidates in Alberta, Manitoba, Ontario, and Quebec\n\nTarget Start Date: August or September, 2024\n\nPosting Date: June 13, 2024\n\nSubmission Deadline: July 1, 2024\n\nAbout Us\n\nBrandish is a creative agency helping brands in their pursuit of relevance by focusing on the people our clients are trying to connect with – their audience. We are a young agency looking to expand our internal team.\n\nAs a people-driven agency, we emphasize a culture that is flexible and adaptive to the ever-changing world of work. We are a remote-first agency with a co-working space for optional use in Winnipeg. Our people are enthusiastic problem solvers who share their diverse skill sets, perspectives and experiences throughout our agency across Canada.\n\nAbout the Strategy Team\n\nThe Strategy Team connects our clients to their customers, ultimately ensuring their brand experience is relevant, sustainable and differentiated.\n\nThey find the market, audience and industry insights required to develop brand strategies and positioning that matter to people. Then, they manage the brands through customer experience mapping, creative, marketing and product innovation in coordination with all other agency team members.\n\nAbout the Role\n\nOur Strategists bring our clients closer to the needs of their customers through brand strategy consulting, brand positioning, brand management and creative or product innovation. They are responsible for defining the right customer problem and outlining the \"way-in\" to best solve it. They lead insight gathering, representing the customer both internally and externally. They use briefs or team sessions to onboard and action all work to fulfill our clients' brand strategies.\n\nThe Strategist works with the Director, Strategy and Creative Director to build strong brand strategies and independently manages effective brand marketing initiatives.\n\nThe Strategist is responsible for:\n\nCollaborate with the client and Brandish teams to develop positioning and messaging strategies, as well as strategic media and communication plans\nLeading insight gathering projects for clients, including the management of focus groups, qual & quant surveys, focus groups, video streeters and interviews.\nFinding customer, business and category insights and translating them into strong briefs & briefings for the creative team.\nIdentifying, advocating for and managing marketing and communications initiatives that will elevate and reinforce our client brand strategies in-market\nCo-leading creative strategy alongside the creative director and art directors to support brand and strategy articulation\nDevelop brand and creative KPIs to accurately measure performance against client goals and objectives.\nCollaborate with Brandish teams to scope client work and plan appropriate budget allocations for brand objectives.\n\nAbout You\n\nMust-have qualifications:\n\n4-6 years in a professional brand marketing, advertising or creative communications setting.\nExperience in an agency environment is considered an asset.\nA strong portfolio of real-world strategies and deliverables that:\nClearly highlights your involvement in each project\nShowcases your ability to represent the customer\nDemonstrates your approach to briefing the Creative team\n2-3 professional references\nValid VISA, PR, or other documentation required to be legally eligible to work in Canada\n\nPersonal skills and abilities:\n\nThrives in a collaborative, remote-first working environment.\nHighly creative thinker who is interested in pushing boundaries and trying new things.\nStrong oral communicator. You enjoy workshopping ideas and presenting them to team members for feedback. Confident and able to facilitate large meetings with specific strategic or creative objectives.\nYou’re curious about people, trends and habits. You’re always interested in the why behind people’s decisions. And you’re culturally in-tune with industry and consumer trends.\nYou look to solve the cause, not the symptoms.\nComfortable working with clients independently, establishing goodwill and effectively leading the work\nExtremely motivated self-starter. Ability to self-manage and set direction for problem-solving within strategic working groups.\nStrong sense of empathy. You’re able to look at problems from multiple perspectives and find mutual benefit and understanding.\n\nTools and software:\n\nGoogle Drive (Google Docs, Sheets, Slides, etc.)\nGoogle Meet or Zoom\nSlack or MS Teams\nSurvey Monkey or Google Surveys\nClickUp or Asana (not required, but an asset)\n\nTotal Compensation & Benefits Package\n\nBrandish offers a comprehensive Comp & Benefits package for all full time team members. This includes:\n\nAnnual salary: $75,260 - $79,776\nFully paid benefits package with Manulife (family coverage)\nUnlimited paid time off (vacation, sick days)\nA 4-day work week (we are closed Fridays)\nFlex time\nQuarterly performance reviews with opportunity for growth\nYear-end bonus based on individual and company performance"
  },
  {
    "jobTitle": "Growth Marketing Manager",
    "jobDescriptionUrl": "https://4dayweek.io/remote-job/growth-marketing-manager-meilisearch",
    "companyName": "Meilisearch",
    "jobID": "",
    "queryDescription": "About this role\n\nAs Meilisearch solidifies its monetization and sales strategies following several years of significant product-led growth, we find ourselves at a pivotal juncture. Our next strategic move is to expand our marketing capabilities with a focus on growth marketing.\n\nThe Growth Marketing Manager will be instrumental in driving full-funnel growth, focusing on demand generation, inbound and organic growth, lifecycle marketing, and marketing operations. This role requires a strategic thinker with a hands-on approach, capable of shaping and amplifying our marketing efforts to accelerate our growth trajectory.\n\nWhat you’ll be doing\n\nAs a Growth Marketing Manager, you will:\n\nCreate and implement demand generation strategies to move leads from awareness to qualification,\nCollaborate with Developer Marketing and Product Marketing to shape content strategy and contribute to outbound efforts,\nManage and optimize performance marketing campaigns across both organic and paid channels,\nLeverage SEO and SEM tools to increase visibility and drive traffic,\nDesign and execute lead nurturing and engagement campaigns to enhance conversions and product engagement, with a focus on top-to-mid-funnel activities,\nAnalyze marketing metrics and data to inform strategy adjustments and improve outcomes,\nOversee marketing operations, including the use of marketing automation tools to streamline processes.\n\nOur ideal profile\n\nSoft skills\n\nWe value our team culture highly and seek someone with:\n\nExceptional communication skills and the ability to simplify complex topics.\nStrong organizational skills and the ability to work and communicate effectively in a remote setting.\nHigh energy, proactive approach, creativity, and adaptability.\n\nHard skills\n\nMust-have\n\n6+ years of experience in a B2B early-stage tech startup environment.\nProven success in demand generation and managing key marketing metrics.\nProficient in SEO, SEM tools, and content strategy creation.\nSolid background in performance and digital marketing, including paid acquisition channels.\nDemonstrated project management skills with experience balancing multiple stakeholders.\n\nNice-to-have\n\nExperience in an early-stage startup environment.\nMarketing experience across multiple companies or organizations.\nFamiliarity with marketing automation tools and enhancing marketing infrastructure.\nBasic understanding of coding and web development principles.\nProven track record of managing external partnerships effectively.\nInterview process\n45/60min screening interview: you will meet Morgane, our Head of People, to discuss your professional background, motivations for the role, availability, and salary expectations. You’ll also get more details about why we’re hiring for this role and the type of profile we seek.\n1h Hiring Manager interview: you will meet Maya, Senior Product Marketing Manager, and Thomas, co-founder and COO, who will go more into detail about your different experiences, professional evolution, and strategic thinking and operational skills.\n1h Technical Fit interview: you’ll be asked to present a portfolio of your most relevant work for this role, as well as an operational plan for your first 30-60-90 days if you were to join us in this position. Maya and Laurent, developer advocate, will listen to your presentation and ask follow-up questions.\n1h Team Fit interview: you’ll meet María, Senior Product Manager, and someone else from our teams to assess your fit with our teams. They will ask you questions about what you value in your work, your collaboration, and the company you work in.\nIn parallel with this last step, we will conduct a reference check. We will ask you to give us the contact of 2 people you’ve worked with in the past, preferably a former manager or other relevant stakeholder.\nWe’ll do a salary benchmark and make you an offer ✨\nThese are all opportunities for you to ask questions to get to know your potential future team better, and discover more about the scope; 10 min will be left at the end of each interview so you can ask questions."
  },
  {
    "jobTitle": "Key Account Manager",
    "jobDescriptionUrl": "https://4dayweek.io/remote-job/key-account-manager-8-panzerglass",
    "companyName": "PanzerGlass",
    "jobID": "",
    "queryDescription": "Would you like to join us on the journey towards a 4-day work week? Would you like to drive Sales in the Corporate and Refurbish channels, ensuring that the PanzerGlass ® Brand portfolio is recognized as the market leader in device protection? If so, you may be our new Key Account Manager in Benelux.\n\nPanzerGlass® stands as one of the leading global brands in screen protection. In this role, you will be overall responsible for developing and driving sales in the Corporate & Refurbish channel within the market. You will also contribute by positioning PanzerGlass as the leader in sustainable Device protection according to our ESG strategy.\n\nKey responsibilities\n\nAnticipate a role where you will be responsible for driving sales in the market for the Corporate & Refurbish accounts. Additionally, you will be responsible for:\n\nDelivering the set KPI’s for the year.\nDeveloping new partners and distributors.\nEngaging and meeting End User customers ensuring the right PanzerGlass selling story is told.\nUpdating and managing Sales pipeline.\nImplementation of business review with key partners.\nEnsuring PanzerGlass gets relevant products listed on public Tender.\nAttending tradeshow and Sales Conference.\n\nYour profile\n\nYou bring with you some years of experience of Key Account Management within Corporate channels, along with a well-established network in the corporate sector.\n\nWe anticipate that you have experience working with public Tender. Your adaptability in turbulent and evolving market environments is crucial. You possess a customer-centric approach and collaboration skills to ensure fruitful interactions. Like your colleagues working globally, we expect you to have a solid work ethic and adaptability.\n\nFurthermore, you have excellent sales and negotiation skills. You can use and understand CRM. Fluency in English is necessary for this role.\n\nWe offer\n\nA company with best-in-class employee survey results. We are listed among the best workplaces in Denmark and Europe.\nA culture of inclusivity and global collaboration, valuing and celebrating diverse perspectives.\nA unique opportunity to join a global, fast-growing organisation.\nGreat opportunity for professional and personal development.\nProfessional and highly skilled colleagues who set the bar high.\nFlexible working hours.\n\nQuestions and application\n\nIf you have any questions regarding the position or PanzerGlass, please contact our hiring manager Senior Sales Manager Sebastian Schmitz via e-mail: sbsm@panzerglass.com.\n\nDue to GDPR laws and regulations we are not able to accept any applications sent by email. Please submit your application on our Careers Page www.careers.panzerglass.com\n\nStart date: As soon as possible"
  },
  {
    "jobTitle": "Account Executive",
    "jobDescriptionUrl": "https://4dayweek.io/remote-job/account-executive-12-scoro",
    "companyName": "Scoro",
    "jobID": "",
    "queryDescription": "Scoro's is looking for an Account Executive to join our sales team in Tallinn or Riga.\n\nAs an Account Executive, you will identify, secure, and manage client relationships to drive revenue growth by acquiring new customers for small and medium businesses. You'll play a key role in expanding our EMEA market.\n\nWe seek a dynamic sales expert with a solid background in software sales and a deep understanding of the SaaS landscape, capable of clearly articulating Scoro's value to potential customers.\n\nIf you're a self-motivated individual passionate about sales and tech, we'd love to hear from you. Join us and be part of our growth journey!\n\nYour Responsibilities Include:\n\nEnd-to-End Sales Cycle Management:\n\n🚀 Overseeing the entire sales cycle which involves overseeing the entire sales process, from outbound activities to closing deals.\n\n🚀 Maintaining a consultative and customer-centric approach throughout the sales cycle, actively advocating and communicating the product value and benefits to new businesses.\n\nCross-Functional Collaboration: Partnering with the Marketing and Business Development Representative teams to reach out to new businesses; creating and executing new sales strategies in collaboration with other teams.\n\nPerformance Metrics Oversight: Overseeing and managing performance metrics, providing structured reports on sales progress, and ensuring up-to-date tracking for effective decision-making.\n\nProduct Knowledge: Being a product expert, enthusiastically advocating its features and benefits, serving as an ambassador, and sharing our product value.\n\nWe offer:\n\n50/50 OTE split with uncapped, accelerated commission;\n4-day work week without compressed hours;\nStock options package to all our employees;\n3 paid medical days per year;\nWellbeing perks, mental health services;\nIndividual budget for books or courses & access to the Udemy learning platform;\nA cozy (and animal-friendly) working space in Tallinn or Riga downtown;\nAtmosphere flooded with humor and, of course – great team events and trainings;\nBi-annual global events;\nAn international team and unique company culture built on trust, common sense, and laughter.\n\nYou might be our newest Scorer if you have:\n\n2+ years of sales experience in a B2B SaaS company;\nPrevious track record of selling to SMB/Mid-Market accounts;\nProven track record in building a repeatable outbound pipeline;\nAbility to communicate, present, and influence key stakeholders at all levels of an organization;\nPassion for sales and a proven track record in generating outbound pipeline and successfully meeting sales quotas;\nExcellent command of written and spoken English;\nExcellent communication, listening, and time management skills.\n\nYou get extra points for:\n\nKnowledge or experience in a professional services industries;\nBeing able to thrive in a fast-paced and dynamic environment.\nExperience with Cognizm, HubSpot, SalesNavigator.\n\nPlease do not see everything in this job ad as a \"must have\" but rather as a guiding list of what we're looking for. We know that no candidate will be the perfect match for all we've mentioned in this posting, so don't be afraid to apply if you feel you're close to the brief but not \"spot on\"\n\nAt Scoro, we're an equal opportunity employer and value diversity in our company. We do not discriminate based on race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status."
  },
  {
    "jobTitle": "Engineering Manager",
    "jobDescriptionUrl": "https://4dayweek.io/remote-job/engineering-manager-simprints",
    "companyName": "Simprints",
    "jobID": "",
    "queryDescription": "Simprints is a nonprofit tech company with a mission to radically increase transparency and effectiveness in global development. We build ethical, inclusive digital ID powered by biometrics to verify that health, aid, and services truly reach people. Simprints partners with organizations like Gavi to boost immunization rates in developing countries, Ministries of Health like Ghana on pandemic response, and NGOs like BRAC to deliver maternal healthcare. Studies have shown Simprints increases impact through real-time, precision data, for example increasing maternal health visits by 38% in Bangladesh or accurate HIV tracing by 62% in Malawi. Today we’ve worked in over 17 countries helping deliver health, aid, and finance to >2.5M people. Our goal is to transform the way the world fights poverty, ensuring that every vaccine, every dollar, and every public good reaches the people who need them most.\n\nAbout the Role\n\nWe are looking for an Engineering Manager to join our growing tech team. You will work in an agile, collaborative team with a commitment to clean code, robust design, and a strong continuous learning and improvement culture. If supporting and empowering a team to build technology for global health sounds exciting, we want to meet you!\n\nLocation\n\nThis is a remote job; we are currently only able to take forward applicants based in the UK, Bulgaria, Romania, Hungary, Poland, Croatia, Ukraine, Latvia, Spain, Netherlands and Germany. The candidate must have the right to work in one of these countries.\n\nWe are unable to support relocation or visa sponsorship.\n\nIf you are not based in one of these countries, please do not apply for this role.\n\nSalary\n\nUK Grade 7: £65,000 - £75,000 with a cost-of-living and employer cost adjustment for non-UK residents\n\nYour Impact\n\nAt Simprints, we want everyone to feel ownership of the tasks they are working on, starting from your first day. Within the first month, we’ll get you access to all of our systems, and you will be familiar with the team and our processes in no time. By your third month, you will be working with the team in designing, implementing and refining our ways of working. In six months, you will be line managing engineers and will be responsible for their personal growth and development.\n\nRole Responsibilities\n\nSupporting, coaching and leading in a fast-paced, cross-functional product & engineering team to deliver high-impact and high-quality work.\nBuilding a strong and enjoyable engineering culture.\nGuiding the personal and professional development of individual engineers.\nEvolving our ways of working, designing team processes and developing us into an outstanding engineering organisation.\nYou'll be deeply involved with expanding the team and helping us hire the right people from all backgrounds.\nA passionate problem solver who can help us find a way to achieve our mission.\nExperience and enthusiasm to lead, support and develop our team towards success in their projects and individual careers.\nA background in engineering that enables you to understand technical challenges and help the team push through them.\nYou care about helping others to achieve their goals, mentoring & coaching them.\nYou believe great communication is key and are able to articulate yourself through both excellent written documentation and conversation.\nYou thrive when given a high level of responsibility and autonomy and are comfortable with the pace and uncertainties of a startup environment.\n\n5 Reasons to Join Simprints\n\nLife is short. We believe work should be inspirational, meaningful and fun. At Simprints, we’re taking on global development’s biggest challenges, powered by an amazing culture and incredible people. Work with us, and you will grow faster, learn more, and take on great responsibilities with the potential to make lasting change.\n\nGenuine Impact. Work directly with our partners and users to deliver technology that has the potential to impact millions of lives across the globe. At Simprints, you’ll be part of a team that is passionate about driving real change.\nAn incredible, diverse team. Our work is at the intersection of technology and global development, and we’ve managed to build an amazing team drawn from all over the world. But don’t take our word for it—we’re an externally recognized Great Place to Work, part of the Flexa Top 100 Most Flexible Companies and a 2023 Best Workplace for Women.\nMutual Flex. We champion a work culture where autonomy and trust are paramount, steering clear of mere face-time metrics. Whether it's managing life's essentials like healthcare appointments or adapting work hours to match your peak productivity times, we've got you covered. In return, we count on your reciprocal flexibility when mission-critical moments arise, like stepping up for a crucial client discussion on a Friday or tackling unexpected technical glitches beyond regular hours.\nUltimate work-life balance. a. We offer a 4-day workweek, meaning everybody has the option to have Fridays off. b. We also offer unlimited paid annual leave which allows you to prioritize your well-being. As long as you're driving results and fostering teamwork, we encourage you to strike that perfect balance between your professional and personal life. Our commitment to this model's success is solidified through semi-annual productivity assessments with our board, ensuring that our high standards of performance are consistently met.\nProfessional development. We promote continual learning and put our money where our mouth is with development plans and access to global experts through the GLG network. We also have a generous professional development budget for each colleague – “Eduprints”. Is there some training you’d like or maybe you could benefit from professional coaching? Simply provide a business case that shares your aspirations and the resources you need, and we'll do our best to support you. We care about both your development in Simprints and your holistic long-term career goals. Simprints Alumni have gone on to work for Google, USAID, Gavi the vaccine alliance, Save the Children, and other top players."
  },
  {
    "jobTitle": "Software Engineer",
    "jobDescriptionUrl": "https://4dayweek.io/remote-job/software-engineer-4-safeguard-global",
    "companyName": "Safeguard Global",
    "jobID": "",
    "queryDescription": "Why join Safeguard Global? *\udc40\n\nWe want to help you “Work in Any Way” - that means, making time for family, commitments, and life outside, so that you can have the best of both worlds. When you own what you do and are driven to deliver, you have the flexibility to decide where and how you work.  *\ude80\n\nOur roles aren’t just remote and hybrid  first—they break free from the traditional ways of doing things, paving a way for A Job That Works for You. ✅\n\nHow you will make a difference:\n\nAs our Senior Software Engineer who is open-minded and pragmatic, you will collaborate closely with our design team to build features that our customers will love and play a critical role in shaping the future of our product.\n\nDevelop and maintain web applications using JavaScript and TypeScript.\nArchitect and implement scalable and secure solutions on AWS.\nCollaborate with design teams to create user-friendly features.\nOptimise application performance and troubleshoot issues.\nWrite clean, maintainable code and follow best practices.\nConduct code reviews and participate in design discussions.\nStay updated with the latest technologies and industry trends.\n\nWhat will make you stand out:\n\nSolid background experience developing and designing high-availability software applications.\nProficient in JavaScript and TypeScript.\nExperience writing Node.js and React.\nExtensive experience developing microservices.\nStrong understanding of RESTful API design.\nExperience with AWS (Lambda, Event Bridge, API Gateway, S3, DynamoDB).\nFamiliar with version control systems like Git/Bitbucket.\nSkilled in Test Automation, Continuous Integration, and Continuous Delivery.\nExperience with various database technologies, including relational and non-relational.\nEffective problem-solving, communication, and teamwork abilities.\nFamiliarity with agile methods and frameworks.\nUnderstanding of front-end frameworks (e.g., Angular, Vue.js)\nKnowledge of Auth0\nExperience with Google Analytics, postman and Python is advantageous\n\nWho we are and what we do:\n\nSafeguard Global is….Global! With offices worldwide, we help 1500+ companies hire, manage, and pay employees in 170+ countries. It's all about people! Join us to meet diverse folks, explore new cultures, and connect with amazing folks from around the globe. 🌎\n\nOur Global Benefits\n\n*\udc69 ‍💻 Autonomy & Flexibility (Work in Any Way): Be supported with as much flexibility as possible.\n*\uddd1 ‍🍼 Bonding Leave: Enjoy paid leave to bond with your new family member.\n*\udf81 2 Charitable Days: Contribute to causes you believe in.\n*\udfc6 Reward & Recognition Program: Be rewarded for your success and championing our values.\n💰 Corporate bonus/SIP: All Guardians are eligible for our annual bonus scheme or sales incentive plan.\n*\udfe2 Coworking Space: Need to meet with a client, utilize admin services or just get out of the house? We’ve got you covered with flexible workspace options based on location.\n\nWhy become a Guardian:\n\n*\udf0f International Environment: Grow your network internationally and collaborate across the world. Interact, discover cultures, and tap into local expertise.\n⭐ Our Culture: We emphasize the people factor in everything we do. Our nurturing culture ensures your ideas reach our leaders and your contributions get the recognition they deserve.\n*\udcda Learning: We support your continuous growth by providing access to 2 learning platforms, where you can learn at your own pace.\n\nNext Steps:\n\nTo apply, please click on the following link. We wish you the best with your application. Our Guardian promise to you is to keep in touch to arrange the next stage should your application meet the position's requirements, and or a gentle update if you have been unsuccessful at this time.\n\nWelcome to the Future of Work! *\udf10\n\nAt Safeguard Global, we are committed to providing an environment of mutual respect where equal employment opportunities are available to all applicants and Guardians."
  },
  {
    "jobTitle": "Senior Brand Manager",
    "jobDescriptionUrl": "https://4dayweek.io/remote-job/senior-brand-manager-welcome-to-the-jungle",
    "companyName": "Welcome to the Jungle",
    "jobID": "",
    "queryDescription": "The position\nJob description\n\nAs a talented and inspiring Senior Brand Manager, you will report directly to our Brand & Comms Team Lead and ensure that our brand remains recognizable, up to date and exciting to job hunters and companies.\n\nWorking in tight relation with the whole Marketing department (Creative Studio, Product Marketing and Growth Marketing), as well as with cross-functional teams (Product, Business, Media…), you will have the opportunity to define the strategy of our company’s key brands, develop creative campaigns that make us stand out and work with an extensive network of external partners.\n\nHere’s a snapshot of you and your team’s future responsibilities:\n\nBrand Strategy: Monitor market trends and competitors’ activities, analyze brand positioning and consumer insights, define the overarching strategy for your brand in order to position it uniquely our market, build a yearly activation plan and define KPIs within set budget\nCampaign Development: Build briefs to create flagship and always-on communications initiatives, lead production and media activations across all the relevant channels (PR, social, paid media, events, partnerships, etc.), ensure that our brand is presented consistently across all touchpoints\nDrive the agencies holistically on strategic, budget aspects as well as the operational execution\nStakeholder & Vendor Management: Drive alignment with internal teams (Marketing, Media, Business, Product, Tech…), identify a network of partners / agencies / freelancers / Medias / etc. that can support the execution of your strategy, drive and challenge them in full autonomy to reach your end goals\nReporting & Analysis: Research and track key metrics to assess our brand health, proactively identify opportunities, measure the effectiveness of your strategy and report on its successes\nSupport to internal teams: Supervision of messaging, visuals, storytelling, and all assets produced by and for other teams in order to ensure coherence with current brand guidelines and positioning\nPreferred experience\n\nAt Welcome to the Jungle, we are all coming from (really) different backgrounds, that’s our main strength!\n\nOur Senior Brand Manager would be someone with:\n\n5+ years of experience in a brand management role, operating in a fast-paced environment and interacting with multiple stakeholders\nSolid strategic thinking and project management skills\nTrack record in building creative campaigns that have a clearly monitored and demonstrated impact\nA strong interest in design and brand culture\nExcellent communication skills, both in French and English\n\nWelcome to the Jungle aspires to promote a positive social impact. Its mission includes paying particularly close attention to fostering diversity, inclusion and equality within teams as well as within its community.\n\nRecruitment process\nStep 1 : Visio interview with Laurène, Talent Acquisition Specialist (around 45 minutes)\nStep 2 : Visio interview with Alice, Vice President Brand & Creative (around 1 hour)\nStep 3 : Visio interview with Victor, Head of Design(around 45 minutes)\nStep 4 : Visio interview with Pauline, Senior Copywriter, and Laurène (around 1 hour)\nStep 5 : Visio interview with Göze, Head of Growth (around 45 minutes)"
  },
  {
    "jobTitle": "Email Marketing Manager",
    "jobDescriptionUrl": "https://4dayweek.io/remote-job/email-marketing-manager-buffer",
    "companyName": "Buffer",
    "jobID": "",
    "queryDescription": "We're looking for a Senior Email Marketing Manager to join our\n\nfully remote and mission-driven team.\n\nAbout Buffer\n\nWe make social media and brand building software for small businesses, creators, and individuals. Our mission is to provide essential tools to help small businesses get off the ground and grow. Through exceptional customer service and uplifting content, we help our customers believe they can succeed and do good along the way.\n\nWe’re a fully distributed team, and we’ve always aimed to do things a little differently at Buffer. Since the early days, we’ve had a focus on building one of the most unique and fulfilling workplaces by rethinking a lot of traditional practices. We also default to transparency, so you can read all about our metrics, and our successes and failures along the way on our Transparency Dashboard.\n\nWe hire and work from all over the world. Please note that we do travel to work together in-person once or twice per year, and those events are highly encouraged to build deeper connections among our small team.\n\nWe're united by Buffer's values, and we celebrate our unique differences. We strive to create a diverse and inclusive work environment and are building a culture where underrepresented groups are welcome, and can flourish.\n\nAs you get to know Buffer and consider joining the journey, feel free to read more from Kirsti, who recently documented her first 30 days at Buffer, as well as from Hailley, who captured why she still calls Buffer home after 8 years.\n\nAbout the role\n\nWe’re looking for a Senior Email Marketing Manager to join our Marketing team and shape the future of email marketing and automation at Buffer.\n\nBuffer is a leading SaaS marketing platform for small businesses, creators and ambitious individuals, offering a comprehensive web app, mobile apps for iOS and Android, and a robust set of integrations and APIs.\n\nWe are a product-led growth (PLG) company, where the product itself is the driving force behind acquisition, retention, and expansion. That means that we operate without a sales team, instead relying on our freemium model to attract and delight small business owners and individuals. With 150,000 monthly active users, the majority of whom are on our free plan, we are committed to providing exceptional user experience and support to users regardless of their pricing tier. It is important to note that Buffer is not an enterprise product and our focus is not on upmarket strategy; we prioritize serving our diverse user base with the best possible product experience.\n\nYou will be the sole Email Marketing Manager and primary driver of Buffer’s email marketing program. This role has a high-degree of ownership from championing our strategic approach to email marketing to creating campaigns that support team goals and owning the technical infrastructure that powers the delivery of more than 80 million emails a year.\n\nThe ideal candidate should be excited to apply both their strategic insight and technical proficiency to scale our existing programs to new heights. They bring a track record of building and managing high-volume, data-driven email marketing, and automation programs that drive acquisition, activation, and retention across the customer lifecycle.\n\nThis role would be a member of a small Marketing team at a company of builders. Part of every Marketing teammate’s work at Buffer includes using our products regularly to better contribute to upcoming feature releases and strategy discussions, engaging with our community members in a variety of ways to keep close to our target audience, and generally understanding the changing landscape of social media through engaging across a variety of social media platforms.\n\nWho you'll work with\n\nIn this role, you’ll report to Simon Heaton, our Director of Growth Marketing. Day-to-day you’ll work closely with the rest of our tight-knit Marketing team, which spans growth, product, and content marketing to deliver outstanding automation programs that help drive our strategy forward. We are a small team with a lot of ownership.\n\nYou’ll also work alongside our Product team to support our product-usage and transactional programs for email and mobile.\n\nResponsibilities\nCreate engaging email marketing programs that delight users and drive impact - Work closely with our product, product marketing, and content teams to build and execute targeted and personalized email campaigns and newsletters that delight users, encourage action, and drive impact for Buffer.\nCraft exceptional email copy that converts - Craft high-quality, conversion-driven email copy tailored to various target audiences, ensuring clear messaging and strong calls to action.\nCreate our email templating and snippet system - Get into the code and create outstanding email templates to support our campaigns with HTML and Liquid. Implement scalable, dynamic personalization methods, and email snippets.\nLead our email marketing optimization program - Hypothesize, design and implement email marketing experiments that aim to iteratively improve our deliverability, engagement, and conversion for various automation programs.\nChampion data hygiene within our automation platform - Work closely with our Data team to enhance our data hygiene, maintain efficient data workflows, and maintain legal compliance for our managed lists. Monitor and maintain a high standard of deliverability and sender reputation across our email and push programs.\nManage our marketing automation technology- Own all aspects of our marketing automation platform (customer.io) and steward improvements to ensure we continue to deliver best-in-class email marketing experiences.\nManage and improve channel performance on an ongoing basis - Identify areas of opportunity and work collaboratively with the broader team to share insights, and act on opportunities to improve campaign and channel results for Buffer.\nQualifications\nYou use and understand Buffer, and are interested in the social media landscape and organic marketing. You love seeing creators, individuals, and small businesses succeed on social media.\nYou are energized about creating engaging, innovative email marketing experiences that delight users and drive business impact.\nYou have a proven track record of managing and improving a global, high-volume email marketing and marketing automation program in a SaaS or product led-growth environment\nYou have a strong understanding of the SaaS user lifecycle, as well as techniques for engaging users via email across acquisition, activation, and retention.\nYou are comfortable at all levels of email marketing: defining strategy, building campaigns and email templates, and improving the technical infrastructure of the tool.\nYou have technical proficiency with marketing automation software (ideally customer.io), as well as strong development expertise in HTML, CSS, and templating languages like Liquid.\nYou are an advocate of email list management, data hygiene, and compliance with anti-spam legislation (GDPR / CASL).\nPerks and Benefits\n\n💰 Competitive salary: Our salary formula adjusts to your cost of living and experience. For this role, the range is $134,854 - $156,431 USD.\n\n🏝 Work remotely: Live and work wherever you are the happiest and most productive. See our Team Map!\n\n🗓 4-Day workweeks: Our schedule is four workdays, with a flexible, meeting-free fifth day for overflow tasks or personal time as you see fit.\n\n💪 Health insurance: We offer health insurance for all of our team members, international or US.\n\n💻 Home office setup: Get a laptop + $1000 to set up your home office!\n\n⛺️ Minimum vacation: We ask teammates to take at least 3 weeks per year.\n\n📚 Unlimited Free books: Get a free Kindle and all the free books you like - digital, physical, and audio - no questions asked.\n\n👓 'Growth mindset' fund: Extra money each year for learning and development.\n\n💵 Savings plan: With 3% company match.\n\n📈 Profit sharing: When the company does well, all team members share the profits.\n\n🍼 Family leave: 16 weeks of family leave for all new parents, fully paid.\n\n👪 Family support fund: A stipend for each kiddo.\n\n⛱ Sabbaticals: Take a 6-week break, fully paid, after every 5 years with Buffer.\n\nApply for the job\n\nDo you believe you're a fit for this role and want to join the Buffer team? We'd love to hear about you!\n\nHere's what the hiring process will look like:\n\nApply to join the team through the form below.  You'll hear from us a few weeks after submitting your application.\nInterview with Simon Heaton, Director of Growth Marketing\nA take-home exercise\nInterview with Hailley Griffis, Head of Content and Communications\nInterview with Brandon Green, Staff Product Manager, and Maria Thomas, CPO\nInterview with our Founder, Joel Gascoigne\n\nAt Buffer, we value diversity of experience, and we understand that comes in many forms. We’re dedicated to adding new perspectives to the team. So, if your experience is close to what we’re looking for, please consider applying."
  },
  {
    "jobTitle": "Head of Design",
    "jobDescriptionUrl": "https://4dayweek.io/remote-job/head-of-design-safeguard-global",
    "companyName": "Safeguard Global",
    "jobID": "",
    "queryDescription": "Ready to join the future of work?\n\nCome join a remote and hybrid first*, global company spanning across the Americas, Europe, and Asia for A Job That Works for You. You will become among 2000+ Guardians worldwide, embracing YOUR unique approach to work. 🌎\n\nOur vision of the future of work is “Work In Any Way” which offers flexibility for where you work, it empowers you to define your ideal work environment, unbound by the traditional notions of what work should look like. Most importantly, it puts people first! 🤩\n\nSafeguard Global is seeking a dynamic, creative, and resourceful Head of Design to spearhead the\n\ndesign of our software products and drive innovation across our platform and services. Our vision is to forever transform the way people work around the world by developing a workforce enablement platform that equips organizations, workers, and partners with the tools for the future of work.\n\nHow you will make a difference:\n\n• Lead design initiatives, utilizing expertise in design disciplines such as design thinking, service\n\ndesign, LeanUX, user experience design, and interface design.\n\n• Adopt a player-coach mindset, balancing deep immersion in design disciplines with strategic\n\nalignment around business, product, platform, and customer needs.\n\n• Conduct research and translate insights into tangible, holistic, and human-centered\n\nframeworks (e.g., customer journeys, ecosystem maps).\n\n• Facilitate co-design activities (e.g., workshops).\n\n• Anchor the design process in user needs as well as business value and feasibility.\n\n• Manage stakeholders and take them on the design journey.\n\n• Navigate complex systems of touchpoints and champion a problem-first approach.\n\n• Help identify pain points, opportunities, and future paths for our business and customers.\n\n• Promote design practices within the business and inspire team members on the power of\n\ndesign and the utilization of methods and tools.\n\n• Lead the Design Guild with dual reporting to the Chief Technology Officer and Chief Product\n\nOfficer, and develop the craft within Safeguard Global.\n\nWhat will make you stand out:\n\n• Strong background in platform-led growth companies with a demonstrated ability to guide\n\nthe application and value of design systems to designers, engineers, and product managers.\n\n• Proficient in advanced and emerging technologies, well-versed in design patterns and\n\ntrends.\n\n• Proven capacity as a pioneer, tackling significant challenges through experimentation,\n\npractical empathy, and data-driven analysis.\n\n• Expertise in strategic thinking, leadership, innovation, creativity, resourcefulness, platform\n\nexpertise, analytics, design patterns, experimentation, team building, and design systems.\n\nRequirements:\n\n• 10 years of relevant experience in design leadership.\n\n• Experience in leading design initiatives from end-to-end in a fast-paced environment with\n\nfrequent changes.\n\n• Strong history of adapting to change and thriving in highly ambiguous situations.\n\n• Ability to balance process, technology, and creativity to meet complex problems.\n\n• Excellent communicator at all levels, appreciating the needs of high-performing cross-\n\nfunctional agile teams.\n\nAdditional Details:\n\n• This is a Director-level role.\n\n• Open to candidates globally.\n\nJoin us at Safeguard Global to navigate and thrive in the ever-shifting global workforce, building for\n\nwhat’s coming and transforming the way people work around the world.\n\nWho we are and what we do:\n\nSafeguard Global is…Global! We help 1500+ companies hire, manage, and pay employees in 170+ countries. Join us to meet diverse talent, explore new cultures, and connect with amazing folks from around the globe. ✈️\n\nOur Global Benefits\n\n*\udc68 ‍💻 Autonomy & Flexibility (Work in Any Way): Remote first, with the flexibility to include school runs and gym breaks in your schedule all while maintaining a high standard of work.\n*\uddd1 ‍🍼 Bonding Leave: Enjoy paid leave to bond with your new family member.\n*\udf81 2 Charitable Days: Contribute to causes you believe in.\n*\udfc6 Reward & Recognition Program: Be rewarded for your success and championing our values.\n*\udcb0 Corporate bonus/SIP: All Guardians are eligible for our annual bonus scheme or sales incentive plan.\n\nWhy become a Guardian:\n\n✈ ️ International Environment: Grow your network internationally and collaborate across the world. Interact, discover cultures, and tap into local expertise.\n⭐ Our Culture: We emphasize the people factor in everything we do. Our nurturing culture ensures your ideas reach our leaders and your contributions get the recognition they deserve.\n*\udcda Learning: We support your continuous growth by providing access to 2 learning platforms, where you can learn at your own pace.\n\nNext Steps:\n\nTo apply, please click on the following link. We wish you the best with your application. Our Guardian promise to you is to keep in touch to arrange the next stage should your application meet the position's requirements, and or a gentle update if you have been unsuccessful at this time.\n\nWelcome to the Future of Work!\n\n#LI-EB1\n\n#LI-REMOTE\n\nAt Safeguard Global, we are committed to providing an environment of mutual respect where equal employment opportunities are available to all applicants and Guardians."
  },
  {
    "jobTitle": "New Business Manager",
    "jobDescriptionUrl": "https://4dayweek.io/remote-job/new-business-manager-systemseed",
    "companyName": "SystemSeed",
    "jobID": "",
    "queryDescription": "SystemSeed is on the hunt for a talented, mature, and thoughtful sales leader. This is an opportunity to join a growing agency and build a team. We offer the chance to work with social impact-oriented projects, provide an uncapped opportunity to earn, and welcome candidates who identify as BAME, LGBTQI+, or disabled. Technology and consultancy experience are essential.\n\nRole:\n\nYou will be helping to drive the growth of our international, impact-focused agency and assist us in serving our community of NGO, charity, education, and other third-sector clients.\n\nInitially, you will be working as our sole sales representative, expected to deliver outbound sales of $1m in your first year. Over time, you will begin mentoring other sales consultants to further grow our pool of clients and projects. You will also have the opportunity for promotion to account manager for all new and existing clients after 2-3 years.\n\nThis role requires hybrid sales and technology consultancy skills, and the ability to work with stakeholders at the highest levels.\n\nResponsibilities:\n\nYou will be responsible for outbound sales at a minimum of $1m in your first year. This will include:\n\nClient research and targeting using our in house tools, external databases, and new tools that you may recommend\nProspecting including making new connections in person, through Linkedin, by email, and any other relevant channels\nCreating positive relationships with decision-makers at potential client organizations\nActing as a consultant to potential clients to help them work out what they really need and understand what’s possible for their project\nProposal creation using our existing templates, adding extra content, and editing the current content\nContract negotiation and closing of sales with new clients\nClient handover to our delivery team at the start of new projects\nConverting individual project contracts into ongoing support agreements\nUpselling existing clients onto additional products and services\nPackage:\nOutcome-focused pay:\nBase of $50k pa\nUncapped commission\n6% commission on 1st year of any new client relationship\n3% commission on subsequent years of additional projects that you convert\nExpected earnings of $110k / $131k / $152k / $173k (yrs 1-4)\nRemote working from your choice of location\n4-day work weeks after probation\n25 days holiday\nUnlimited training budget\n6-monthly reviews\nMental-health support retained for all staff\nPerson specification:\nEssential:\n10+ years of experience in senior roles (e.g. Operations, sales, marketing, or strategy)\nOf these 10 years, around half should have been spent in an agile digital agency, selling agency services\nYour digital agency experience must have included creating the sales strategy for the organization\nYou must have helped create strategy for the clients of your previous digital agency\nYou must have closed multiple contracts of $500k - $3m value - ideally solo or as the lead negotiator\nNative/excellent written and spoken English\nDesirable:\nYou should have a personal interest in impact work, whether in the field of international development, health, climate change, or another field\nExperience of working with or in NGOs, national government organizations, large charities is highly desirable\nWe’d like you to come with a ‘little black book’ of relevant contacts and connections\nAccount Manager experience is a bonus\nAbout SystemSeed:\n\nWe are a fully distributed, digital agency of 15+ people, creating ambitious technology solutions for high-impact clients. SystemSeed has a social impact mission, and our clients include UNICEF, the World Health Organisation, international charities, universities, and health & wellbeing organizations. Our average project has a value of $250,000k with a range of $100,000 - $700,000 pa per client. We aim to become a long-term trusted technology partner to every client.\n\nOur commitment to client results is extremely high. We have been in operation for 12 years, and some of our clients have been with us for that whole time. This is partly because we only take our delivery team members from the top 2% of global talent and our people consistently perform at this level.\n\nWe are an integrated part of the international open-source community, and have a strong background in Drupal and React development. SystemSeed teams take an agile approach as standard, always iterating and improving on an ongoing basis.\n\nEvery year, we donate 10% of our profits to charities voted for by our team.\n\nTo learn more about us visit: https://systemseed.com/about\n\nHow to apply:\nEmail us with a cover note and CV to [email protected]\nInclude the following information with your application:\nNo. of years and types of experience\nWho the first client would be that you'd approach for SystemSeed and how\nLooking for something a little different? We'd like to talk\n\nIf this role doesn't seem like a perfect fit and you'd like to work with us in a slightly different capacity, we'd love to hear from you. Drop us a note with your CV to [email protected], and let us know what sort of role you're looking for."
  },
  {
    "jobTitle": "Full-stack developer",
    "jobDescriptionUrl": "https://4dayweek.io/remote-job/full-stack-developer-systemseed",
    "companyName": "SystemSeed",
    "jobID": "",
    "queryDescription": "The role\n\nWe're looking for a new full-stack developer to join our fully distributed team.\n\nThis is a senior role, so we are looking for applicants with excellent experience particularly in open-source technology, including Drupal and React.\n\nThe successful candidate will join our team in working on interesting and exciting projects for our social-impact clients, and an interest in these issues is a plus.\n\nYou will be expected to take part in planning activities as part of our agile team structure, and will have the opportunity to use additional skills that you bring to the team.\n\nThis is a client-facing role and any consultancy or similar experience will be a bonus.\n\nWe welcome applicants from ethnic minorities, those who are differently abled, and people who identify as LGBTQ+. We are an inclusive organisation and do not discriminate against religious or cultural backgrounds.\n\nThe person\nEssential\nGood written and spoken English\nUnderstanding of open-source technology\nExcellent technical skills in Drupal\nFrontend and backend experience\nGood understanding of agile approaches to development\nStrong sense of ownership of your contribution to a team\nDesirable\nAdditional language skills\nAn interest in social impact projects/tech for good\nGood profiles on Drupal.org and/or GitHub showing open-source commits\nAgile skills/experience\nConsultancy experience\nWhat we offer\nSystemSeeders package of benefits and perks\nCompetitive salary\n4 day working week (for real!)\n6 weeks of holiday wherever you are (inc. mandatory Christmas break and any public holidays you wish to take)\nBi-annual performance reviews which include pay reviews\nWork from your chosen location, either at home or a local co-working space\nWeekly team meeting with all staff, including CEO and CTO\nAnnual team trips, usually around an international conference in Europe\nAgile working all day, every day\nMental health support as desired through our retained therapist\nWork on social impact projects\nA vote on where we donate 10% of our profits each year\nFlexible working hours with performance judged on delivery, not time spent at your desk\nHow to apply\nEmail us with a cover note and CV to [email protected]\nInclude the following information with your application:\nNo. of years and level of experience\nYour Drupal.org and/or GitHub profile links\nLooking for something a little different? We'd like to talk\n\nIf this role doesn't seem like a perfect fit and you'd like to work with us in a slightly different capacity, we'd love to hear from you. Drop us a note with your CV to [email protected], and let us know what sort of role you're looking for."
  },
  {
    "jobTitle": "Product Manager",
    "jobDescriptionUrl": "https://4dayweek.io/remote-job/product-manager-2-autouncle",
    "companyName": "AutoUncle",
    "jobID": "",
    "queryDescription": "A few notes before we dive in!\n\n-For the right candidate we are open to remote arrangements as long as you currently reside within the GMT+0, GMT+1, GMT+2 or GMT+3 time zones.\n\n-Embrace the unique opportunity of a four-day work week, allowing you to innovate and excel in a more focused and balanced environment.\n\nAbout AutoUncle\n\nA company with two goals.\n\nOur business goal is to be the most trusted car valuation brand in Europe. Known primarily for our powerful search engine, we promote transparency in the used car market. Our technology extends beyond search capabilities, offering valuable price and market insights in various contexts. We're committed to ensuring our platform is accessible everywhere it's needed - from our consumer search engine to automotive professionals, external marketplaces, and dealer and OEM websites.\n\nOur personal goal is to be The Most Human Company. We believe in nurturing a workspace where diverse individuals can collaborate, learn and grow. Success at AutoUncle stems from a focus on people first, supported by a compelling product, strong community, and a foundation of trust and fairness. Recognizing that humans aren't machines, we prioritize results over hours spent, understanding that emotional intelligence and personal growth are vital for long-term success. We trust our team to manage their time effectively, contributing to our collective goals in a marathon of success.\n\nAbout the Product Manager Opportunity\n\nYour Role\n\nAs our Product Manager on the Consumer team, you'll steer the direction of AutoUncle's consumer-focused websites and app. Your role is pivotal in driving strategy and development, rooted in a profound understanding of consumer-led SEO strategies and a solid data foundation. Your goal? To elevate user experience and search engine visibility, ultimately enhancing our direct-to-consumer offerings and ensuring significant growth in our consumer base.\n\nIn collaboration with cross-functional teams, spanning product management, design, SEO and engineering—you will align with our leadership to execute company goals seamlessly. Inspired by the methodologies of Marty Cagan's Inspired and Empowered, as well as Basecamp's Shape Up, you'll work within agile, cross-functional product teams to shape and discover future features, delivering them directly to our users backed by solid data analysis.\n\nResponsibilities\n\nStrategic Development: Drive the strategy and development of our consumer platforms, focusing on delivering impactful, consumer-led solutions that grow our revenue from performance marketing-related products.\nCollaboration and Leadership: Work closely with cross-functional teams and demonstrate extensive business acumen to align and execute company goals. You'll report directly to the VP of Product & Engineering, Niklas Stephenson.\nUtilize deep consumer-led SEO insights and a robust data foundation to guide strategic decisions, ensuring the building of data-driven, valuable, viable, usable and feasible products.\nCustomer Engagement: Develop deep relationships with customers to understand their needs and feedback, ensuring our solutions are consumer-led and backed by a strong data analysis.\n\nWhat to Expect in Your First Quarter\n\nIntegration: Get to know the team, workflow and the broader business context. Understand the core data and business model of our consumer site to identify user needs and areas for improvement.\nImpact: Collaborate on research, write compelling pitches and deliver your first features. Demonstrating your ability to drive consumer-focused initiatives grounded in solid data analysis and business strategy.\nAbout You\nYou bring 5+ years of experience in product management. Previous experience in design, engineering, data analysis, science or user research is a plus.\nYou have a proven track record of success in roles requiring extensive business acumen, deep knowledge of consumer-led SEO and a strong data background.\nYou're skilled in modern product discovery and delivery, capable of working effectively across the entire organization for strategic alignment and execution.\nYou thrive in a fast-paced, start-up environment and are ready to lead and innovate in a dynamic and competitive landscape.\nA little more about AutoUncle and how we operate!\nEmployee Handbook\nOur goal to be The Most Human Company\nWhat it's like to work at AutoUncle\nMeet the Teams"
  },
  {
    "jobTitle": "Quality Engineer",
    "jobDescriptionUrl": "https://4dayweek.io/remote-job/quality-engineer-safeguard-global",
    "companyName": "Safeguard Global",
    "jobID": "",
    "queryDescription": "How about a Job That Works For You? 🤔\n\nEver dreamt of a role where you call the shots on where you work? Welcome to Safeguard Global! We're all about making work fit your life, not the other way around. 🦸\n\nOur Work in Any Way approach means you can call your couch your office or a café halfway across the world your boardroom, while still having the flexibility to make school runs and essential errands which may end up in a detour to a scenic park to continue your work day and meet deadlines. 🛣️\n\nHow you will make a difference:\n\nYou will ensure the quality of software development and deployment, with a strong focus on implementing test automation. You will work closely with cross-functional, agile project teams to embed quality throughout the development lifecycle. Additionally, you will have the opportunity to work with AI and Large Language Models (LLMs), which are being utilised for our chatbot.\n\nUnderstand business requirements for effective testing\nDevelop test cases, uncover edge cases, and perform manual tests as needed\nDefine and drive innovative automated testing strategies and toolsets\nDesign, develop, and support frameworks for test infrastructure\nResearch, recommend, and implement automation tools\nCoach team members on automation practices\nDocument processes meticulously\nUse KPIs to validate and report on software quality\nTest for functional edge cases and ensure software is fit for purpose\n\nWhat will make you stand out:\n\nExtensive experience in QA automation\nThorough understanding of automated QA processes in agile environments\nStrong communication skills and willingness to collaborate\nExperience with automated test suites (Webdriver, Cypress, Browserstack, Saucelabs, Grid, TestRail)\nProficient in JavaScript and REST API testing\nFamiliarity with version control tools (e.g., git)\nProficient with bug tracking and test management tools\nExperience with relational databases (SQL Server, DB2, PostgreSQL)\nKnowledge of Unix/Linux OS, shell scripting, or Expect scripting\nExperience with containerization technologies (e.g., Docker) and CI/CD processes\nTesting enterprise applications deployed to AWS\nUnderstanding of NoSQL databases (e.g., MongoDB, DynamoDB)\nExperience with AI/LLMs is a major plus\nCertifications: CTFL, ISTQB, CSQA, or CSTE preferred\n\nAbout Us:\n\nWe’re not bound by traditional ways of doing things. Yep, we handle global solutions for over 1500 clients, but what really sets us apart is our vibe. We’re a community of 2000+ Guardians, spread-out all-over 50+ countries, united by our dedication to a remote first and flexible workforce.  🌎\n\nWhy become a Guardian:\n\n*\udf0f International Environment: Grow your network internationally and collaborate across the world. Interact, discover cultures, and tap into local expertise.\n⭐****Our Culture: We emphasize the people factor in everything we do. Our nurturing culture ensures your ideas reach our leaders and your contributions get the recognition they deserve.\n*\udcda Learning: We support your continuous growth by providing access to 2 learning platforms, where you can learn at your own pace.\n*\udfe1 Remote-First Vibes: Work from your couch, a cafe, or your favorite hideaway. We're all about making anywhere your office.\n*\udd39 ‍♀️ Balancing Act Champions: Family time? Hobbies? We get it. Your life matters, and so does your job.\n\nWhat's Cookin' at Safeguard Global****\ud83d* ‍🍳:\n\n*\udc69 ‍💻 Autonomy & Flexibility (Work in Any Way)\n*\uddd1 ‍🍼 Bonding Leave: Enjoy paid leave to bond with your new family member.\n*\udf81 2 Charitable Days: Contribute to causes you believe in.\n*\udfc6 Reward & Recognition Program: Be rewarded for your success and championing our values.\n💰 Corporate bonus/SIP: All Guardians are eligible for our annual bonus scheme or sales incentive plan.\n*\udfe2 Coworking Space: Need to meet with a client, utilize admin services or just get out of the house? We’ve got you covered with flexible workspace options based on location.\n\nNext Steps:\n\nReady to join a workforce that shapes itself around your life, embraces remote work like a pro? Apply, by clicking on the following link. We wish you the best with your application. Our Guardian promise to you is to keep in touch to arrange the next stage should your application meet the position's requirements, and or a gentle update if you have been unsuccessful at this time.\n\n**Welcome to the Future of Work!***\udf10\n\nAt Safeguard Global, we are committed to providing an environment of mutual respect where equal employment opportunities are available to all applicants and Guardians."
  },
  {
    "jobTitle": "Software Engineer",
    "jobDescriptionUrl": "https://4dayweek.io/remote-job/software-engineer-3-safeguard-global",
    "companyName": "Safeguard Global",
    "jobID": "",
    "queryDescription": "How about a Job That Works For You? 🤔\n\nEver dreamt of a role where you call the shots on where you work? Welcome to Safeguard Global! We're all about making work fit your life, not the other way around. 🦸\n\nOur Work in Any Way approach means you can call your couch your office or a café halfway across the world your boardroom, while still having the flexibility to make school runs and essential errands which may end up in a detour to a scenic park to continue your work day and meet deadlines. 🛣️\n\nHow you will make a difference:\n\nYou will play a key role, as part of an agile team building innovative products that make life better for people. You will work across the modern stack, leveraging the best technology to fit the problem. You will join a growing community of skilled engineers that share a common interest in pragmatic, performant, agile software engineering.\n\nDevelop and deploy full stack applications and solutions\nWork with product and technical peers to understand requirements and deliver outcomes\nParticipate in design and code reviews with peers to elevate the quality of engineering\n\nWhat will make you stand out:\n\nStrong working experience with JavaScript libraries for both Frontend and Backend development (ReactJS, NodeJS)\nExperience with Cloud technology and services, particularly AWS\nExperience utilising LLMs and AI technologies such as Langchain, Langgraph, Open AI\nExperience with other programming languages, preferably Python and Typescript\nExperience with SQL and/or NoSQL databases\nHands-on experience with Container (e.g. Docker) technologies\nStrong working knowledge of Git (e.g. Bitbucket) and CI/CD processes\nStrong quality and test-driven development ethics\nExperience working in a high-performing agile team and ability to quickly learn new technologies\nExcellent communication skills (both written and verbal)\n\nAbout Us:\n\nWe’re not bound by traditional ways of doing things. Yep, we handle global solutions for over 1500 clients, but what really sets us apart is our vibe. We’re a community of 2000+ Guardians, spread-out all-over 50+ countries, united by our dedication to a remote first and flexible workforce.  🌎\n\nWhy become a Guardian:\n\n*\udf0f International Environment: Grow your network internationally and collaborate across the world. Interact, discover cultures, and tap into local expertise.\n⭐ Our Culture: We emphasize the people factor in everything we do. Our nurturing culture ensures your ideas reach our leaders and your contributions get the recognition they deserve.\n*\udcda Learning: We support your continuous growth by providing access to 2 learning platforms, where you can learn at your own pace.\n*\udfe1 Remote-First Vibes: Work from your couch, a cafe, or your favorite hideaway. We're all about making anywhere your office.\n*\udd39 ‍♀️ Balancing Act Champions: Family time? Hobbies? We get it. Your life matters, and so does your job.\n\nWhat's Cookin' at Safeguard Global *\udc69 ‍🍳:\n\n*\udc69 ‍💻 Autonomy & Flexibility (Work in Any Way)\n*\uddd1 ‍🍼 Bonding Leave: Enjoy paid leave to bond with your new family member.\n*\udf81 2 Charitable Days: Contribute to causes you believe in.\n*\udfc6 Reward & Recognition Program: Be rewarded for your success and championing our values.\n💰 Corporate bonus/SIP: All Guardians are eligible for our annual bonus scheme or sales incentive plan.\n*\udfe2 Coworking Space: Need to meet with a client, utilize admin services or just get out of the house? We’ve got you covered with flexible workspace options based on location.\n\nNext Steps:\n\nReady to join a workforce that shapes itself around your life, embraces remote work like a pro? Apply, by clicking on the following link. We wish you the best with your application. Our Guardian promise to you is to keep in touch to arrange the next stage should your application meet the position's requirements, and or a gentle update if you have been unsuccessful at this time.\n\nWelcome to the Future of Work! *\udf10\n\nAt Safeguard Global, we are committed to providing an environment of mutual respect where equal employment opportunities are available to all applicants and Guardians."
  },
  {
    "jobTitle": "Key Account Manager",
    "jobDescriptionUrl": "https://4dayweek.io/remote-job/key-account-manager-9-panzerglass",
    "companyName": "PanzerGlass",
    "jobID": "",
    "queryDescription": "Would you like to join us on the journey towards a 4-day work week? Would you like to drive Sales in the Corporate and Refurbish channels, ensuring that the PanzerGlass ® Brand portfolio is recognized as the market leader in device protection? If so, you may be our new Key Account Manager in Switzerland.\n\nPanzerGlass® stands as one of the leading global brands in screen protection. In this role, you will be overall responsible for developing and driving sales in the Corporate & Refurbish channel within the Swiss market. You will also contribute by positioning PanzerGlass as the leader in sustainable Device protection according to our ESG strategy.\n\nKey responsibilities\n\nAnticipate a role where you will be responsible for driving sales in the market for the Corporate & Refurbish accounts. Additionally, you will be responsible for:\n\nDelivering the set KPI’s for the year.\nDeveloping new partners and distributors.\nEngaging and meeting End User customers ensuring the right PanzerGlass selling story is told.\nUpdating and managing Sales pipeline.\nImplementation of business review with key partners.\nEnsuring PanzerGlass gets relevant products listed on public Tender.\nAttending tradeshow and Sales Conference.\n\nYour profile\n\nYou bring with you some years of experience of Key Account Management within Corporate channels, along with a well-established network in the corporate sector.\n\nWe anticipate that you have experience working with public Tender. Your adaptability in turbulent and evolving market environments is crucial. You possess a customer-centric approach and collaboration skills to ensure fruitful interactions. Like your colleagues working globally, we expect you to have a solid work ethic and adaptability.\n\nFurthermore, you have excellent sales and negotiation skills. You can use and understand CRM. Fluency in English is necessary for this role.\n\nWe offer\n\nA company with best-in-class employee survey results. We are listed among the best workplaces in Denmark and Europe.\nA culture of inclusivity and global collaboration, valuing and celebrating diverse perspectives.\nA unique opportunity to join a global, fast-growing organisation.\nGreat opportunity for professional and personal development.\nProfessional and highly skilled colleagues who set the bar high.\nFlexible working hours.\n\nQuestions and application\n\nIf you have any questions regarding the position or PanzerGlass, please contact our hiring manager Senior Sales Manager Sebastian Schmitz via e-mail: sbsm@panzerglass.com.\n\nDue to GDPR laws and regulations we are not able to accept any applications sent by email. Please submit your application on our Careers Page www.careers.panzerglass.com\n\nStart date: As soon as possible"
  }
]