[
  {
    "jobTitle": "AI-First CEO",
    "jobDescriptionUrl": "https://www.crossover.com/jobs/4649/trilogy/ai-first-ceo",
    "companyName": "Trilogy",
    "salary": "$400,000 USD/year  ($200 USD/hour)",
    "jobID": "d9a9e45c-2326-4483-8404-6205060b2274",
    "jobDescription": "DescriptionIf you think most CEOs are full of themselves (and full of other stuff)... keep reading.\nHere’s a CEO track that requires — and actually rewards — zero experience being a CEO. In this role, you’ll become an incredibly effective, customer-facing CEO in an environment with more than 100 software products. \nWho You Are\nYou’ve never been a CEO before. Probably because most of the time, “CEO” is just a 3-letter code for “an exhausting hamster wheel of team building and internal operations logistics.” And hopping on that hamster wheel would be a huge waste of your talent and potential.\nYou’re smart. You keep things clear and direct. And while you’ve worked in SaaS for many years, you don’t have a decade of outdated “leadership” learnings to unlearn. You’re ready to be the leader that smart employees like you have been waiting for. This job right here is your launchpad.\nYou're a generative AI power user. You've used ChatGPT, Claude, Bard, or a similar tool to automate previously manual workflows (note: this role does not require a software development background).\nYou should already be well on your way to building a strong personal brand. We believe in the importance of a personal brand, and we’ll help you develop yours. You should understand the benefits and impact of a personal brand, the long-tail nature of content, and the effort it takes.\nYou have experience with quickly moving products, particularly in leadership roles during the launch of epic new features. If you’ve been part of teams going from Seed through Series A/B rounds, that’s a huge plus. You’ve got proven ability to get customers excited about new product features and have used metrics like net dollar retention and win-back rates (and others) to measure the impact of new product features.What you will be doing\n  Implementing AI-driven Productivity Improvements: Utilizing generative AI tools to streamline and automate various workflows across the company.\n  Customer Engagement and Feedback: Interacting with customers to gather insights and feedback, and using this information to enhance product offerings.\n  Develop a Personal Monopoly: Publishing podcast episodes and blog posts and building a social media following to evangelize your portfolio's AI-driven products.\nWhat you will NOT be doing\n  Busywork that drains your creativity.\n  Day-in, day-out team management or internal operations that distract from your vision. \n  Tinker with the business model to figure out what works. (Remember, we’re giving you the playbook.)\nCandidate requirements\n  At least 8 years of work experience in the enterprise software industry\n  Leadership experience in marketing, sales, business development, partnerships, professional services, or another hands-on customer-facing domain\n  Experience using generative AI tools to achieve quantifiable productivity improvements\n  Currently based in North America, South America, or Europe\nYou will be working for Hundreds of software businesses run on the Trilogy Business Platform. For three decades  About Trilogy Share this jobShareQuick linksFrequently asked questions"
  },
  {
    "jobTitle": "AI-Augmented Full-Stack Principal Engineer",
    "jobDescriptionUrl": "https://www.crossover.com/jobs/4774/gt.school/ai-augmented-full-stack-principal-engineer",
    "companyName": "gt.school",
    "salary": "$100,000 USD/year  ($50 USD/hour)",
    "jobID": "f8d7d489-ca6d-48f9-a1f3-93452ba33215",
    "jobDescription": "DescriptionAre you a full-stack engineer who thrives on complex challenges and is eager to make a real impact? Join our team to contribute to innovative products that deeply leverage AI and that are reshaping industries and changing the way we work and learn.\nJoin us to work on our exciting product portfolio:\n\n  TeachTap: Bringing historical figures to life using AI, offering an engaging, TikTok-like learning experience to make learning more relevant and fun.\n  Educational Content Generation: Utilizing the latest in generative AI combined with comprehensive learning materials to create captivating content.\n  TeachTower: A game-based motivation system inspired by popular games like Roblox and Minecraft, designed to make learning irresistibly fun.\n  Coachbot: A learning copilot that integrates with existing apps, guiding learning paths, recommending next steps, and rewarding daily progress.\n\n\nWhat we offer:\n\n  The opportunity to work with cutting-edge technologies, including the latest in Angular, React, React Native, and AWS serverless patterns.\n  The opportunity to learn and experiment with using generative AI to boost your productivity.\n  A team of exceptionally talented engineers from around the world as your peers.\n  The chance to work on products that are making a real difference in people's lives.\n\nWe're not just using AI as a buzzword. We're at the start of a thrilling journey with generative AI, experimenting and learning to fully leverage its potential and free our engineers from mundane tasks, allowing them to focus on what truly matters: design, decision-making, and understanding the far-reaching implications of different implementation strategies.\nShowcase your skills, not just your resume. Take on our challenges: 15-min Cognitive, 90-min Coding, 180-min Technical Decision-Making. Excel and you'll face a decisive interview with our Hiring Manager. More than half walk away with an offer. Ready to unleash your potential? Apply today!What you will be doing\n  Building modern web apps using top-notch libraries and tools.\n  Enhancing cloud-native backends using the latest serverless cloud patterns, including AWS.\n  Reviewing code to ensure adherence to best practices, team standards, and customer requirements.\nWhat you will NOT be doing\n  Spending time on minor bug fixes or features in outdated codebases.\n  Dealing with tedious infrastructure to keep poorly written products running.\n  Getting stuck in endless meetings discussing roadmaps and priorities or chasing people around.\nCandidate requirements\n  At least 4 years of experience writing production code for both the frontend and backend of web applications (any framework).\n  At least 2 years of experience being the primary technical contributor for a development team OR software product.\n  An openness to learn to use generative AI in your day-to-day development work.\nNice to have\n  Experience in using generative A.I. in your day-to-day development work.\nMeet the hiring manager Watch Video You will be working for GT School is an EdTech Startup that leverages technology, AI, and subject matter expert  About gt.school Share this jobShareQuick linksFrequently asked questions"
  },
  {
    "jobTitle": "Senior AI Innovation Specialist - Software Engineering",
    "jobDescriptionUrl": "https://www.crossover.com/jobs/5269/ignitetech/senior-ai-innovation-specialist---software-engineering",
    "companyName": "IgniteTech",
    "salary": "$100,000 USD/year  ($50 USD/hour)",
    "jobID": "01d48660-74d5-4456-81fa-27115d24352f",
    "jobDescription": "DescriptionThe software development industry is rapidly evolving, driven by the imperative to enhance development speed, reduce human error, and elevate code quality. These enhancements are crucial as they correlate directly with faster product time-to-market and heightened customer satisfaction. The average time for software deployment has historically lagged due to traditional coding practices, with an estimated 30% of projects exceeding their timeline due to inefficiencies and errors.\nIgniteTech is leading the transformation, integrating advanced GenAI technologies to redefine software architecture and development. Unlike traditional roles that focus on incremental improvements, this position offers the thrilling opportunity to lead pivotal AI-driven initiatives. You will be at the forefront of integrating AI to not just enhance, but revolutionize software development processes and outcomes, significantly boosting efficiency and competitiveness on a strategic level.\nThis role is designed for those who are driven to be at the cutting edge of technology and innovation. It is not merely an operational or task-oriented position; it is a strategic role that involves extensive research and development, prototyping, and the application of AI in crafting next-generation software solutions. Ideal candidates are those who are not only proficient in AI and software architecture but are also visionary in their approach to leveraging technology for business innovation.\nIn this role, you will lead our team in shaping the architectural frameworks and strategies that integrate AI into our software solutions. This role is integral to our mission, and your work will directly influence the productivity and quality of our deliverables. We invite you to join us if you are passionate about pushing the boundaries of technology and eager to make a tangible impact in the software industry.What you will be doing\n  Design the overarching architecture for AI-driven systems that automate complex aspects of software development, such as architecture generation, dependency management, and advanced predictive coding.\n  Deep dive into the latest developments in AI and software engineering by participating in R&D initiatives, attending conferences, and engaging with academic and professional communities. When a new AI technology comes out, we need to be among the first to know about it.\nWhat you will NOT be doing\n  Routine Code Maintenance: Regular updating or debugging of existing software code to fix minor issues or improve functionality.\n  Standard Software Development: Basic coding or software development tasks that involve implementing straightforward features or functionalities without AI integration.\nKey responsibilities\n  Use your engineering expertise to bring about a significant increase in development speed, reduction in human error, and improvement in code quality, ultimately leading to faster time-to-market for software products and enhanced customer satisfaction.\nCandidate requirements\n  At least 3 years of professional experience implementing impactful initiatives as a software engineer\n  Familiarity with GenAI code assistants (e.g., Github Copilot, Cursor.sh, v0.dev)\n  Previous experience successfully implementing Generative AI products/projects/solutions/tools\n  Previous experience leveraging different LLMs (e.g., GPT, Claude, Mistral) to solve business problems\nMeet the hiring manager Watch Video You will be working for If you want to work hard at a company where you can grow and be a part of a dynamic tea  About IgniteTech Share this jobShareQuick linksFrequently asked questions"
  },
  {
    "jobTitle": "JavaScript Instructor",
    "jobDescriptionUrl": "https://www.crossover.com/jobs/4747/bloomtech/javascript-instructor",
    "companyName": "BloomTech, Part-time",
    "salary": "$30,000 USD/year  ($30 USD/hour)",
    "jobID": "b08f8cd4-d409-4588-b053-130e0cc13a13",
    "jobDescription": "DescriptionAre you an experienced JavaScript developer with a knack for teaching and a passion for computer science? BloomTech is on the hunt for part-time instructors to lead our dynamic, immersive, live, online classes. This role offers you the chance to shape the future of software development while working remotely and flexibly from anywhere in the world.\nAt BloomTech, we’re not just another educational institution—we’re a launching pad for careers. Our commitment to student success is unparalleled, with students paying tuition only after securing a job. Our curriculum covers core computer science principles like algorithmic problem-solving, Big-O notation, and time-space complexity, ensuring students are ready for the real world.\nWe believe in the power of diversity and are dedicated to building a team where every voice is heard. We encourage applicants from all backgrounds to bring their unique perspectives to our vibrant community.\nDue to employment regulations, BloomTech can only accept applicants from certain countries with specific educational or professional qualifications. This ensures compliance with local laws and allows us to maintain our high standards of educational quality and student support. Please review the Candidate Requirements section carefully to ensure you meet the criteria.\nEager to share your JavaScript expertise and shape the next generation of developers? Join BloomTech’s innovative team and make a lasting impact. Apply today and help us revolutionize tech education!What you will be doing\n  Delivering live, interactive classes on Zoom, breaking down complex JavaScript and computer science concepts using real-world examples and engaging storytelling.\n  Mentoring students, offering support and encouragement to help them excel and overcome challenges.\n  Providing detailed feedback on the curriculum and tracking student progress.\n  Dedicating 10 hours per week to live teaching and student coaching.\nWhat you will NOT be doing\n  Supervising other instructors or teaching assistants.\n  Focusing solely on tutoring; instead, you will deliver comprehensive, career-focused training.\n  Attending in-person meetings or conferences, as the role is entirely remote.\nKey responsibilitiesEquip students with the skills and knowledge to ace the General Coding Assessment and embark on successful software development careers.Candidate requirements\n  One of the following combinations of education and industry experience:\n    \n      A Bachelor's degree + 3 years of software industry experience\n      A coding boot camp certificate that required at least 900 hours + 4 years of software industry experience\n      A high school diploma/GED + 5 years of software industry experience\n    \n  \n  3+ years of experience with JavaScript\n  Excellent public speaking and presentation skills\n  Ability to clearly explain technical concepts to beginners\n  Available to teach live coding classes from 2pm - 4pm PST (21:00 - 23:00 UTC)\n  Reside in one of the following countries: Bulgaria, Colombia, Costa Rica, Czech Republic, Ecuador, Egypt, Guatemala, Honduras, Hungary, India, Republic of Ireland, Mexico, Nicaragua, Pakistan, Panama, Paraguay, Peru, Poland, Romania, Serbia, Slovakia, Slovenia, South Africa, Turkey, United Arab Emirates, Uruguay, or Venezuela.\nNice to have\n  Prior experience in teaching or mentorship roles.\nYou will be working for Bloom Institute of Technology (BloomTech) is pioneering a new model of accessible highe  About Company Share this jobShareQuick linksFrequently asked questions"
  },
  {
    "jobTitle": "AI Innovation Specialist - Software Engineering",
    "jobDescriptionUrl": "https://www.crossover.com/jobs/5270/ignitetech/ai-innovation-specialist---software-engineering",
    "companyName": "IgniteTech",
    "salary": "$60,000 USD/year  ($30 USD/hour)",
    "jobID": "c2b89622-f9db-42ba-892f-fd3ee5e8fefb",
    "jobDescription": "DescriptionThe software industry is notorious for delayed timelines and cost overruns, with nearly a third of projects failing to meet their original schedules due to outdated practices. In this environment, traditional coding techniques are no longer sufficient to meet the growing demands for faster, more reliable, and higher-quality software solutions.\nIgniteTech stands out by deploying groundbreaking Generative AI technologies that redefine the fundamentals of software development. This role goes beyond conventional AI applications focused on minor improvements; it is about pioneering extensive, strategic projects that utilize AI to significantly boost both efficiency and innovation across the board. This position promises a dynamic platform to spearhead initiatives that set new industry benchmarks.\nDesigned for the bold and the visionary, this role is perfect for those who are not just proficient in AI and software architecture but are eager to break new ground in tech applications. In this role, you will be central to crafting intelligent, responsive AI architectures and leading the charge in R&D that propels our solutions well beyond market expectations. Your influence will be key in shaping advanced software solutions. You'll collaborate with top-tier professionals to integrate sophisticated AI capabilities that elevate every aspect of our product line.\nIf you have a passion for AI and a drive to innovate, we invite you to join us. Apply now and lead the charge in the AI revolution.What you will be doing\n  Implement GenAI tools to auto-generate code snippets and entire modules, reducing manual coding requirements and accelerating the development cycle.\n  Develop and refine AI-driven systems that analyze and review code for errors, compliance with coding standards, and optimization opportunities, enhancing code quality and reliability.\nKey responsibilities\n  Engineer significant increases in development speed, reduction in human error, and improvements in code quality, ultimately leading to faster time-to-market for software products and enhanced customer satisfaction.\nCandidate requirements\n  At least 1 year of professional experience implementing impactful initiatives as a software engineer\n  Familiarity with GenAI code assistants (e.g., Github Copilot, Cursor.sh, v0.dev)\n  Previous experience successfully implementing at least one Generative AI product/project/solution/tool\n  Previous experience leveraging different LLMs (e.g., GPT, Claude, Mistral) to solve business problems\nMeet the hiring manager Watch Video You will be working for If you want to work hard at a company where you can grow and be a part of a dynamic tea  About IgniteTech Share this jobShareQuick linksFrequently asked questions"
  },
  {
    "jobTitle": "AI-First Full-Stack Developer",
    "jobDescriptionUrl": "https://www.crossover.com/jobs/5245/trilogy/ai-first-full-stack-developer",
    "companyName": "Trilogy",
    "salary": "$60,000 USD/year  ($30 USD/hour)",
    "jobID": "c3154cae-f683-44c9-b08c-4940a39693ca",
    "jobDescription": "DescriptionAre you ready to dive headfirst into the AI revolution? Trilogy is presenting the launchpad for your tech career. This isn’t about getting a foot in the door; it’s about kicking that door down and charging through. We’re on the hunt for the bold, the relentless, the ones who dream in algorithms and thrive in a storm of innovation. \nYour journey with us starts with an unparalleled opportunity - to get paid while you transform into an AI maestro. From day one, you’ll plunge into intensive, hands-on AI training entirely funded by us. We’re not looking for know-it-alls; we’re searching for learn-it-alls. Curiosity, grit, and a relentless pursuit of excellence are what we value most.\nThe tech world is cluttered with buzzwords, but at Trilogy, we’re all about authentic breakthroughs. Our mission is to revolutionize the B2B software landscape with AI-driven innovations that were once considered sci-fi. Picture this: a chatbot capable of tutoring any subject at university level or an AI plugin that amplifies customer support agents into heroes. That’s where we’re heading, and we want you on board.\nWe're looking for the game-changers. The problem solvers. The hustlers ready to immerse themselves in AI and emerge as leaders. You don’t just adapt to change; you drive it. You’re not just looking for a job; you’re seeking a mission. If the idea of becoming an AI wizard while shaping the future of tech excites you, you might just be the trailblazer we’ve been searching for.What you will be doing\n  Rapidly advancing your AI expertise through specialized training and applying this knowledge to create autonomous, AI-driven platforms and tools\n  Experimenting with state-of-the-art AI tools like GPT-4 Vision, Google Gemini, and Amazon CodeWhisperer, integrating them into our developmental process to enhance their utility\n  Evaluating and optimizing AI solutions across various infrastructures, such as AWS\nWhat you will NOT be doing\n  Traditional coding - our AI does the heavy lifting, freeing you to innovate and strategize\n  Being stuck on repetitive tasks - no two problems are the same\nKey responsibilities\n  Architecting and deploying sophisticated, fully-automated AI systems that require no human intervention for a truly scalable impact\nCandidate requirements\n  A passion for and basic understanding of generative AI, Large Language Models, Prompt Engineering, and the wider AI ecosystem\n  Professional experience using AI to realize quantifiable business value\n  Proficiency in Python\nYou will be working for Hundreds of software businesses run on the Trilogy Business Platform. For three decades  About Trilogy Share this jobShareQuick linksFrequently asked questions"
  },
  {
    "jobTitle": "AI-First Software Engineer",
    "jobDescriptionUrl": "https://www.crossover.com/jobs/5260/totogi/ai-first-software-engineer",
    "companyName": "Totogi",
    "salary": "$60,000 USD/year  ($30 USD/hour)",
    "jobID": "5bdccee3-5004-4d4b-ac28-ddb60778f409",
    "jobDescription": "DescriptionTotogi is on the lookout for tech trailblazers ready to dive headfirst into the next wave of software development with AI as their co-pilot. Think less routine, more innovation. Here, AI isn't just another tool—it's your sidekick, elevating your coding skills to superhero status. Imagine conjuring code like magic, predicting and squashing bugs before they even emerge, and delivering groundbreaking solutions that leave customers in awe.\nThis role is all about pushing the boundaries of what's possible in software development. You'll be instrumental in crafting AI tools that clarify complex concepts, employing the latest in technology to upgrade your coding skills to superhero-level. Your objective is to elevate our enterprise software solutions, ensuring they lead the market in innovation, user satisfaction, and overall experience.\nTotogi values driven, curious, and innovative individuals ready to explore new horizons. We're charting a course towards a new way of working, with AI as our guide. Are you up for the challenge?What you will be doing\n  Create and integrate backend AI agents using frameworks like Python LangChain to process natural language inputs and interact with APIs\n  Develop AI-powered frontend interfaces for user interactions, such as chatbots or browser extensions\n  Design and implement AI-driven features for automating tasks, such as custom report generation\nWhat you will NOT be doing\n  Routine maintenance and debugging of legacy systems\n  Manual testing and quality assurance\n  Infrastructure management, such as server setup and network configuration\nKey responsibilities\n  Drive the integration of AI into our development process, setting new standards in innovation, efficiency, and customer satisfaction for Totogi's product suite.\nCandidate requirements\n  Familiarity with different LLM architectures and the ability to select the most appropriate model for specific tasks\n  The ability to integrate LLMs into DevOps pipelines \n  Experience using LLMs for tasks like code generation, code completion, and automated code review\n  The ability to integrate vector databases with LLMs for tasks like question answering or information retrieval\nYou will be working for Totogi is focused on building telco software for the public cloud and is completely red  About Totogi Share this jobShareQuick linksFrequently asked questions"
  },
  {
    "jobTitle": "Senior Hadoop Engineer",
    "jobDescriptionUrl": "https://www.crossover.com/jobs/5349/totogi/senior-hadoop-engineer",
    "companyName": "Totogi",
    "salary": "$60,000 USD/year  ($30 USD/hour)",
    "jobID": "8f25fa72-c76f-45ff-880d-14434741cdfc",
    "jobDescription": "DescriptionIn the fast-paced world of Big Data, companies often drown in the sheer volume and complexity of their data. They struggle to create systems that ensure data quality, integrity, and security while being both scalable and efficient. The need for robust, high-performance data processing solutions has never been greater as data volumes soar.\nEnter Totogi. We're rewriting the playbook with our cutting-edge Big Data solutions, leveraging the latest Hadoop ecosystem and cloud technologies. By working closely with data scientists and analysts, we are building data processing systems that supercharge our business. We're powering data-driven business decisions and delivering insights that matter to the company's bottom line.\nIn this role, you’ll go beyond the technical confines and dive deep into collaboration with data experts. You'll design and implement state-of-the-art data architectures, create and maintain efficient data pipelines, and ensure our data infrastructure is bulletproof. Your work will be the backbone of our data strategy, making you a pivotal player in our mission to transform data into actionable intelligence.\nJoin our team and become the mastermind behind our data infrastructure. You’ll be responsible for designing innovative Big Data solutions, developing high-performance data pipelines, and managing top-tier data infrastructure. With your skills in Hadoop tools, data processing frameworks, and cloud platforms, you'll drive our data initiatives to new heights. If solving complex data puzzles and working with the latest technologies excites you, then we want you on our team.What you will be doing\n  Designing Big Data Solutions: Developing and implementing Hadoop-based data architectures.\n  Developing Data Pipelines: Creating and maintaining Hadoop-based data pipelines and workflows.\n  Managing Data Infrastructure: Administering Hadoop clusters and related tools.\nKey responsibilities\n  Building a robust and scalable data processing system that ensures data quality, integrity, and security to support business needs and optimize performance.\nCandidate requirements\n  At least 2 years of experience as a Big Data engineer or architect working with Hadoop\n  Proficiency in using Hadoop ecosystem tools (e.g., HDFS, Hive, HBase, Spark, Kafka)\n  Familiarity with data warehousing concepts and ETL processes and cloud platforms (e.g., AWS, Azure, GCP)\n  Proficiency in coding and LLM prompt engineering\nYou will be working for Totogi is focused on building telco software for the public cloud and is completely red  About Totogi Share this jobShareQuick linksFrequently asked questions"
  },
  {
    "jobTitle": "AI Customer Service Specialist",
    "jobDescriptionUrl": "https://www.crossover.com/jobs/5267/ignitetech/ai-customer-service-specialist",
    "companyName": "IgniteTech",
    "salary": "$60,000 USD/year  ($30 USD/hour)",
    "jobID": "12cfc9d5-2862-4c7f-bc9f-9462b95a21af",
    "jobDescription": "DescriptionAre you a forward-thinking developer eager to harness the power of GenAI to redefine business standards and enhance productivity? Are you bored of solving the same customer support tickets or resolving the same bugs over and over again?\nThe majority of companies struggle with integrating AI into existing workflows, often resulting in underutilization and disappointing outcomes. At IgniteTech, we set ourselves apart by focusing on the practical application advanced AI technologies to transform business operations. Our approach isn't just about making incremental improvements; it's about leveraging AI to develop, support, and optimize tools that enhance both the workflow processes and the quality of service provided to our clients.\nThis role IgniteTech is far from a conventional customer support or software engineer job. It is designed for those who are passionate about deploying GenAI to create robust support solutions, significantly improving productivity and customer satisfaction. Ideal for innovators who thrive in a dynamic environment, this position will place you at the helm of integrating revolutionary AI technologies.\nIn this role, you’ll lead the charge in experimenting with and integrating cutting-edge AI technologies. You will play a pivotal role in shaping the future of AI-driven tools, from their inception to their optimization. If you're ready to be at the forefront of the AI revolution and transform how businesses operate, we invite you to apply today. Join us at IgniteTech, where we're not just changing the game—we’re defining it. Let’s innovate together and make a lasting impact.What you will be doing\n  Create and improve autonomous support platforms using LLMs. This includes not only development but also troubleshooting, maintaining, and updating tools based on user feedback and support tickets. One example would be creating an assistant able to guide customers through an upgrade process.\n  Test and integrate state-of-the-art AI technologies, like GPT-4 Vision and Amazon CodeWhisperer, while providing support and guidance for internal teams on how to best utilize these technologies within their workflows.\n  Evaluate and enhance the performance and integration of AI solutions across different infrastructures, notably AWS, and ensures support is available for end-users experiencing issues, focusing on maintaining high service quality and satisfaction.\nKey responsibilities\n  Improve support for both internal and external clients, significantly boosting the company’s innovation capacity and service quality\nCandidate requirements\n  Professional experience leveraging LLMs, such as ChatGPT, Gemini, or Claude, to automate manual tasks and boost your company's productivity\n  At least 2 years of experience in B2B software customer support\n  Proficiency in Python\nMeet the hiring manager Watch Video You will be working for If you want to work hard at a company where you can grow and be a part of a dynamic tea  About IgniteTech Share this jobShareQuick linksFrequently asked questions"
  },
  {
    "jobTitle": "Senior Systems Engineer",
    "jobDescriptionUrl": "https://www.crossover.com/jobs/5281/totogi/senior-systems-engineer",
    "companyName": "Totogi",
    "salary": "$60,000 USD/year  ($30 USD/hour)",
    "jobID": "960fb382-7d5f-45e7-a1b1-b70645260893",
    "jobDescription": "DescriptionTotogi is facing down the challenges of the tech support sector. With the surge in demand for ruthless efficiency and uncompromised customer satisfaction, the stakes have never been higher. Traditional methods are a recipe for disaster, risking revenue losses and dwindling customer loyalty at an alarming rate. As AI revolutionizes the industry, there's a dire need for warriors who don’t just operate technology but dominate it to drive superior business outcomes.\nAt Totogi, we're leading the charge by infusing state-of-the-art AI and top-tier technical prowess into our support operations. This radical integration allows us to streamline complex support functions, skyrocketing operational efficiency and transforming customer interactions. Our strategy doesn't just differentiate us—it makes us pioneers of technical innovation and customer delight.\nUnlike the standard bearers of reactive support, this position arms you with cutting-edge AI tools and deep technical know-how, charging you with the mission to actively elevate our service delivery. We're calling on the obsessed: those fueled by a drive to manipulate AI's potential to revolutionize service experiences, thrive on intricate technical challenges such as scripting and system configurations, and are relentless in their pursuit of perpetual innovation.\nWe invite the audacious to step up and disrupt the status quo of tech support. If you’re wired to stretch the limits of AI and advanced tech, we want you. Apply now and join Totogi in sculpting the future of technical support.What you will be doing\n  AI System Building: Designing and implementing AI-driven systems and monitoring tools to enhance operational efficiency.\n  Service Configuration and Maintenance: Using AI tools to configure BSS & OSS products, ensuring seamless service delivery and customer satisfaction.\nWhat you will NOT be doing\n  Answering the same questions over and over again\n  Providing trivial or basic troubleshooting\n  Writing knowledge base articles\nKey responsibilities\n  Enhance operational efficiency and customer satisfaction by optimizing and automating tasks using AI-driven systems and advanced technical skills\nCandidate requirements\n  At least 2 years of experience working in the telecommunication industry and familiarity with Radius and Diameter protocols\n  Professional experience using generative AI tools (e.g. ChatGPT, Gemini, Claude) to boost productivity\n  Proficiency in Linux, Kubernetes, and AWS\n  The ability to work in any shift assigned to you (we will take your preferences into consideration)\nYou will be working for Totogi is focused on building telco software for the public cloud and is completely red  About Totogi Share this jobShareQuick linksFrequently asked questions"
  },
  {
    "jobTitle": "SVP of Commercial Product Management",
    "jobDescriptionUrl": "https://www.crossover.com/jobs/4679/trilogy/svp-of-commercial-product-management",
    "companyName": "Trilogy",
    "salary": "$400,000 USD/year  ($200 USD/hour)",
    "jobID": "505704a4-8f05-4ba4-91c5-9a5911f055cd",
    "jobDescription": "DescriptionAre you at the pinnacle of your career, with a decade of experience steering B2B SaaS products toward market success? Are you interested in working at the cutting edge of generative AI, pioneering its application in product development?\nTrilogy's portfolio includes over 100 B2B software companies and acquires more every year. In our view, every industry will be disrupted by Generative AI, and all of our products must embrace it. In this role, you will be responsible for setting the GenAI product vision for our entire portfolio of companies. In so doing, you will delve into the customer mindset, involving deep analysis of market trends, customer behavior, and product profitability, and determine how we can leverage GenAI to maximize customer value. Your strategic decisions will significantly influence our products' market positioning and profitability, driving both customer satisfaction and business success.\nWe're not just looking for a product manager; we're looking for a visionary who’s ready to redefine the standards of product management. If you’re ready for a role where you'll drive real market impact, we invite you to bring your expertise to our team!What you will be doing\n  Align customer and market analysis with strategic objectives, using generative AI to enhance decision-making and efficiency.\n  Perform in-depth analysis of product costs, pricing, and customer data to optimize profitability and market positioning.\n  Develop and refine our product offerings, incorporating customer feedback and using AI to create exceptional customer experiences.\nWhat you will NOT be doing\n  Managing the entire product development cycle; your focus will be on high-level strategic planning and decision-making.\n  Technical product decisions; these are managed by a specialized team, allowing you to concentrate on the commercial aspects.\n  Engaging in constant cross-functional communication; you are the primary decision-making authority.\nKey responsibilities\n  Driving customer retention through strategic service offerings, informed by generative AI to maximize value creation.\nCandidate requirements\n  At least 7 years of experience in a product management role within a B2B SaaS company\n  Experience leveraging AI technologies (such as ChatGPT, Claude, or Gemini) in a product management context (for ideation, strategy formulation, etc.)\nYou will be working for Hundreds of software businesses run on the Trilogy Business Platform. For three decades  About Trilogy Share this jobShareQuick linksFrequently asked questions"
  },
  {
    "jobTitle": "Senior AI Innovation Specialist - Sales",
    "jobDescriptionUrl": "https://www.crossover.com/jobs/5266/ignitetech/senior-ai-innovation-specialist---sales",
    "companyName": "IgniteTech",
    "salary": "$100,000 USD/year  ($50 USD/hour)",
    "jobID": "ad5bbde4-3320-4643-80fe-14cbf1dcc223",
    "jobDescription": "DescriptionThe sales industry is drowning in inefficiency, yet ripe for disruption. At IgniteTech, we're not just tweaking systems; we're overhauling the sales process with advanced AI tools that change the game. Our AI-enhanced execution and predictive forecasting are not just about improvement but transformation, boosting sales efficiency and effectiveness dramatically.\nIn this role, you'll wield cutting-edge generative AI to not only enhance real-time sales executions but also steer long-term market forecasting. Imagine deploying AI that provides instant, deep insights during live customer interactions, or forecasting models that predict market shifts with stunning accuracy. Here, your work will directly increase sales conversions and ensure that our forecasts hit the mark, recalibrating in real time as the market evolves.\nYou will also integrate into a team where your efforts reshape our overarching business landscape. Your day-to-day will involve leveraging AI to streamline current sales processes and articulating complex AI benefits to non-technical stakeholders. This position is crafted for someone who thrives under pressure, loves a challenge, and is eager to push boundaries in AI and sales.\nIf the prospect of leading such transformative initiatives excites you, IgniteTech is your stage. This is where you can make a significant impact, leading the charge in AI-driven sales innovation. Ready to lead the future of B2B sales with groundbreaking AI? Apply now and join us in setting new industry standards at IgniteTech.What you will be doing\n  AI-Enhanced Sales Execution: Direct application of GenAI technologies to facilitate and enhance the day-to-day execution of sales activities.\n  Advanced Sales Forecasting and Market Analysis: Oversee advanced analytics projects that use AI to forecast long-term market trends and sales performance.\n  Drive AI Adoption: Lead initiatives to deploy AI-driven tools that assist sales teams in real-time during customer interactions and sales negotiations.\nKey responsibilities\n  Drive significant improvements in sales efficiency and effectiveness through the development and implementation of AI-driven sales tools.\nCandidate requirements\n  Professional experience leveraging multiple LLMs (ChatGPT, Gemini, Claude, etc.) and AI tools to automate manual tasks and boost your company's productivity (if you've only ever used ChatGPT, that's probably not enough)\n  At least 3 years of experience in B2B software sales\nMeet the hiring manager Watch Video You will be working for If you want to work hard at a company where you can grow and be a part of a dynamic tea  About IgniteTech Share this jobShareQuick linksFrequently asked questions"
  },
  {
    "jobTitle": "AI-First Sales Director - APAC",
    "jobDescriptionUrl": "https://www.crossover.com/jobs/5313/totogi/ai-first-sales-director---apac",
    "companyName": "Totogi",
    "salary": "$100,000 USD/year  ($50 USD/hour)",
    "jobID": "262e31d5-c000-49b0-bf5f-11b2758cf3bb",
    "jobDescription": "DescriptionIn the fast-paced telecommunications industry, companies face the challenge of market saturation and stagnant revenue growth. According to recent industry reports, only a fraction of telecom providers in Asia are effectively leveraging advanced technologies to drive significant business improvements. This stagnation highlights the need for innovative approaches to market penetration and revenue generation.\nAt Totogi, we are transforming the telecom landscape by harnessing the power of AI and advanced solution selling techniques. Our strategy focuses on leveraging deep industry connections to secure and expand partnerships with Tier 1, 2, and 3 telecommunications companies. This approach not only drives market penetration but also propels revenue growth by integrating cutting-edge AI solutions into our business processes. The excitement lies in our commitment to revolutionizing telecom sales through AI-driven transformations, offering a dynamic and impactful environment for sales professionals.\nThis role is not about maintaining the status quo or merely managing accounts. It is about being a catalyst for change, leading the charge in identifying and nurturing new business opportunities, and driving strategic initiatives that result in measurable success. As a sales leader for APAC, you will oversee and enhance existing client relationships, develop new partnerships, and manage the sales cycle from inception to closure. Your focus will be on achieving and exceeding sales targets, ensuring customer success, and leveraging AI to optimize business operations and relationships.\nJoining our team means becoming a pivotal part of our leadership, dedicated to pioneering AI-driven sales transformations in the telecommunications industry. You will be at the forefront of dynamic sales engagements, building deep, impactful relationships with customers, and driving actionable results. If you are an ambitious sales professional with a proven track record in the APAC telecom market, and you thrive in an environment that demands initiative and self-direction, we encourage you to apply and lead the revolution in telecom sales at Totogi.What you will be doing\n  Book of Business Management: Overseeing and enhancing existing client relationships and revenue streams within the region.\n  Business Development through Partnerships: Expanding the book of business by developing new direct and partner relationships.\n  Opportunity Management: Identifying and scoping potential sales solutions, managing the sales cycle from inception through to closure.\n  Customer Success Management: Ensuring customer success, including regular executive-level interactions to maintain and strengthen relationships.\nKey responsibilities\n  Market penetration and revenue growth by leveraging deep industry connections, advanced solution selling techniques, and AI tools to secure and expand partnerships with Tier 1, 2, and 3 telecommunication companies\nCandidate requirements\n  Must be currently located in Southeast Asia\n  A proven track record of closing software or services deals with Tier 1, 2, and 3 telecommunications providers in the APAC region (you will fail the interview if you don't have this experience)\n  Professional experience using generative AI tools (such as ChatGPT, Gemini, and Claude) to optimize workflows and transform business operations\nYou will be working for Totogi is focused on building telco software for the public cloud and is completely red  About Totogi Share this jobShareQuick linksFrequently asked questions"
  },
  {
    "jobTitle": "AI Innovation Specialist - Sales Engineering",
    "jobDescriptionUrl": "https://www.crossover.com/jobs/5277/gfi-software/ai-innovation-specialist---sales-engineering",
    "companyName": "GFI Software",
    "salary": "$60,000 USD/year  ($30 USD/hour)",
    "jobID": "19cb3599-5f7c-48e0-ad73-0791c3bfa8ea",
    "jobDescription": "DescriptionAre you interested in shaping the future of sales with cutting-edge AI? The tech industry is currently strangled by inefficient sales processes and slow transitions from lead generation to deal closure. Traditional methods no longer suffice in today's fast-paced market, where a streamlined sales cycle is not just preferred but essential.\nGFI's unique integration of AI-driven analytics with cybersecurity and IT solutions sets us apart. We've crafted AI tools that accelerate the sales process and enhance decision-making with real-time insights into customer behaviors and market dynamics. This revolutionary approach boosts efficiency and secures a competitive edge in the IT security landscape, providing a thrilling playground for tech enthusiasts.\nThis role is for those who thrive on innovation and are eager to drive advancements, rather than just maintain status quo. As a pivotal member of our team, your time won't be wasted cold calling potential customers; you'll be designing, prototyping, and refining AI sales systems that redefine our standard of sales strategies.\nJoining our team means becoming part of a dynamic group where your contributions will directly influence the company's trajectory. If you possess a robust understanding of generative AI technologies, excel at problem-solving, and can communicate complex AI functionalities effortlessly, you're the candidate we are looking for. Help us transform GFI's strategic initiatives and elevate our market performance. Apply today and be at the forefront of the AI revolution in sales!What you will be doing\n  Design, prototype, and implement AI tools that automate essential sales functions, such as customer data analysis, lead scoring, and sales forecasting.\n  Use AI to monitor market trends and competitor activities, providing actionable insights to adapt sales strategies.\nWhat you will NOT be doing\n  Cold calling potential customers\n  Manual data entry tasks\n  Standard software maintenance or bug fixing\n  Conducting on-site client visits or travel for sales purposes\nKey responsibilities\n  Streamline the sales cycle and reduce the time from lead generation to deal closure by implementing of AI tools\nCandidate requirements\n  At least 1 year of experience in a sales role within the technology sector\n  Hands-on experience with LLMs, such as ChatGPT, Gemini, or Claude in a professional setting\n  Basic understanding of cybersecurity concepts and the cybersecurity industry\nMeet the hiring manager Watch Video You will be working for GFI Software develops essential applications for small and medium businesses. Over 80,0  About GFI Software Share this jobShareQuick linksFrequently asked questions"
  },
  {
    "jobTitle": "AI Innovation Specialist - Channel Sales",
    "jobDescriptionUrl": "https://www.crossover.com/jobs/5278/gfi-software/ai-innovation-specialist---channel-sales",
    "companyName": "GFI Software",
    "salary": "$60,000 USD/year  ($30 USD/hour)",
    "jobID": "36556fa7-76ba-4491-a95e-4e8f791c6e35",
    "jobDescription": "DescriptionAre you ready to step into the future of sales and channel management? The channel management industry often grapples with inefficiencies in scaling operations, maintaining consistent growth, and effectively integrating technology to enhance partner interactions. Many companies still rely on traditional methods that lack data-driven decision-making and advanced analytical capabilities.\nAt GFI, we revolutionize this space by integrating Generative AI across all facets of our channel management processes. Our cutting-edge approach not only optimizes operations but also drives sustained revenue growth by enhancing the efficiency and effectiveness of our network of distributors, resellers, and MSPs. This is an electrifying opportunity to be at the forefront of tech-driven sales innovation, leveraging AI to transform standard practices into dynamic, strategic engagements that deliver measurable results.\nThis role is not your typical channel sales role. You will be expected to master and deploy Generative AI tools, ensuring our partnerships are not just maintained but also optimized and expanded through strategic data-driven methodologies. Your work will involve rigorous partner recruitment, dynamic training sessions, and stringent performance assessments—all enhanced by advanced AI.\nYou'll fit into a team of forward-thinkers where each member is crucial in sculpting the future landscape of channel sales. Your role is pivotal in shaping how partnerships flourish in a tech-driven environment, ensuring both the growth of GFI and our partners. If you are eager to redefine industry standards and possess a robust blend of GenerativeAI proficiency, professional communication, and channel sales management, we encourage you to apply. Join us in transforming the blueprint of channel management and take your place as a leader in a cutting-edge sales revolution.What you will be doing\n  Partner Recruitment and Onboarding: Identifying, recruiting, and onboarding new partners to expand the channel network. This involves evaluating potential partners' alignment with the company's values and goals, as well as their market reach and capabilities.\n  Training and Development: Providing partners with the necessary training and resources to effectively sell and support the product. This includes product training, sales techniques, and ongoing professional development to enhance their capabilities.\n  Performance Monitoring and Management: Continuously monitoring the performance of partners against predefined benchmarks and metrics. This includes regular assessment of sales figures, customer feedback, and other performance indicators to identify areas for improvement.\nWhat you will NOT be doing\n  Directly selling to end-user customers\n  Prioritizing the quantity of interactions over the quality of your engagements with partners\n  Worrying about unpredictable earnings and relentless travel demands\nKey responsibilities\n  Sustained revenue growth from efficiently managing and optimizing a network of distributors, resellers, and MSPs using GenerativeAI tools\nCandidate requirements\n  Professional experience leveraging multiple LLMs (ChatGPT, Gemini, Claude, etc.) and AI tools to automate manual tasks and boost your company's productivity (if you've only ever used ChatGPT, that's probably not enough)\n  1+ year of indirect channel sales experience in the software industry (direct sales experience does not count)\nMeet the hiring manager Watch Video You will be working for GFI Software develops essential applications for small and medium businesses. Over 80,0  About GFI Software Share this jobShareQuick linksFrequently asked questions"
  },
  {
    "jobTitle": "AI Super Engineer - Finance",
    "jobDescriptionUrl": "https://www.crossover.com/jobs/5178/trilogy/ai-super-engineer---finance",
    "companyName": "Trilogy",
    "salary": "$200,000 USD/year  ($100 USD/hour)",
    "jobID": "567346b8-b70d-4e8c-8404-a9db79d202c5",
    "jobDescription": "DescriptionTrilogy is pioneering a groundbreaking venture – the first ever fully automated, zero-human finance operation in the world, and we are searching for a seasoned engineer with a deep passion for AI to lead the charge. In this role, you will use generative AI not just as a tool, but as a basis for innovation. Once a critical mass of companies find out what we’re doing, it will become the industry norm.\nYour mission is to harness the power of AI to reimagine the finance processes of over 100 software products under our umbrella. You will delve into the challenge of automating financial systems and creating efficient, intelligent solutions. This role is about redefining the finance function from the ground up with generative AI as your co-pilot in every step you take, from generating codes to refining algorithms.\nAt Trilogy, you'll be part of a dynamic, global team that values innovation and efficiency. We thrive in an ecosystem that’s constantly evolving, pushing the limits of AI to new frontiers. Here, you'll have the opportunity and the autonomy to experiment with the latest AI tools, making significant contributions to our finance operations. These contributions will redefine what’s possible in finance, setting new standards for efficiency and accuracy.\nWe’re scouting for someone who dares to think differently and is unafraid to challenge the status quo. If you are motivated by innovation and ready to make a tangible impact in a global, tech-driven company, we invite you to be a part of our journey!What you will be doing\n  Identify opportunities to integrate AI solutions into existing financial systems, focusing on improving efficiency, accuracy, and scalability.\n  Design and implement AI technologies to fully automate key financial processes, such as transaction handling, invoicing, and reporting.\n  Lead the entire finance department to deliver desired business outcomes.\nWhat you will NOT be doing\n  Old school finance tasks; your mission is to develop AI-driven systems that handle all kinds of finance operations on its own.\n  Using outdated technologies; you'll have access to cutting-edge AI tools and the freedom to innovate in a tech-forward environment.\nKey responsibilities\n  Create the world's first zero-human finance operation using AI\nCandidate requirements\n  At least 5 years of experience in professional software development.\n  At least 3 years as a lead engineer managing the work of an entire engineering team.\n  Mastery of generative AI tools (such as ChatGPT, Clause, Bard, or Bing)\nYou will be working for Hundreds of software businesses run on the Trilogy Business Platform. For three decades  About Trilogy Share this jobShareQuick linksFrequently asked questions"
  },
  {
    "jobTitle": "AI Innovation Analyst - Finance",
    "jobDescriptionUrl": "https://www.crossover.com/jobs/5263/ignitetech/ai-innovation-analyst---finance",
    "companyName": "IgniteTech",
    "salary": "$30,000 USD/year  ($15 USD/hour)",
    "jobID": "a8f7e10c-1f2e-49f9-a020-8c073cb56a2f",
    "jobDescription": "DescriptionThe financial sector is congested with outdated systems and manual processes that are both time-consuming and error-prone. The industry struggles with data overload and is full of inefficiencies that lead to missed opportunities and a lag in response to financial trends.\nAt IgniteTech, our approach to these challenges is employing cutting-edge AI technologies. Unlike typical companies that may still rely on traditional methods in finance management, we rely on AI tools specifically designed to support complex financial analyses, transforming bulky, outdated systems into agile, effective platforms.\nIn this role, you will become an AI expert quickly. You will participate in IgniteTech’s “AI Mondays”, during which you will learn many different AI tools and then implement them into your daily workflow. After a year in this role, you will feel like you earned a master’s degree in Generative AI.\nIf you are ready to support IgniteTech's key operational processes and drive our business forward, we encourage you to apply today and put your skills to the test!What you will be doing\n  Conduct detailed financial analysis and forecasting using AI tools to support strategic decision-making\n  Use AI to improve vendor relations processes, including evaluating and selecting vendors, negotiating contracts, and monitoring vendor performance to achieve cost savings and service excellence\n  Streamline processes around repeatable operational requests from channel partners with AI tools\nWhat you will NOT be doing\n  Solely focusing on manual data analysis and report generation; you'll leverage AI to transform these tasks into automated processes.\n  Spending hours navigating old-fashioned software interfaces; our focus is on using cutting-edge AI tools to improve efficiency.\nKey responsibilities\n  Support the development and refinement of AI-driven tools that automate tasks and streamline workflows to improve IgniteTech’s financial service offerings.\nCandidate requirements\n  Previous experience using generative AI tools, such as ChatGPT, Gemini, and Bard\n  Proficiency in financial analysis\nMeet the hiring manager Watch Video You will be working for If you want to work hard at a company where you can grow and be a part of a dynamic tea  About IgniteTech Share this jobShareQuick linksFrequently asked questions"
  },
  {
    "jobTitle": "AI-First Project Manager",
    "jobDescriptionUrl": "https://www.crossover.com/jobs/5273/totogi/ai-first-project-manager",
    "companyName": "Totogi",
    "salary": "$60,000 USD/year  ($30 USD/hour)",
    "jobID": "814d51fe-241f-499c-b22c-0a9d0f2d1945",
    "jobDescription": "DescriptionIf you are an AI-forward project manager in the telecommunications industry, we have a job for you! Traditional project management methods often lead to projects that are over budget, delayed, or out of scope, significantly impacting business outcomes. However, our innovative approach integrates advanced AI-driven tools to transform project delivery, ensuring efficiency, quality, and satisfaction.\nAt Totogi, our differentiation from the rest of the telco industry is that we're all in on learning new technologies. By harnessing the power of AI in project coordination, escalation management, and reporting, we enable our teams to deliver projects with unparalleled precision and insight. This role is about pushing boundaries and setting benchmarks. You will use AI to not only streamline operations but also predict and innovate, ensuring our projects lead the market in both pace and performance.\nIf you're skilled in AI project management tools, possess a robust understanding of the telecommunications industry, and have a knack for analytical thinking and problem-solving, then step into a role where your work dramatically influences our operations and advances your career. Apply today to join a team that values innovation and excellence, and start leading the change in telecommunications project management.What you will be doing\n  AI-Driven Project Coordination and Process Innovation: Employing AI systems for optimal scheduling, resource allocation, status reporting, and championing the use of AI tools to automate tasks and optimize workflows.\n  Escalation Management: Managing escalations and critical decisions to ensure project milestones are met.\n  AI-Powered Reporting and Insights: Utilizing AI to generate insightful project reports and predictive analytics, enhancing project communication and stakeholder satisfaction.\nWhat you will NOT be doing\n  Hands-On Technical Tasks: While you will oversee projects involving technical elements, your role will not require deep technical expertise in OSS/BSS technologies.\n  Heavy Technical Documentation: Focus on strategic oversight rather than detailed technical documentation or hands-on implementation.\nKey responsibilities\n  Projects are delivered on time, within scope, and within budget, while maintaining high quality standards and customer satisfaction, as a result of AI integration\nCandidate requirements\n  Experience in OSS and BSS project management within the telecom sector\n  Experience in the following project management areas: Project status reporting; Effort, schedule, and cost variance analysis; Earned value management; Risk assessment and mitigation; RAG (Red/Amber/Green) status reporting; Scope change management\n  Experience using GenAI tools, such as ChatGPT, Gemini, or Claude, to boost productivity\nYou will be working for Totogi is focused on building telco software for the public cloud and is completely red  About Totogi Share this jobShareQuick linksFrequently asked questions"
  },
  {
    "jobTitle": "AI-First CEO - Education",
    "jobDescriptionUrl": "https://www.crossover.com/jobs/5132/stealth-educational-startup/ai-first-ceo---education",
    "companyName": "Stealth Educational Startup",
    "salary": "$400,000 USD/year  ($200 USD/hour)",
    "jobID": "e4fb14d0-1001-4659-83f3-a7456ceb6677",
    "jobDescription": "DescriptionAre you passionate about revolutionizing education through cutting-edge AI technology? Join our stealth-stage EdTech startup, where we're not just building another learning platform – we're on a mission to transform the US education system. As a visionary leader of our AI-enabled Learning Management Software (LMS), you'll be at the forefront of this educational revolution.\nThis is not your typical leadership role. We're seeking an evangelist and visionary who can drive substantial user adoption and shape the future of learning on a global scale. You'll be leveraging generative AI to boost productivity and customer engagement, without the burden of traditional executive responsibilities like day-to-day operations and team management.\nWhat sets this role apart is the laser focus on a single product in the specialized US education space. Your mission will be to drive user adoption in a crowded sector, directly impacting the way students engage with academic content. Your proven experience in selling EdTech products and strong relationships with procurement departments of districts and states will be crucial to your success.\nImagine having the power to transform education for millions of students and teachers across the US. If you're ready to champion this cause, build a strong personal brand, and thrive in a dynamic environment – we want you on our team. Together, let's leverage the power of AI to revolutionize learning!What you will be doing\n  Developing and implementing a strategic sales plan targeting US education providers.\n  Establishing and managing strategic partnerships with key educational institutions.\n  Driving initiatives to increase user adoption and customer satisfaction.\n  Building and maintaining a personal brand through public speaking, publishing, and thought leadership in the education and AI sectors.\nWhat you will NOT be doing\n  Focusing solely on internal operations and team management.\n  Managing traditional school operations or curriculum development.\n  Engaging in repetitive cold calling or high-pressure sales tactics.\nKey responsibilitiesLead the strategic development and execution of initiatives to drive user adoption and sales of AI-enabled LMS in the US education sector.Candidate requirements\n  At least 10 years of progressive experience in sales or business development roles within the EdTech sector.\n  Proven track record in driving sales growth and market penetration, including building or selling a $100m EdTech product.\n  Strong relationships and credibility with procurement departments of school districts and state education departments.\n  Experience using generative AI tools to achieve quantifiable productivity and/or product improvements.\n  Ability to grow and engage a social media following and influence public perception of the product portfolio.\n  Currently based in the US and willing to travel for public events.\nYou will be working for We are a stealth educational startup in Austin, TX (center of educational innovation in  About Company Share this jobShareQuick linksFrequently asked questions"
  },
  {
    "jobTitle": "Chief Operating Officer",
    "jobDescriptionUrl": "https://www.crossover.com/jobs/4410/stealth-educational-startup/chief-operating-officer",
    "companyName": "Stealth Educational Startup",
    "salary": "$400,000 USD/year  ($200 USD/hour)",
    "jobID": "06aa4c67-f019-41cb-9226-282e45be81dd",
    "jobDescription": "DescriptionAre you ready to lead the operational revolution in education? At our stealth-stage educational startup, we are redefining K-12 education across the US with AI-driven tools that enable students to master core subjects in a few hours each day. Our mission is to free up time for students to focus on sports, arts, entrepreneurship, and other holistic development activities. \nWe are seeking a visionary leader to pioneer an AI-driven operational framework and ensure efficiency, scalability, and consistency across all our locations. Join us and harness cutting-edge AI and automation technologies to create a scalable, efficient, and consistent operational model, positioning our network of campuses as the gold standard in educational excellence.\nIn this role, you will utilize AI tools to create and refine our school campus model, implement AI systems for daily operational oversight, and continuously improve long-term operational processes. You will also manage the buildout of new campuses, coordinating with contractors and ensuring compliance with regulations to achieve final occupancy certification on time and within budget.What you will be doing\n  Implement AI-driven systems for daily operations and long-term process improvement.\n  Develop and refine scalable franchise models using AI tools.\n  Oversee new campus buildouts from planning to final occupancy.\nWhat you will NOT be doing\n  Directly coaching or supervising academic staff.\n  Engaging in regular, direct communications with students and parents.\n  Creating educational curriculums or models.\nKey responsibilitiesDevelop and implement an AI-driven operational framework to transform operational management through predictive analytics and real-time monitoring, ensuring efficiency, scalability, and consistency across all locations.Candidate requirements\n  Minimum of 10 years in operational roles with significant experience in building and optimizing repeatable processes for franchises or multi-location businesses.\n  Proven track record of successfully overseeing operations and implementing AI and automation technologies.\n  Expertise in managing new location buildouts, including regulatory compliance, contractor management, project monitoring, and budget/timeline management\n  A proven track record of successfully implementing AI and automation technologies\n  Strong ability to interpret and utilize data analytics for strategic decision-making.\n  Effective communication skills for conveying AI-driven insights and operational strategies.\n  Willingness to travel 10-40% within the US to support the stand-up of new campuses.\n  Legally eligible to work in the US without visa sponsorship.\nYou will be working for We are a stealth educational startup in Austin, TX (center of educational innovation in  About Company Share this jobShareQuick linksFrequently asked questions"
  },
  {
    "jobTitle": "AI-First CEO - Professional Services",
    "jobDescriptionUrl": "https://www.crossover.com/jobs/5333/trilogy/ai-first-ceo---professional-services",
    "companyName": "Trilogy",
    "salary": "$400,000 USD/year  ($200 USD/hour)",
    "jobID": "3086eb66-9a35-4fd1-b2ac-1e47c6ba08b0",
    "jobDescription": "DescriptionThe professional services industry is undergoing a rapid transformation, driven by the need for increased efficiency and innovation. Despite the proliferation of AI tools, many organizations still grapple with manual workflows, slow customer feedback loops, and the challenge of building a distinct market presence. Data shows that companies implementing AI-driven productivity improvements can see up to a 40% increase in efficiency, yet only a small fraction have successfully integrated these advancements into their operations.\nAt Trilogy, we are reimagining the role of AI in professional services by focusing on generative AI to streamline processes and enhance customer engagement. This approach not only drives significant productivity gains but also ensures our solutions are at the forefront of technological innovation. Our commitment to leveraging the latest advancements in AI sets us apart and creates a dynamic, impactful work environment.\nThis role is not your typical CEO track focused on developing pie-in-the-sky strategies or schmoozing investors. Instead, you will spearhead AI-driven productivity improvements, interact directly with customers to gather and implement feedback, and work towards automating an entire organization. This position is ideal for someone who thrives on using cutting-edge technology to drive business impact and excels in a fast-paced, customer-centric environment.\nAs part of our team, you will have the unique opportunity to drive productivity and customer engagement across over 100 software products, all while bypassing the usual internal logistics of a traditional CEO role. If you are passionate about AI, eager to make a significant impact, and excited about building your brand, we encourage you to apply and join us on this transformative journey.What you will be doing\n  Implementing AI-driven Productivity Improvements: Utilizing generative AI tools to streamline and automate various workflows across the organization.\n  Customer Engagement and Feedback: Interacting with customers to gather insights and feedback, and using this information to enhance product offerings.\n  Develop a Personal Monopoly: Publishing podcast episodes and blog posts and building a social media following to evangelize your portfolio's AI-driven products.\nKey responsibilities\n  Transform a large professional services organization through the innovative use of generative AI\nCandidate requirements\n  At least 8 years of work experience in a professional services organization\n  Experience using generative AI tools to achieve quantifiable productivity improvements\n  Currently based in North America, South America, or Europe\nYou will be working for Hundreds of software businesses run on the Trilogy Business Platform. For three decades  About Trilogy Share this jobShareQuick linksFrequently asked questions"
  },
  {
    "jobTitle": "Lead Guide",
    "jobDescriptionUrl": "https://www.crossover.com/jobs/4844/alpha/lead-guide",
    "companyName": "Alpha",
    "salary": "$150,000 USD/year  ($75 USD/hour)",
    "jobID": "9844e11b-be08-4775-89eb-edd2efbfc537",
    "jobDescription": "DescriptionIMPORTANT NOTE: This is an in-person role located in Austin, Texas. Relocation assistance is available.\nEducational Innovators Wanted: Ignite Your Passion for Inspiring the Next Generation\nAt Alpha, we're on a mission to reinvent education – and we're looking for a visionary leader to create unprecedented opportunities for our students. If you're a master at building high-performing teams and have a deep passion for innovative youth development, this is your chance to make a transformative impact.\nIn this role, you'll have the autonomy and support to take our cutting-edge learning approach to new heights. Anchored in learning science and powered by adaptive technology, we're redefining what's possible in education. But we need your expertise to bring it to life.\nYou'll be the catalyst, the coach, the strategist behind our Guides – our frontline learning facilitators who don't just teach, but inspire. Your leadership will shape how Alpha Guides connect with students, from developing playbooks and feedback mechanisms to modeling exceptional facilitation skills.\nImagine combining your elite coaching abilities with a hands-on passion for youth development. Imagine leading a team that ensures our students don't just succeed but thrive – uncovering hidden talents and life skills along the way. If you've shattered records, turned around failing ventures, or achieved the \"impossible,\" you'll fit right in.\nWhy choose Alpha?\n\n  Competitive pay - we believe you shouldn't take a pay cut to work in education\n  Generous benefits and time off - we value our team and offer a comprehensive benefits package and paid time off\n  Growth and learning culture - we model the growth & learning we expect our students to embrace, so you'll receive coaching, training, and opportunities for leadership\n  Relocation assistance available for highly qualified candidates\n\nIf you know what it takes to build a rockstar team, then join Alpha to help us revolutionize education!What you will be doing\n  Training and developing a team of Guides to implement the Alpha learning system with world-class excellence\n  Creating Guide Playbooks detailing best practices for facilitation, designing rewarding learning activities, and navigating challenges\n  Providing regular, actionable feedback to Guides to amplify student engagement and achievement\n  Directly mentoring a small cohort of students, modeling expert coaching and motivation strategies\nWhat you will NOT be doing\n  Writing lesson plans – your Guides facilitate students' learning through adaptive apps; your focus is on training them to be exceptional facilitators\n  Lowering standards – if our passing grade is 100%, it's your job to maintain that bar\n  Delivering boring training – you'll coach Guides through engaging, high-energy, hands-on development\nKey responsibilitiesTrain and develop a team of Guides to implement the Alpha system with world-class excellence.Candidate requirements\n  Possess a Bachelor's degree in any field.\n  At least 5 years of experience in education, learning and development, coaching, or a related field.\n  Demonstrated experience developing and implementing innovative educational programs, curricula, or training initiatives.\n  Strong leadership and mentorship skills with the ability to build, manage, and motivate high-performing teams.\n  Experience working with youth (ages 5-18) in an educational or developmental capacity.\n  Proficiency in data analysis and using metrics to drive decision-making and continuous improvement.\n  Willingness to work on-site in Austin, Texas. Relocation assistance is available.\n  Legally authorized to work in the United States without visa sponsorship.\nYou will be working for Want to build better schools? Join the thriving community of Alpha. Alpha is a network   About Alpha Share this jobShareQuick linksFrequently asked questions"
  },
  {
    "jobTitle": "Lead Guide",
    "jobDescriptionUrl": "https://www.crossover.com/jobs/5256/sports-academy/lead-guide",
    "companyName": "Sports Academy",
    "salary": "$150,000 USD/year  ($75 USD/hour)",
    "jobID": "c3a89cb3-42cd-4491-9d18-c7c1da71e1f8",
    "jobDescription": "DescriptionIMPORTANT NOTE: This is an in-person role located in Austin, Texas. Relocation assistance is available.\nAre you ready to lead the next generation of champions both on and off the field? \nAt Sports Academy in Austin, TX, we believe life skills like leadership, teamwork, and grit are best taught through sports. As a pioneering private K-8 institution powered by 2hr Learning, we pair AI-driven academics with intensive sports training to create a unique, holistic educational experience. We are looking for inspiring and dynamic leaders to join our team and shape the future of young athletes.\nWe embrace innovation with cutting-edge adaptive apps and motivational strategies. These tools are rooted in learning science—because excellence is not just a goal; it's a way of life.\nInstead of ordinary educators, we're assembling a league of Guides—leaders who breathe life into learning. These mentors ensure that our students don't just succeed; they thrive, learn twice as much, and uncover their talents and life skills.\nThis is where you come in. You've achieved what others thought was impossible—shattering sports records or revitalizing ventures. Your secret? Fusing audacious goals with relentless hard work, innovation, and unlocking your team’s intrinsic motivations.\nNow imagine channeling that spirit into reshaping education and inspiring the next generation. Imagine mentoring our Guides, infusing them with your insight, drive, and leadership.\nWe are seeking an expert mentor to coach and develop our team of Guides. In this role, you’ll shape how Sports Academy Guides connect with students. Consider applying if:\n\n  You’re a natural leader who can balance empathy with logic, objectivity, and firmness\n  You know how to challenge a team to achieve at the next level with ambitious goals.\n  You would be the best Guide if we hired you, but you'd rather coach Guides and hold them to a high standard.\n  You are the resident \"kid expert\" who can build connections, motivate, and cultivate success with any student.\n\nWhy choose Sports Academy?\n\n  Competitive pay - we believe you shouldn't take a pay cut to work in education.\n  Generous benefits and time off - we value our team and offer a comprehensive benefits package and paid time off.\n  Growth and learning culture - you'll receive coaching, training, and opportunities for leadership.\n  Relocation assistance is available for highly qualified candidates.\n\nAre you ready to make a real impact and lead the charge in transforming education through sports? Apply now and join us at Sports Academy to inspire the next generation of champions. Let's redefine what's possible together!What you will be doing\n  Coaching your team of Guides. By regularly providing personal, actionable feedback to your team of Alpha Guides, you’ll improve their daily performance and in turn, amplify student enjoyment and achievement.\n  Creating Guide Playbooks that detail best practices for facilitation, instructions on how to design more rewarding learning activities, and what to do when challenges arise.\n  Motivating Students. You'll lead a small cohort of students, using your kid expertise and coaching skills to turn even the most reticent learner into a rocketship kid!\nWhat you will NOT be doing\n  Writing lesson plans: Think bigger. While your Guides shepherd their students’ day-to-day learning through the use of self-guided, adaptive learning apps, you’ll be training Guides to be better facilitators, showing them how to create enrichment activities, and helping them bring more enthusiasm and impact to their sessions.\n  Lowering standards for any reason: If our standard is 100% to pass, and a Guide wants to pass a student with 99%, you have to uphold that standard. If a 6th grader wants to take a college course, you will have to know how to make that happen.\n  Running boring training programs: No lecture-style professional development allowed! You'll coach Guides by modeling enthusiasm, energy, and expert facilitation skills.\nKey responsibilitiesTrain and develop a team of Guides to implement the Sports Academy system with world-class excellence.Candidate requirements\n  A college degree in any field\n  Demonstrate a successful history of developing and mentoring professional teams to achieve elite-level performance\n  Utilize data-driven approaches for decision-making\n  Exhibit a history of actively engaging with children and teens (ages 5-18), fostering their growth and accomplishment\n  Legal right to work in the US without visa sponsorship\n  Willingness to work in-person in Austin, TX\nYou will be working for Parents know that the best way to teach kids life skills like leadership, teamwork and   About Sports Academy Share this jobShareQuick linksFrequently asked questions"
  },
  {
    "jobTitle": "Guide K-2",
    "jobDescriptionUrl": "https://www.crossover.com/jobs/5149/alpha/guide-k-2",
    "companyName": "Alpha",
    "salary": "$100,000 USD/year  ($50 USD/hour)",
    "jobID": "2b194748-7510-401e-9dd7-b5628743e0ac",
    "jobDescription": "DescriptionIMPORTANT NOTE: This is an in-person role location in Austin, TX. Relocation assistance is available.\nAre you ready to redefine early childhood education? Join Alpha School in Austin, TX, where we don't just teach—we inspire a revolution in learning. You won't be confined to the traditional teacher's desk; you'll be the coach on the playground of minds, empowering Kindergarten - 2nd grade (K-2) students to navigate their learning paths with curiosity and resilience.\nAt Alpha, we challenge the status quo with our 2-Hour Learning program, integrating AI-driven adaptive technology to personalize education like never before. While our students engage with cutting-edge software, they also benefit from the essential human touch with hands-on guidance in reading and writing, supported by experts in scientific educational methodologies. This balance ensures that even our youngest learners develop not only academically but also socially and emotionally under your mentorship.\nWhy Alpha? Because transforming education also means transforming your career potential. We offer competitive compensation, generous benefits, and the unique opportunity to grow professionally in a dynamic, tech-forward environment. If you're passionate about shaping the future of education and adept at building meaningful connections with young learners, we want you on our team.What you will be doing\n  Empowering students to set and achieve personal learning goals, guiding them to become self-directed learners.\n  Providing targeted instruction in social-emotional skills and foundational literacy with the support of Reading Specialists.\n  Fostering a classroom environment that encourages curiosity and resilience through interactive, hands-on learning experiences.\n  Utilizing and embracing AI-driven tools to enhance educational outcomes, preparing students for a future where technology complements traditional learning methods.\n  Collaborating with a team of educators and counselors to support each student's unique journey, adapting to their individual learning needs and styles.\nWhat you will NOT be doing🚫 Relying solely on traditional teaching methods without integrating innovative educational technology.\n🚫 Implementing a one-size-fits-all approach to education—here, individuality in learning is celebrated and nurtured.\n🚫 Overlooking the importance of emotional and social development in favor of purely academic instruction.Key responsibilities💡 Champion the development of independent learning and life skills for Kindergarten - 2nd graders, setting young learners on a path to educational success and personal growth.Candidate requirements\n  Located in or willing to relocate to Austin, TX.\n  A college degree in Early Childhood Education, Elementary Education, Child Development, or a related field.\n  Minimum 3 years of experience working with children ages 4 - 8 years old in educational, afterschool, sports, or related settings.\n  Proven ability to employ a growth mindset and high-performance coaching strategies effectively.\n  Comfortable with and enthusiastic about using AI and other technologies in educational settings.\n  Legally able to work in the US without visa sponsorship\nNice to have\n  Certifications or advanced training in early childhood learning methodologies such as CDA, Montessori, or Reggio Emilia.\n  Experience in settings that emphasize personalized learning paths and the use of educational technology.\nYou will be working for Want to build better schools? Join the thriving community of Alpha. Alpha is a network   About Alpha Share this jobShareQuick linksFrequently asked questions"
  },
  {
    "jobTitle": "Guide",
    "jobDescriptionUrl": "https://www.crossover.com/jobs/4415/alpha/guide",
    "companyName": "Alpha",
    "salary": "$100,000 USD/year  ($50 USD/hour)",
    "jobID": "93bfbce7-96f5-4d75-85ff-dd8d27cf4224",
    "jobDescription": "DescriptionIMPORTANT NOTE: This is an in-person role available at multiple campus locations. Please review the Requirements section.\nAre you a champion in your field, accustomed to pushing limits and exceeding expectations? Imagine channeling that drive and determination into sparking a revolution in education. At Alpha Schools, we're not teaching; we're reimagining the educational landscape from the ground up. \nEducation is not about lectures or textbooks but unlocking potential and nurturing limitless growth. We're seeking high-performers like you—whether you've triumphed in athletics, excelled in debate, or led in your academic field—who are looking for a meaningful pivot in their career. This is your opportunity to apply your unique skills to inspire and lead the next generation.\nAt Alpha, you'll leverage your experience in achieving excellence to motivate students, helping them learn at their own pace and discover their passions. This role is about becoming a catalyst for change, showing students that with the right guidance, the possibilities are endless.\nYou've already proven you can rise to the top; now, help us lift others there. If you're ready to transform your drive for success into a force for educational innovation, Alpha is ready for you. Join us and turn your quest for personal achievement into a legacy of inspiring others to reach for the stars.\nWhy choose Alpha?\n\n  Competitive compensation and a comprehensive benefits package for all in-person employees.\n  Opportunities for growth and advancement; many of our Guides advance to leadership roles.\n  Relocation assistance for standout candidates.\n  Access to the best tech, curricular, and leadership resources.\n\nLet's revolutionize education together because, at Alpha, we know that the sky is not the limit.What you will be doing\n  Igniting curiosity and inspiring a limitless mindset in students through engaging, peer-level connections.\n  Utilizing AI and adaptive learning tools to personalize education, allowing students to progress at their own pace.\n  Fostering a culture of growth, learning, and ambition, guiding students to discover their strengths and interests.\n  Contributing to the continuous innovation and improvement of Alpha's educational model, sharing insights and ideas.\n  Leading impactful life skills workshops that prepare students for lifelong success\nWhat you will NOT be doing\n  Falling into the routine of traditional educational methods; no stuffy lectures or rigid lesson plans. You're neither a tutor nor a teaching assistant.\n  Overlooking the importance of personal growth and development within the educational journey.\n  Limiting students to conventional learning tools and methods, ignoring the power of technology and innovation.\nKey responsibilitiesYour mission is to deliver on Alpha's promises, helping students embrace a limitless mindset and fostering an environment where learning knows no bounds.Candidate requirements\n  Bachelor's degree in any subject\n  A proven track record of exceptional achievement and high performance, such as academic scholars (National Merit, Fulbright), competitive athletes (Division I, Olympians), competition champions (chess, debate, science fairs), or similar.\n  Strong public speaking skills, with a demonstrated ability to engage and energize audiences\n  A desire to connect, inspire, and motivate K-8th grade students\n  Legal right to work in the US without visa sponsorship\n  Willingness to work in-person in Austin, TX, Brownsville, TX, or Miami, FL\nYou will be working for Want to build better schools? Join the thriving community of Alpha. Alpha is a network   About Alpha Share this jobShareQuick linksFrequently asked questions"
  },
  {
    "jobTitle": "Guide",
    "jobDescriptionUrl": "https://www.crossover.com/jobs/5251/gt.school/guide",
    "companyName": "gt.school",
    "salary": "$100,000 USD/year  ($50 USD/hour)",
    "jobID": "8b63d222-e37b-4b01-8b66-4fc36e3d817d",
    "jobDescription": "DescriptionIMPORTANT NOTE: This is an in-person, full-time employee role at our Austin, TX campus. Relocation assistance is available.\nAre you an ultra-high achiever with a knack for guiding youth to unparalleled academic heights? At gt.school, we've crafted an environment where these bright young minds—future innovators, thinkers, and leaders—can flourish beyond the bounds of traditional education. \nWe're redefining education by empowering students to complete their high school curriculum by the end of their 8th-grade year. Powered by AI and adaptive learning technologies, our model accelerates learning 5 to 10 times faster than traditional methods. We are looking for coaches and mentors who see themselves in our students - those who not only achieved academic excellence but also understand the drive to accomplish more, sooner.\nAt gt.school, you will be the architect of our students' educational journey, leveraging our tech-enabled platform to create a learning experience as unique as each student. You'll help develop not just their academic prowess but their emotional intelligence, ensuring they become well-rounded individuals ready for any challenge. This is an opportunity to shape a new generation of limitless learners, to inspire them to reach their full potential well ahead of the traditional curve.\nAt gt.school, we're not just teaching; we're leading a revolution in education. If you're driven by the potential to make a significant impact on the future of learning, we want you on our team. Apply now to start shaping the journey of tomorrow's leaders today.What you will be doing\n  Coaching gifted & talented learners to set personalized learning goals, ensuring a balance between academic rigor and the development of life skills such as resilience and grit.\n  Leveraging state-of-the-art AI tools to track progress, tailor learning experiences, and ensure each student reaches their full potential at an accelerated pace.\n  Engaging with students to motivate, inspire, and guide them through their accelerated learning journey, fostering a supportive and dynamic learning environment.\n  Collaborating with a team dedicated to reimagining education for gifted and talented students, sharing insights and strategies to enhance our collective mission.\nWhat you will NOT be doing\n  Following a one-size-fits-all approach to education.\n  Spending your day in traditional classroom management or disciplinary roles.\n  Operating within the constraints of traditional educational pacing and curriculums.\nKey responsibilitiesYour primary role is to inspire, mentor, and guide gifted and talented learners, enabling them to complete their high school education by the end of their 8th-grade year through a personalized, innovative, and accelerated learning pathway.Candidate requirements\n  Demonstrated history of academic excellence, such as being a National Merit or Presidential Scholar recipient, placing in academic Olympiads, earning a prestigious academic scholarship, being a dual-enrolled student, etc.\n  Experience in mentoring, coaching, or teaching roles\n  Proficiency in using generative AI for personal or professional purposes\n  Excellent communication and public speaking skills\n  Legal right to work in the U.S. without visa sponsorship\n  Willing to work in-person in Austin, TX\nYou will be working for GT School is an EdTech Startup that leverages technology, AI, and subject matter expert  About gt.school Share this jobShareQuick linksFrequently asked questions"
  },
  {
    "jobTitle": "Motivational Designer - Education",
    "jobDescriptionUrl": "https://www.crossover.com/jobs/5192/trilogy/motivational-designer---education",
    "companyName": "Trilogy",
    "salary": "$100,000 USD/year  ($50 USD/hour)",
    "jobID": "3fc44ef2-d9f4-4190-9545-465ea3429e0c",
    "jobDescription": "DescriptionHave you read the key texts in motivational psychology and gamification, wondering how this knowledge can change the future of education? Trilogy is dedicated to maximizing learning outcomes across its diverse EdTech portfolio, and we're searching for a strategist who can combine the science of engagement with a passion for AI.\nWho you are:\n\n  You view engagement through a lens of human behavior and psyche.\n  You read Yu-kai Chou's \"Actionable Gamification\" and see a blueprint, not just a book.\n  You embraced the AI revolution with both hands and routinely use LLMs to accomplish professional and private tasks.\n\nIn this role, you'll leverage your deep understanding of leading scientific theories like the Octalysis Framework and the ARCS Model to analyze and enhance engagement across our EdTech learning products, such as the 2-Hour Learning program.\nYour experience with prompting LLMs will allow you to identify areas in our learning ecosystem where students need an engagement boost. Then, adopting an AI-first approach, you will develop motivational programs, frameworks, or promotions to improve student engagement and learning outcomes. Think of all the techniques that your favorite mobile app utilizes: leaderboards, team competitions, rewards, streaks, and badges.\nAt Trilogy, you'll join a team that values creativity and innovation in education. Your role is crucial in advancing our mission to transform how students learn, engage, and succeed. If you're passionate about making a real difference in how students interact with learning and have the skills and experience to back it up, then we want to hear from you.What you will be doing\n  Analyzing student data to identify areas of low engagement and motivational shortcomings in our users' learning journey.\n  Designing innovative programs, frameworks, promotions, and competitions to boost student engagement in our learning ecosystem.\n  Leveraging LLMs to improve every aspect of your job and continue building expertise in driving student engagement and motivation.\nWhat you will NOT be doing\n  Re-designing learning curricula; this role is about improving engagement within our existing learning framework.\n  Writing code; you will focus on the design aspects of the engagement programs and the practical implications of running it while our engineers will provide the technical framework.\nKey responsibilitiesMaximizing student engagement and learning progression in Trilogy’s growing ecosystem of EdTech products.Candidate requirements\n  Experience designing, building, and running motivational programs OR developing mechanisms that use gamification to drive user engagement\n  Practical knowledge of scientific motivational models and theories, such as Yu-kai Chou's Octalysis Framework\n  Proficiency in using AI and LLMs to enhance work productivity\nYou will be working for Hundreds of software businesses run on the Trilogy Business Platform. For three decades  About Trilogy Share this jobShareQuick linksFrequently asked questions"
  },
  {
    "jobTitle": "AI-Driven Learning Strategist",
    "jobDescriptionUrl": "https://www.crossover.com/jobs/5238/trilogy/ai-driven-learning-strategist",
    "companyName": "Trilogy",
    "salary": "$100,000 USD/year  ($50 USD/hour)",
    "jobID": "e44ae951-694b-47c6-8657-7ceda7f530fd",
    "jobDescription": "DescriptionAre you up-to-date on all the ways AI can revolutionize education? Imagine employing state-of-the-art technology to unlock learning that's more personalized, impactful, and accessible to students. If you have an analytical mind and are passionate about harnessing AI to tackle real-world educational challenges, come see how we’re making it happen.\nAt Trilogy, we're committed to fast-tracking innovation by fusing the latest AI advancements with educational science and human psychology, unlocking unparalleled academic potential. In this role, you will maximize the utility of AI tools to dissect and rebuild the educational experience from the ground up, ensuring every student benefits from truly tailored learning.\nEngaging deeply with platforms like Quicksight and StudyReel, for example, you'll systematically analyze student performance data and derive actionable insights. The learning opportunities you identify will guide the selection and integration of educational apps and lesson plans. You’ll leverage the latest AI tools and methodologies to develop personalized learning strategies, directly impacting key metrics such as engagement time, lesson comprehension, and test scores.\nYour work at Trilogy will directly contribute to setting new standards for academic excellence. Apply now and join us in creating a landscape where every student has the tools and opportunities to reach their fullest potential!What you will be doing\n  Diving deep into performance data to unveil learning gaps, engagement levels, and the effectiveness of current educational tools and content.\n  Identifying and integrating cutting-edge educational apps, lesson plans, and tests based on data-driven insights to enhance academic outcomes.\n  Harnessing AI and learning science to develop a personalized knowledge base and improve educational strategies in a specific subject.\nWhat you will NOT be doing\n  Making decisions based on intuition; instead, you'll immerse yourself in comprehensive data analysis of student session data, direct student feedback, and other key metrics.\n  Isolating yourself in theoretical research; instead, you'll go into “student mode”, taking tests, engaging with apps, and evaluating educational content hands-on.\n  Using AI as a buzzword; instead, you’ll get hands-on integrating AI into education to innovate and refine learning strategies, making each educational experience unique and impactful.\nKey responsibilitiesMaximize student engagement and academic outcomes by analyzing success metrics, evaluating learning tools, and integrating the latest AI technologies.Candidate requirements\n  A university degree in any field (preferably in Education, Psychology, or related fields demonstrating a foundational understanding of learning theories, behavioral principles, etc.)\n  3+ years of experience in an EdTech, corporate learning & development, or academic role, with responsibilities such as curriculum development, educational data analysis, digital tool integration, or developing corporate training solutions.\n  Practice experience experimenting with Generative AI tools (such as ChatGPT, Claude, or Gemini) to gain knowledge of prompting techniques and best practices.\n  Ability to write simple scripts in any programming language.\nYou will be working for Hundreds of software businesses run on the Trilogy Business Platform. For three decades  About Trilogy Share this jobShareQuick linksFrequently asked questions"
  },
  {
    "jobTitle": "AI-First Educational Test Content Creator",
    "jobDescriptionUrl": "https://www.crossover.com/jobs/5159/trilogy/ai-first-educational-test-content-creator",
    "companyName": "Trilogy",
    "salary": "$100,000 USD/year  ($50 USD/hour)",
    "jobID": "0d689929-8516-4567-82c0-70f8ca572a15",
    "jobDescription": "DescriptionIs translating educational theories into actionable assessments your superpower? Do you thrive in environments where excellence is the norm, dissecting and designing with a level of precision that only the keenest eye can achieve?\nWe're scouting for an expert in psychometrics with a flair for distilling complex educational measurements into clear, effective tests to sculpt revolutionary educational experiences. Think you have checked all the right boxes so far? Then this is your opportunity to shine.\nAt Trilogy, we're not just tinkering with the idea of AI in education; we're orchestrating a full-blown transformation. Scrap the old playbook of manual test creation. Textbooks? Obsolete. In this role, you will wield the power of generative AI to design prompts that delve deep into the subject matter, commanding it to produce test content that's personalized, engaging, and rigorous.\nYour experience in quantitative measurement and educational content creation will help you synthesize complex frameworks into AI prompts, yielding razor-sharp test questions that align tightly with educational standards. You will then quality control your outputs by crafting AI-first rubrics, ensuring each question and answer hits the mark and stimulates curiosity, enriching the learning journey. It's all about a relentless pursuit of excellence, a continuous cycle of refinement, and a dedication to content that not only meets but exceeds the bar.\nIf you're seeking a role where you can blend creativity with technology and where your contributions have a lasting impact, Trilogy is where you belong. Take the leap and apply now!What you will be doing\n  Creating and refining test content to meet rigorous educational standards, using a blend of psychometrics and generative AI tools\n  Developing assessment rubrics with the help of AI that evaluate the depth, alignment, and educational impact of the test content\n  Enhancing the quality of test content through a streamlined, iterative process for consistently superior and challenging assessments\nWhat you will NOT be doing\n  Creating test content manually – you will be using generative AI tools (such as ChatGPT, Gemini, Claude etc.) for every task\n  Developing code to automate systems - you will focus on test design using AI, while our engineers handle the tech specifics\nKey responsibilitiesApplying your psychometric expertise to develop and refine test content with the help of AI, ensuring the assessments are personalized, rigorous, and aligned with educational standardsCandidate requirements\n  Bachelor's degree or higher with a focus on psychometrics, educational measurement and statistics, OR at least 3 years of experience creating content for standardized tests (SAT, ACT, etc.) within an edtech environment\n  Basic familiarity with and an eagerness to rapidly master AI tools and their application in test content development\n  A user-centric approach and the ability to critically evaluate content in terms of appropriateness, accuracy, and relevance\nYou will be working for Hundreds of software businesses run on the Trilogy Business Platform. For three decades  About Trilogy Share this jobShareQuick linksFrequently asked questions"
  },
  {
    "jobTitle": "Web Development Instructor",
    "jobDescriptionUrl": "https://www.crossover.com/jobs/4696/bloomtech/web-development-instructor",
    "companyName": "BloomTech, Part-time",
    "salary": "$30,000 USD/year  ($30 USD/hour)",
    "jobID": "2223c0f7-c4fa-4e1e-acdd-22dec3d7579e",
    "jobDescription": "DescriptionAre you a seasoned full-stack web developer eager to share your expertise? BloomTech is looking for enthusiastic Web Development professionals to join our mission-driven team as part-time instructors. This role offers the unique chance to shape the careers of aspiring developers while working remotely from any location.\nAt BloomTech, we are dedicated to transforming lives through education. Our immersive, live, online classes are designed to equip students with essential technical and soft skills. We stand by our commitment to student success, which is why students don’t pay tuition until they land a job.\nWe are passionate about fostering diversity and inclusivity. We aim to build a team where everyone feels respected and valued. We welcome applications from individuals of all backgrounds who can contribute to our vibrant community.\nDue to employment regulations, BloomTech can only accept applicants from specific countries with defined educational or professional qualifications. This ensures we comply with local laws and maintain high educational standards. Please check the Candidate Requirements section to ensure you meet the criteria.\nEager to inspire and educate future web developers? Seize this opportunity to join BloomTech's innovative education team. Apply now and be a catalyst for change in tech education!What you will be doing\n  Conducting live, interactive coding sessions via Zoom, simplifying complex Java concepts with real-life examples, and engaging storytelling.\n  Supporting and mentoring students, fostering an inclusive and encouraging learning environment.\n  Providing constructive feedback on the curriculum and monitoring student progress.\n  Spending 10 hours per week teaching live classes and coaching students.\nWhat you will NOT be doing\n  Managing other instructors or teaching assistants.\n  Engaging in routine tutoring; your professional expertise will be leveraged to teach practical, real-world skills.\n  Traveling for conferences or meetings, as we operate fully remotely.\nKey responsibilitiesPass on your technical expertise to build junior web developers ready to start new careers.Candidate requirements\n  One of the following combinations of education and industry experience:\n    \n      A Bachelor's degree + 3 years of software industry experience\n      A coding boot camp certificate that required at least 900 hours + 4 years of software industry experience\n      A high school diploma/GED + 5 years of software industry experience\n    \n  \n  Proficient in HTML, CSS, JavaScript, React, Redux, and HTTP/Ajax\n  Familiarity with web servers (Node.js or RDBMS) and Node.js Web APIs\n  Strong presentation and communication skills\n  Ability to clearly explain technical concepts to beginners\n  Available to teach live coding classes from 2pm - 4pm PST (21:00 - 23:00 UTC)\n  Reside in one of the following countries: Bulgaria, Colombia, Costa Rica, Czech Republic, Ecuador, Egypt, Guatemala, Honduras, Hungary, India, Ireland (Republic of), Mexico, Nicaragua, Pakistan, Panama, Paraguay, Peru, Poland, Romania, Serbia, Slovakia, Slovenia, South Africa, Turkey, United Arab Emirates, Uruguay, Venezuela.\nNice to have\n  Experience teaching or mentoring\nYou will be working for Bloom Institute of Technology (BloomTech) is pioneering a new model of accessible highe  About Company Share this jobShareQuick linksFrequently asked questions"
  },
  {
    "jobTitle": "Associate Guide - Brownsville",
    "jobDescriptionUrl": "https://www.crossover.com/jobs/5080/alpha/associate-guide---brownsville",
    "companyName": "Alpha",
    "salary": "$60,000 USD/year  ($30 USD/hour)",
    "jobID": "4db706f4-7434-42ce-87ee-07f9dba40ab6",
    "jobDescription": "DescriptionIMPORTANT NOTE: This is an in-person role at our Brownsville, TX campus. Relocation assistance is available.\nAre you tired of the same old snooze-fest in the classroom? Do you dream of shaking up the world of education and making it way more exciting? Well, guess what? We're on a mission to revolutionize learning, and we need your help to make it happen!\nWe're on the hunt for dynamic minds who can bring a fresh perspective to education. If you're a trailblazer with a burning desire to break free from the norm, then listen up! Our startup is searching for game-changers like you, who can turn the traditional teaching methods upside down and inside out.\nAlpha School is anything but ordinary. We've created an innovative learning environment that encourages exploration, creativity, and self-paced growth. Our Brownsville campus (BTX) is located near SpaceX and attracts a diverse group of K-8 students. You'll have the chance to connect with students on a peer level, inspiring them to discover their full potential and develop a lifelong love for learning.\nWhy choose Alpha?\n\n  Competitive pay - we believe you shouldn't take a pay cut to work in education\n  Generous benefits and time off - we value our team and offer a comprehensive benefits package and paid time off\n  Growth and learning culture - we model the growth & learning we expect our students to embrace, so you'll receive coaching, training, and opportunities for leadership\n\nIf you're a skilled relationship-builder who thrives in a startup environment, join Alpha BTX as we set our sights on new frontiers!What you will be doing\n  Live workshops: One-hour sessions with K-8th grade students, coaching them on valuable life skills like public speaking, focus, and giving and receiving feedback\n  Motivation sessions: Encouraging students to advance in their academic apps and achieve their learning goals\nWhat you will NOT be doing\n  Teaching or tutoring. Students learn solely from self-guided, adaptive learning apps.\n  Leading traditional lectures that students find boring or lack interaction.\n  Pushing kids to the point of burnout or disengagement.\nKey responsibilitiesFollow our time-tested playbooks to ensure that:\n\n  100% of students achieve their academic goals\n  100% of students master core life skills, as measured by real-world challenges\n  100% of students love school\nCandidate requirements\n  Willingness to work in-person in Brownsville, TX\n  College degree in any subject\n  Desire to spend your day motivating and coaching K-8 students\n  Available to work 10 am - 6 pm weekdays\n  Legal right to work in the US without visa sponsorship\nYou will be working for Want to build better schools? Join the thriving community of Alpha. Alpha is a network   About Alpha Share this jobShareQuick linksFrequently asked questions"
  },
  {
    "jobTitle": "AI Innovation Specialist",
    "jobDescriptionUrl": "https://www.crossover.com/jobs/5105/trilogy/ai-innovation-specialist",
    "companyName": "Trilogy",
    "salary": "$60,000 USD/year  ($30 USD/hour)",
    "jobID": "8a418c45-ea7c-4c55-b5e3-90bb0c4c6601",
    "jobDescription": "DescriptionReady to leverage your mastery of LLMs to drive productivity? At Trilogy, we're opening doors to an exceptional tech career, welcoming those who've honed their AI skills to elevate their expertise in a dynamic environment. We're offering a rare chance where your primary focus will be to further expand your proficiency in LLMs.\nIn an industry often filled with more buzzwords than tangible progress, Trilogy stands out as a hub of genuine innovation. Our focus is on practical, real-world applications aimed at reshaping industries. Imagine creating AI-driven tools that streamline workflow, automate tasks, or enhance decision-making processes, all to significantly boost productivity.\nYour mandate? Harnessing LLMs to revolutionize how businesses operate, improving efficiency and effectiveness. You'll be architecting solutions that integrate AI seamlessly, making intricate processes more accessible and refining workflows for maximum output. Here, you won't be lost in bureaucratic hurdles or pitching ideas into the void. Instead, you'll witness the direct impact of your efforts, as your work directly influences the evolution of productivity tools.\nReady to unleash your expertise and become a force of change? Let's explore if you're the catalyst we're seeking for this exciting opportunity!What you will be doing\n  Rapidly advancing your AI expertise through specialized training and applying this knowledge to create autonomous, AI-driven platforms and tools\n  Experimenting with state-of-the-art AI tools like GPT-4 Vision and Amazon CodeWhisperer, integrating them into our developmental process to assess and enhance their utility\n  Evaluating and optimizing the implementation of AI solutions across various infrastructures, including AWS, to ensure seamless performance and integration\nWhat you will NOT be doing\n  Traditional coding - our AI does the heavy lifting, freeing you to innovate and strategize\n  Being stuck on repetitive tasks - no two problems are the same\nKey responsibilitiesArchitecting and deploying sophisticated, fully-automated AI systems that require zero human intervention for a truly scalable impactCandidate requirements\n  Professional experience leveraging LLMs, such as ChatGPT, Bing, Bard, or Claude, to automate manual tasks and boost your company's productivity\n  Proficiency in Python and API integration\nYou will be working for Hundreds of software businesses run on the Trilogy Business Platform. For three decades  About Trilogy Share this jobShareQuick linksFrequently asked questions"
  },
  {
    "jobTitle": "AI-First Product Manager",
    "jobDescriptionUrl": "https://www.crossover.com/jobs/5280/trilogy/ai-first-product-manager",
    "companyName": "Trilogy",
    "salary": "$60,000 USD/year  ($30 USD/hour)",
    "jobID": "5dfbf1cc-a6f7-443b-a48c-5a002b66a77f",
    "jobDescription": "DescriptionThe education industry is facing unprecedented challenges, with traditional methods failing to meet the evolving needs of students. Many students feel disengaged in traditional classroom settings, and there's a growing demand for personalized, technology-driven learning solutions.\nTrilogy is pioneering AI-education integration by creating fully automated, customer-facing solutions that transform the traditional learning experience. Our approach is not just about deploying the latest technology—it's about understanding and addressing the unique challenges of each student.\nYou might, for example, lead the development of an AI-powered chat interface for students, where a virtual learning assistant can answer any question, provide personalized feedback, and even analyze student sentiment to identify areas needing not just academic but emotional support.\nThis role is perfect for you if:\n\n  You're a product whiz passionate about building things people love; you have a proven track record of transforming user needs into successful products.\n  You speak fluent AI; you understand the potential of Large Language Models (LLMs) and can translate that potential into practical applications for students.\n  Communication is your superpower; you can break down complex concepts into easy-to-understand language and inspire buy-in from both technical and non-technical stakeholders.\n\nThis is not your typical product manager role (i.e., getting dragged into endless meetings, disconnected from the hands-on creation process). We expect you to be a self-starter who thrives in a dynamic environment. You will drive projects from conception to execution. You will get your hands dirty with coding and cutting-edge AI, working closely with other teams to integrate these technologies seamlessly into user-friendly, client-facing educational tools.\nIf you are a product visionary with a blend of technical expertise and strong customer communication skills, apply now and start transforming education for good!What you will be doing\n  Conduct customer interviews to gather detailed requirements, analyze feedback, and document product requirements to ensure alignment with user needs and expectations.\n  Integrate AI technologies into customer-facing products, manage the development process from concept to launch, and prototype AI-driven features.\n  Present products and features to stakeholders to gather feedback and ensure high levels of customer satisfaction.\nWhat you will NOT be doing\n  You won’t be creating or managing intricate database specifications or complex backend infrastructures.\n  This role does not involve developing advanced AI models from scratch; instead, you'll be integrating existing AI technologies.\nKey responsibilitiesLead the development of fully-automated, customer-facing, AI-driven learning products that offer top-tier user experience and customer satisfaction.Candidate requirements\n  At least 2 years of experience in technical product management, overseeing the lifecycle of customer-facing products from concept through prototyping to launch.\n  Professional experience leveraging LLMs (such as ChatGPT, Copilot, Gemini, or Claude) to enhance and automate day-to-day product management or development tasks.\n  Proficiency in Python and API integration.\n  Experience in conducting customer interviews, gathering requirements, and presenting solutions directly to customers and stakeholders.\nYou will be working for Hundreds of software businesses run on the Trilogy Business Platform. For three decades  About Trilogy Share this jobShareQuick linksFrequently asked questions"
  }
]