[
  {
    "jobTitle": "Freelance Writer",
    "jobDescriptionUrl": "https://himalayas.app/companies/iapwe/jobs/freelance-writer",
    "companyName": "IAPWE",
    "jobID": "abc5a985-15ca-4211-8fcf-f2aed1f7487f",
    "jobDescription": "Our organization is seeking content writers to create articles and blog posts on a variety of topics.The rate of pay is $20 per 100 words (this comes out to approximately $100 per article or $50 per hour).Some topics you may be asked to write about include the following (you can always turn down a topic if you do not feel comfortable writing about it, however if you have experience or expertise in a specific area, please let us know):Health & beautyFitnessHome DecorFashionSportsDo it yourselfFinanceLegalMedicalFamily/ParentingRelationshipsReal EstateRestaurantsContracting (plumbing, pool building, remodeling, etc.)These are just some of the more general industries and topics that we cover.Requirements:We ask that all work be completed using a word processor such as Microsoft Word or Open OfficeA reliable internet connection and the ability to meet deadlinesGood communication skills and respond in a timely manner to editorial staff when they ask for updates on tasks, etcWork well as a team member with the rest of our content management and editorial staffElevate your applicationLet our AI craft your perfect cover letter and align your resume to this job's criteria.Optimize my resumeCraft my cover letterBy using our AI tools, you consent to sharing your profile with our AI partner for this purpose.Elevate your applicationLet our AI craft your perfect cover letter and align your resume to this job's criteria.By using our AI tools, you consent to sharing your profile with our AI partner for this purpose.Optimize my resumeCraft my cover letterApply nowJob expired?Please let IAPWE know you found this job on Himalayas. This helps us grow!Apply nowApply nowJob expired?Please let IAPWE know you found this job on Himalayas. This helps us grow!Apply nowAbout the jobApply beforeJul 20, 2024Posted onJun 20, 2024Job typeContractorExperience levelMid-levelSalarySalary: 40k-60k USDLocation requirementsSuggest an editOpen to candidates from all countries.Hiring timezonesShow UTC offsetsWorldwideJob categoriesWriterSkillsWritingAbout IAPWELearn more about IAPWE and their company culture.View company profileThe IAPWE or International Association of Professional Writers & Editors is an organization dedicated to providing helpful resources to writers and editors and disseminating helpful ideas and resources across the greater professional community in the form of outreach, blogging, networking and thought leadership.In addition to providing free resources for our members, we are always seeking talented writers and editors to help create engaging, locally relevant, educational and inspirational content to help support our outreach efforts. We believe in paying our writers and editors a competitive wage, unlike many of the “content mills” and comparable low-paying clients and/or companies.The IAPWE is also dedicated to bringing the most updated, legitimate and vetted writing and editing job opportunities to its members.Currently, there are many different websites containing both legitimate as well as illegitimate writing and editing job opportunities and we make available, in one place, all of the opportunities that have been determined to be legitimate across over 100 different websites.In addition to this, the IAPWE provides helpful tools, resources and networking opportunities for professional writers and editors, as well as making all members aware of potential writing job scams.We are currently seeking members to take on administrative roles to help us identify and verify additional writing and editing job opportunities for our members. If interested, please send an email to staffing@iapwe.org for more information.Tech stackLearn about the tools and technologies that IAPWE uses to build, market, and sell its products.View tech stackJavaScriptHTML5CSS 3Google Tag ManagerFont AwesomeGoogle FontsGoogle AnalyticsModernizrGoogle MapsGoogle reCaptchaWordPress3 moreIAPWE employees can create an account to update this tech stack.HimalayasRemote companiesIAPWEFreelance WriterApply nowJob expired?Please let IAPWE know you found this job on Himalayas. This helps us grow!Apply nowElevate your applicationLet our AI craft your perfect cover letter and align your resume to this job's criteria.Optimize my resumeCraft my cover letterBy using our AI tools, you consent to sharing your profile with our AI partner for this purpose.About the jobApply beforeJul 20, 2024Posted onJun 20, 2024Job typeContractorExperience levelMid-levelSalarySalary: 40k-60k USDLocation requirementsSuggest an editOpen to candidates from all countries.Hiring timezonesShow UTC offsetsWorldwideJob categoriesWriterSkillsWritingClaim this profileIAIAPWECompany size1-10Founded in2015MarketsWritingEmployees live inUnited StatesSocial mediaIAPWE's TwitterIAPWE's FacebookView company profileVisit iapwe.org"
  },
  {
    "jobTitle": "Sales Executive",
    "jobDescriptionUrl": "https://himalayas.app/companies/alienz/jobs/sales-executive",
    "companyName": "Alienz",
    "jobID": "eaa80ba0-8f22-4e22-92b1-4e2c9682549b",
    "jobDescription": "Require a Persian/English speaking staff. • Responsible for securing new customers, and maintaining and developing existing accounts.• Meet and exceed target set in terms of contributing and generating revenue for the department.• Conduct and report minimum number of sales leads set by the management and transform a minimum of those into revenue generating business.• Maintain records of customer details / sales visits in the Orient.• Identify potential customers and register opportunities in Orient; relentlessly pursue realization of such opportunities leading to revenue for the company.• Regularly visit existing accounts validating our service levels and develop new revenue streams.• Negotiate with the accounts as per price guidelines given, looking to maximize profits.• Follow up on customer communications in a timely and professional manner.• Support Customer Service and work closely with Operations and Documentation on the execution of customer service contracts.• Promote the services and products of all entities, and coordinate sales efforts with other department sales.• Assimilate market information and take part in the overall business development through weekly / monthly sales meetings.• Follow up with clients for out standing supported by the Finance Controller.Elevate your applicationLet our AI craft your perfect cover letter and align your resume to this job's criteria.Optimize my resumeCraft my cover letterBy using our AI tools, you consent to sharing your profile with our AI partner for this purpose.Elevate your applicationLet our AI craft your perfect cover letter and align your resume to this job's criteria.By using our AI tools, you consent to sharing your profile with our AI partner for this purpose.Optimize my resumeCraft my cover letterApply nowJob expired?Please let Alienz know you found this job on Himalayas. This helps us grow!Apply nowApply nowJob expired?Please let Alienz know you found this job on Himalayas. This helps us grow!Apply nowAbout the jobApply beforeJul 20, 2024Posted onJun 20, 2024Job typeFull TimeExperience levelMid-levelSalarySalary: 1k-2k USDLocation requirementsSuggest an editIranHiring timezonesShow UTC offsetsIran Standard Time +/- 0 hoursJob categoriesSales ExecutiveSales Account ExecutiveSales Business Development ExecutiveSales RepresentativeSalespersonSales ManagerSales DirectorClient Sales ExecutiveSales ConsultantSkillsSalesCustomer ServiceAccount ManagementRevenueNegotiationBusiness DevelopmentCustomer CommunicationsContractsSales ManagementTimely Follow UpsAbout AlienzLearn more about Alienz and their company culture.View company profileHey!  Ever faced with complex shipping or transportation needs? Alienz, a 5PL and logistics expert, has got your back. We handle tough, project cargos and navigate tricky approvals and customs.   Our services shine in war zone countries with RORO and GCC, Iran, Iraq, Libya and Yemen with 5PL. Think your business could benefit from streamlined logistics?   Let's turn your challenges into opportunities. Share your enquiries today.HimalayasRemote companiesAlienzSales ExecutiveApply nowJob expired?Please let Alienz know you found this job on Himalayas. This helps us grow!Apply nowElevate your applicationLet our AI craft your perfect cover letter and align your resume to this job's criteria.Optimize my resumeCraft my cover letterBy using our AI tools, you consent to sharing your profile with our AI partner for this purpose.About the jobApply beforeJul 20, 2024Posted onJun 20, 2024Job typeFull TimeExperience levelMid-levelSalarySalary: 1k-2k USDLocation requirementsSuggest an editIranHiring timezonesShow UTC offsetsIran Standard Time +/- 0 hoursJob categoriesSales ExecutiveSales Account ExecutiveSales Business Development ExecutiveSales RepresentativeSalespersonSales ManagerSales DirectorClient Sales ExecutiveSales ConsultantSkillsSalesCustomer ServiceAccount ManagementRevenueNegotiationBusiness DevelopmentCustomer CommunicationsContractsSales ManagementTimely Follow UpsClaim this profileALAlienzCompany size51-200Founded in2013Markets5PLLogisticsShippingTransportationProject CargoCustoms BrokerageSupply Chain ManagementWar Zone LogisticsRORO (Roll On Roll Off)Middle Eastern LogisticsEmployees live inUnited Arab EmiratesPakistanOmanLibyaSaudi ArabiaBahrainKuwaitQatarIraqTurkeyRussian FederationSudanSomaliaAfghanistanNigeriaYemenAlgeriaLebanonSocial mediaAlienz's FacebookAlienz's LinkedInView company profileVisit alienz-group.com"
  },
  {
    "jobTitle": "Facilities Manager",
    "jobDescriptionUrl": "https://himalayas.app/companies/podium/jobs/facilities-manager",
    "companyName": "Podium",
    "jobID": "87eba4b6-3aa8-431d-8823-346607353eeb",
    "jobDescription": "At Podium, our mission is to help local businesses win. Our lead conversion platform, powered by AI and integrations, helps local businesses convert leads faster, communicate easier, and make more sales. Every day, thousands of local businesses utilize our review management, communication, marketing, and payments products. Our work and focus on helping local businesses thrive has been recognized across the industry, including Forbes’ Next Billion Dollar Startups, Forbes’ Cloud 100, the Inc. 5000, and Fast Company’s World’s Most Innovative Companies.At Podium, we believe in fostering a culture that thrives on hiring and developing exceptional talent. Our operating principles serve as a compass, guiding daily behavior and decision-making, and ensure we hire people who will thrive at Podium. If you resonate with our operating principles and are energized by our mission, Podium will be a great place for you!At Podium, creating an exceptional work environment is integral to our team members’ experience. The Facilities Manager plays a crucial role in ensuring a safe, efficient, and wonderful working environment. This position oversees daily facility operations at our headquarters in Lehi, Utah. Responsibilities include planning, budgeting, and scheduling facility modifications, managing office operations, and coordinating with various contractors and vendors. The role is onsite at our HQ in Lehi, Utah - 5 days a week. What you will be doing:Plan and oversee contractor work to ensure accuracy and timeliness of projects.Supervise maintenance of facilities including HVAC, plumbing, electrical, security, and AV systems.Conduct facility service reviews, audits, and implement corrective actions as neededDirect and schedule projects to ensure they are completed on time and within budget, including scope development, bid management, contract coordination, and procurement.Manage all catering vendorsEnsure compliance with security policies and proceduresDevelop and implement emergency preparedness plans and manage building emergenciesOversee space planning, manage office moves, renovations, and facility equipment installationsCoordinate and setup resources for team member office events, town hall meetings on and off site, marketing events, and other company related eventsManage facility vendors and building personnelOversees the cleaning and maintenance of the facilityDevelop and manage site budget, responsible for controlling operating expenses within budgetary guidelines and makes recommendations for cost effective reductionsManage, mentor and develop Facilities staffEngage, contract, supervise and approve invoices for all goods/services required to maintain the properties up to company and owner standardsWhat you should have:Bachelor’s or Associate’s degree with technical training in facilities managementMinimum of 3+ years of experience in facilities or corporate services managementFacility Management Professional (FMP) or Certified Facility Manager (CFM) credential strongly preferredUnderstanding of general accounting practices and processesStrong organization skills with the ability to prioritize and multi-taskProactive problem-solving skills and initiativeKnowledge of facilities management, furniture, space planning and building systemsService-oriented with excellent oral and written communication skillsSelf-motivated team leader with strategic planning and budgeting experienceAbility to develop relationships and influence stakeholdersDetail oriented and results drivenBenefitsOpen and transparent culture Life insurance, long and short-term disability coveragePaid maternity and paternity leaveFertility BenefitsGenerous vacation time, plus three 4-day summer holiday weekendsExcellent medical, dental, and vision benefits401k Plan with competitive company matchingBi-annual swag drops with cool Podium gear and apparel A stellar HQ (Utah) gym with local professional coaches and classes offeredOnsite HQ (Utah) child care center, subsidized for employeesAdditional benefits for fully remote employeesPodium is an equal opportunity employer. Podium provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, gender, national origin, sexual orientation, gender identity or expression, age, disability, genetic information, marital status or veteran status.Elevate your applicationLet our AI craft your perfect cover letter and align your resume to this job's criteria.Optimize my resumeCraft my cover letterBy using our AI tools, you consent to sharing your profile with our AI partner for this purpose.Elevate your applicationLet our AI craft your perfect cover letter and align your resume to this job's criteria.By using our AI tools, you consent to sharing your profile with our AI partner for this purpose.Optimize my resumeCraft my cover letterApply nowJob expired?Please let Podium know you found this job on Himalayas. This helps us grow!Apply nowApply nowJob expired?Please let Podium know you found this job on Himalayas. This helps us grow!Apply nowAbout the jobApply beforeSep 01, 2024Posted onJul 03, 2024Job typeFull TimeExperience levelManagerLocation requirementsSuggest an editUnited StatesHiring timezonesShow UTC offsetsUnited States +/- 0 hoursJob categoriesInfrastructure ManagerProperty ManagerReal Estate ManagerOperations ManagerFleet ManagerSkillsFacilities ManagementPlumbingElectrical SystemsSecurity SystemsAI SystemsBudgetingVendor ManagementPlanningPersonnel ManagementProcurementAccountingWritten CommunicationCommunication SkillsStrategic PlanningSystemsAuditAbout PodiumLearn more about Podium and their company culture.View company profilePodium is a suite of messaging tools for local business. Using our platform, businesses of all sizes can connect with customers via text to do things like request payments, collect reviews, and sell products, in a modern, convenient way. Our work streamlining this process for local businesses has awarded us recognition on top industry lists, such as Forbes’ Next Billion Dollar Startups, Forbes’ Cloud 100, the Inc. 5000 (#13), and Fast Company’s World’s Most Innovative Companies — in the last year alone. For more about our product, watch this video. Podium has a positive, diverse, and supportive culture and was recently named one of Inc. Magazine’s Best Workplaces for 2019. We look for people who are curious, creative and work to be a little better every day. In our work together we embody our values: Be a founder, Murder drama, and Enjoy the ride.Tech stackLearn about the tools and technologies that Podium uses to build, market, and sell its products.View tech stackReact NativeRuby on RailsJavaScriptPythonHTML5JavaCSS 3RubyKotlinSwiftObjective-C30 morePodium employees can create an account to update this tech stack.Employee benefitsLearn about the employee benefits and perks provided at Podium.View benefitsHome office budgetYearly home office upgrade stipendPaid parental leavePaid maternity and paternity leaveHealthcare benefitsGreat medical, dental, vision benefitsDisability insuranceLong and short-term disability coverageView Podium's employee benefitsHimalayasRemote companiesPodiumFacilities ManagerApply nowJob expired?Please let Podium know you found this job on Himalayas. This helps us grow!Apply nowElevate your applicationLet our AI craft your perfect cover letter and align your resume to this job's criteria.Optimize my resumeCraft my cover letterBy using our AI tools, you consent to sharing your profile with our AI partner for this purpose.About the jobApply beforeSep 01, 2024Posted onJul 03, 2024Job typeFull TimeExperience levelManagerLocation requirementsSuggest an editUnited StatesHiring timezonesShow UTC offsetsUnited States +/- 0 hoursJob categoriesInfrastructure ManagerProperty ManagerReal Estate ManagerOperations ManagerFleet ManagerSkillsFacilities ManagementPlumbingElectrical SystemsSecurity SystemsAI SystemsBudgetingVendor ManagementPlanningPersonnel ManagementProcurementAccountingWritten CommunicationCommunication SkillsStrategic PlanningSystemsAuditClaim this profilePOPodiumCompany size501-1000Founded in2014Chief executive officerEric ReaMarketsSaaSReputation ManagementCustomer EngagementMessagingEmployees live inUnited StatesAustraliaBrazilSocial mediaPodium's TwitterPodium's FacebookPodium's LinkedInView company profileVisit podium.com"
  },
  {
    "jobTitle": "Associate Contracts Attorney",
    "jobDescriptionUrl": "https://himalayas.app/companies/henry-meds/jobs/associate-contracts-attorney",
    "companyName": "Henry Meds",
    "jobID": "e240ac5d-fa7b-4f2a-bcc2-850fec0eb21c",
    "jobDescription": "About Henry Meds:Tens of millions of Americans are unable to manage their chronic conditions with commercial medications. Using specialized compounded formulas tailored to individual patient needs, Henry helps people who have been left behind by the commercial market, all while remaining easy, accessible, and affordable. Our customers get access to the care they need, and save thousands of dollars on out-of-pocket healthcare expenses per year!Enjoy the casual culture, remote-first workplace, and generous PTO/benefits! Apply today to make a direct, daily impact in one of the fastest-growing startups in the country - we are excited to meet you!Position Overview: We are seeking a detail-oriented Associate Contracts Attorney to join our legal team. The ideal candidate will have a strong understanding of contract law, excellent negotiation skills, and a keen interest in the telehealth sector. As an Associate Contracts Attorney, you will support our Chief Legal and Compliance Officer and the Legal/Compliance Analysts, reviewing, and negotiating a wide range of contracts and agreements. This role requires excellent communication skills, the ability to work independently, and a proactive approach to problem-solving.Duties and Responsibilities:Assist in drafting, reviewing, and negotiating various contracts, including service agreements, vendor contracts, licensing agreements, and partnership agreements.Ensure contracts comply with all applicable laws and regulations, including HIPAA/ HL7 regulations.Collaborate with internal departments (e.g., compliance, finance, operations) to ensure contractual terms align with company policies and objectives.Conduct legal research on relevant laws, regulations, and industry standards to support contract negotiations and ensure compliance.Assist in the development and maintenance of contract templates and other legal documents.Provide general legal support and advice to the company’s various business units.Monitor contract performance and compliance, addressing any issues or disputes that arise.Support in developing and implementing policies and procedures to improve contract management processes.Stay informed about changes in telehealth regulations and advise on their potential impact on the company’s operations and contracts.You will likely have:Juris Doctor (JD) degree from an accredited law school.Admission to a state bar in good standing.1-3 years of experience in contract law, preferably in the healthcare or telehealth industry.Strong understanding of contract principles, legal terminology, and risk management.Excellent written and verbal communication skills.Strong analytical and problem-solving abilities.Ability to manage multiple tasks and meet deadlines in a fast-paced environment.High attention to detail and strong organizational skills.You may have:Experience with telehealth or healthcare-related contracts.Knowledge of healthcare regulations, including HIPAA, HITECH, and other relevant laws.Familiarity with contract management software.Company Offers:Platinum PPO Healthcare + Vision & Dental (Henry covers 99% for employees and 50% for their qualified dependents).401(k) with matching contributions beginning your first day.Unlimited PTO.Fully remote position with occasional travel.Impactful, rewarding work as part of a fast-growing brand helping thousands of people every day.Equal Opportunity Statement:Henry Meds is committed to promoting an inclusive work environment free of discrimination and harassment. We value a diverse and balanced team where everyone can belong.Applicants must be authorized to work for ANY employer in the U.S. We cannot sponsor or take over sponsorship of an employment Visa at this time.Elevate your applicationLet our AI craft your perfect cover letter and align your resume to this job's criteria.Optimize my resumeCraft my cover letterBy using our AI tools, you consent to sharing your profile with our AI partner for this purpose.Elevate your applicationLet our AI craft your perfect cover letter and align your resume to this job's criteria.By using our AI tools, you consent to sharing your profile with our AI partner for this purpose.Optimize my resumeCraft my cover letterApply nowJob expired?Please let Henry Meds know you found this job on Himalayas. This helps us grow!Apply nowApply nowJob expired?Please let Henry Meds know you found this job on Himalayas. This helps us grow!Apply nowAbout the jobApply beforeSep 01, 2024Posted onJul 03, 2024Job typeFull TimeExperience levelMid-levelLocation requirementsSuggest an editUnited StatesHiring timezonesShow UTC offsetsUnited States +/- 0 hoursJob categoriesContracts SpecialistContracts AdministratorContract Negotiation SpecialistContract NegotiatorSkillsContract LawNegotiationTelehealthLegal ResearchHIPAA RegulationsLegal DocumentationRisk ManagementHealthcare RegulationsContract ManagementAbout Henry MedsLearn more about Henry Meds and their company culture.View company profileHimalayasRemote companiesHenry MedsAssociate Contracts AttorneyApply nowJob expired?Please let Henry Meds know you found this job on Himalayas. This helps us grow!Apply nowElevate your applicationLet our AI craft your perfect cover letter and align your resume to this job's criteria.Optimize my resumeCraft my cover letterBy using our AI tools, you consent to sharing your profile with our AI partner for this purpose.About the jobApply beforeSep 01, 2024Posted onJul 03, 2024Job typeFull TimeExperience levelMid-levelLocation requirementsSuggest an editUnited StatesHiring timezonesShow UTC offsetsUnited States +/- 0 hoursJob categoriesContracts SpecialistContracts AdministratorContract Negotiation SpecialistContract NegotiatorSkillsContract LawNegotiationTelehealthLegal ResearchHIPAA RegulationsLegal DocumentationRisk ManagementHealthcare RegulationsContract ManagementClaim this profileHMHenry MedsCompany sizeSocial mediaHenry Meds's LinkedInView company profileVisit henrymeds.com"
  },
  {
    "jobTitle": "Principal Bid Manager",
    "jobDescriptionUrl": "https://himalayas.app/companies/amey/jobs/principal-bid-manager",
    "companyName": "Amey",
    "jobID": "d5a8cdf7-7dac-4c38-b310-c2d0e67bb159",
    "jobDescription": "Your New Role We have a fantastic opportunity for a Principal Bid Manager to join our Work Winning team supporting our Complex Facilities. This is a remote role that will require regular travel to usually Birmingham or London. The purpose of the role is to grow the business by delivering professional winning bids that are profitable and fit within strategic plan objectives.As the Principal Bid Manager, you will be tasked to lead a bid programme with relevant subject leads for individual major, medium or strategic bid(s), acting as the focal point for all technical deliverables incorporating quality responses, solution, co-create, negotiations, presentations and the like and for commercial deliverables incorporating estimating, risk, opportunities, financial and legal. You will develop the bid strategy and manage the communication protocol with all internal and external stakeholders including governance and bid process and oversee business-led bids (minor bids or ‘Children’ of frameworks) to ensure that bid governance and bid process is followed.The standard hours of work are based on 37.5 hours per week, Monday – Friday. Work-life balance and flexibility are key for our success. We empower our people to make choices that are right for them, with hybrid, part-time and flexible work patterns. And with a network of offices across the UK, we’re open to discussing working options that suit you.You will be responsible for:Leading the bid process for a programme of bids and individual bids. Developing the bid strategy with individual Business Stream or Account Directors.Monitoring completion of pursuit and capture data by the business/business development and ensure that win plans are in place for each major, medium and strategic bid.Planning, managing and identifying resource requirements for bids including support functions and those allocated to deliver the and technical solution and any commercial submissionsLeading and managing the development of high quality technical and commercial bid deliverables in line with the agreed bid strategy.Setting up and managing communication and document protocols for each bid.Maintaining client liaison ensuring effective dialogue and prompt response to clarifications.Preparing and managing the bid budget and the Opportunity Assessment ToolFacilitating the risk and opportunities process engaging a wide range of input with expert commercial ownershipOverseeing business-led bids (minor bids or ‘Children’ of frameworks) and ensure that bid governance and bid process is followed.Managers and Bid Leads who are managing business-led bidsWe want to hear from you if you have:Educated to degree level Ideally APMP Foundation level Process orientated, organised and thorough Experience of keeping track of multiple time-phased activities.Excellent time management and prioritisation. Strong project management and application of processes and knowledge to achieve objectives.Ability to get the best from bid teams, whether working remotely or co-located.Ability to embrace change and drive continual improvement.Understanding of commercial requirements including cost planning, estimating and balancing risk with reward.Creative, with an enquiring mind. MS Office – Word, Excel, PowerPoint and SharePoint. MS Project an advantage.Experience of successful bidding in the relevant business sector, able to work across different sectorsWhat we can offer you When you join us, we can offer flexibility, career development, a choice of benefits and support that help you through all life’s ups and downs. It’s the reason why Investors in People put us among the top 1% of employers and we have a competitive reward and benefits programCareer Development - Exceptional development and progression planPension – Generous Pension scheme which we will contribute to Holidays - Minimum 24 days holiday + Bank HolidaysChoices - Our flexible benefits scheme is tailored by you, including buying additional annual leave, cycle2work scheme, charity giving and gym membership Save with Amey - Our online voucher portal gives you access to thousands of discounts from leading retailers to help you save on shopping, days out, or nights in. It includes healthcare, free GP service, dental vouchersSocial Value - You’ll get 2 Community Involvement Days each year to volunteer for a charity of your choice and further opportunities to support fundraising initiativesWe embrace difference and support individuals to work in ways that work best for them.We are committed to working sustainably and by working in partnership with the communities we serve, so people and the planetare protected.Who is Amey?We are at the heart of modern Britain, helping the economy to grow by designing, maintaining and transforming the nation’s strategic assets.Our 11,000 people are behind the critical services the country relies on every day.Our unique engineering and operations experience, together with data driven insight from our consulting business, delivers better results for our clients. We are trusted partners of Government – both national and local – managing assets and complex projects that are vital to the sustainable growth of the country.To find out more take a look at our website www.amey.co.ukApplication Guidance Amey is committed to Inclusion and Diversity. We welcome applications from all suitably qualified candidates, regardless of their race, gender, disability, religion/belief, sexual orientation, or age. We are also committed to offering applicants with a disability an interview if they meet the minimum requirements for the role. Please contact our recruitment team at peopleservices@amey.co.uk to discuss any access needs, reasonable adjustments or additional support that may be required at any point during the recruitment process.Apply today – We are excited to hear from you!We reserve the right to close this vacancy before the closing date should we receive sufficient applications for the role. Therefore, if you are interested, please submit your application as early as possible.Elevate your applicationLet our AI craft your perfect cover letter and align your resume to this job's criteria.Optimize my resumeCraft my cover letterBy using our AI tools, you consent to sharing your profile with our AI partner for this purpose.Elevate your applicationLet our AI craft your perfect cover letter and align your resume to this job's criteria.By using our AI tools, you consent to sharing your profile with our AI partner for this purpose.Optimize my resumeCraft my cover letterApply nowJob expired?Please let Amey know you found this job on Himalayas. This helps us grow!Apply nowApply nowJob expired?Please let Amey know you found this job on Himalayas. This helps us grow!Apply nowAbout the jobApply beforeSep 01, 2024Posted onJul 03, 2024Job typeFull TimeExperience levelManagerLocation requirementsSuggest an editUnited KingdomHiring timezonesShow UTC offsetsUnited Kingdom +/- 0 hoursJob categoriesProposals ManagerProposal CoordinatorPrincipal Software EngineerSkillsBid ManagementBusiness DevelopmentProject ManagementRisk ManagementMS OfficeSharePointBusiness PlanningCost EstimationGovernanceBusiness StrategyCommunicationPresentationNegotiationAbout AmeyLearn more about Amey and their company culture.View company profileHimalayasRemote companiesAmeyPrincipal Bid ManagerApply nowJob expired?Please let Amey know you found this job on Himalayas. This helps us grow!Apply nowElevate your applicationLet our AI craft your perfect cover letter and align your resume to this job's criteria.Optimize my resumeCraft my cover letterBy using our AI tools, you consent to sharing your profile with our AI partner for this purpose.About the jobApply beforeSep 01, 2024Posted onJul 03, 2024Job typeFull TimeExperience levelManagerLocation requirementsSuggest an editUnited KingdomHiring timezonesShow UTC offsetsUnited Kingdom +/- 0 hoursJob categoriesProposals ManagerProposal CoordinatorPrincipal Software EngineerSkillsBid ManagementBusiness DevelopmentProject ManagementRisk ManagementMS OfficeSharePointBusiness PlanningCost EstimationGovernanceBusiness StrategyCommunicationPresentationNegotiationClaim this profileAMAmeyCompany sizeSocial mediaAmey's TwitterAmey's LinkedInView company profileVisit amey.co.uk"
  },
  {
    "jobTitle": "Own Brand Senior Executive",
    "jobDescriptionUrl": "https://himalayas.app/companies/metro-makro/jobs/own-brand-senior-executive",
    "companyName": "METRO/MAKRO",
    "jobID": "4f57c508-0c07-40ff-a716-7190c980c47a",
    "jobDescription": "Company DescriptionMETRO is a global food company which inspires the gastronomy sector in more than 30 countries with 678 stores serving more than 17 million customers all around the world!With its 34 years presence in our country, METRO Türkiye is operating in 20 cities, with 36 stores and 4.500 employees.We are a purpose driven company; we value Turkish cuisine, develop our community by supporting our chefs, leading the market with several sustainability projects, diverse and inclusive structure, digitalization projects, agile innovative approaches and inspire the sector.METRO Türkiye is proud to be an equal opportunity employer.We are committed to equal employment opportunity and equal pay regardless of e.g. race, color, religion, sex, national origin, sexual orientation, disability, or gender identity.Job DescriptionMETRO’s Own Brands specifically designed for our target customer group HORECA, build customer loyalty through distinctiveness and user-friendly features. Moreover, benefiting from favorable procurement conditions, they play a role in enhancing the company's profit margins. This department’s primary focus is on listening to our customers and gathering their feedbacks.We are looking for a Own Brand Senior Executive to be a part of our team in the Offer Management Department.Own Brand Unit works with all departments. When launching new products, it teams up with Category, Quality Assurance, Gastronometro and Category Strategy Development departments, as well as Marketing. To make sure the product is available for sale, it collaborates with Stores and the Sales Force team. It also works with Controlling for KPI monitoring and Supply Chain Management for order and availability issuesIncreasing the revenue share of our own brand productsImproving the invoice and customer penetration of our own brand productsTracking the process from the emergence of a product idea to its shelf developmentConducting performance evaluations, qualitative analyses, packaging design, creating a 360-degree marketing plan for the product to reach the customer, and coordinating the entire processNegotiating with suppliers regarding product costs, contracts, and optimizing the processEnsuring the visibility and continuity of our own brand product on the shelf after it is placedCreating and tracking the annual online auction calendarQualificationsMinimum Bachelor’s Degree in a related fieldMinimum 3+ years of experience in retail sectorStrong communication skills in EnglishAdvanced knowledge of MS Office skillsEmbracing a store and customer service-oriented mindsetAbility to manage cross-functional relationships and collaborate in a creative, team-oriented environmentStrong analytical and problem solving skills for a sustainable and powerful relationship with customersSelf-disciplined, result oriented, multitaskingAdditional InformationHead Office Working Model is Hybrid in Metro, We're working remotely on Mondays and Fridays. You can work from anywhere on these days!Learning & growing opportunity in a dynamic and respectful work environment,We’re always caring and supporting our colleagues with our well-being package,We have special offers & employee discount for you,Shuttle & food expense & health assurance,Let’s Join the M and start to shape your career!Elevate your applicationLet our AI craft your perfect cover letter and align your resume to this job's criteria.Optimize my resumeCraft my cover letterBy using our AI tools, you consent to sharing your profile with our AI partner for this purpose.Elevate your applicationLet our AI craft your perfect cover letter and align your resume to this job's criteria.By using our AI tools, you consent to sharing your profile with our AI partner for this purpose.Optimize my resumeCraft my cover letterApply nowJob expired?Please let METRO/MAKRO know you found this job on Himalayas. This helps us grow!Apply nowApply nowJob expired?Please let METRO/MAKRO know you found this job on Himalayas. This helps us grow!Apply nowAbout the jobApply beforeSep 01, 2024Posted onJul 03, 2024Job typeFull TimeExperience levelSeniorLocation requirementsSuggest an editTurkeyHiring timezonesShow UTC offsetsTurkey +/- 0 hoursJob categoriesBrand ManagerSenior ManagerSkillsOpportunity ManagementCategory MarketingMarketingSupply Chain ManagementPackagingNegotiationMS OfficeCustomer ServiceAbout METRO/MAKROLearn more about METRO/MAKRO and their company culture.View company profileHimalayasRemote companiesMETRO/MAKROOwn Brand Senior ExecutiveApply nowJob expired?Please let METRO/MAKRO know you found this job on Himalayas. This helps us grow!Apply nowElevate your applicationLet our AI craft your perfect cover letter and align your resume to this job's criteria.Optimize my resumeCraft my cover letterBy using our AI tools, you consent to sharing your profile with our AI partner for this purpose.About the jobApply beforeSep 01, 2024Posted onJul 03, 2024Job typeFull TimeExperience levelSeniorLocation requirementsSuggest an editTurkeyHiring timezonesShow UTC offsetsTurkey +/- 0 hoursJob categoriesBrand ManagerSenior ManagerSkillsOpportunity ManagementCategory MarketingMarketingSupply Chain ManagementPackagingNegotiationMS OfficeCustomer ServiceClaim this profileMEMETRO/MAKROCompany sizeSocial mediaMETRO/MAKRO's TwitterMETRO/MAKRO's LinkedInView company profileVisit metroag.de"
  },
  {
    "jobTitle": "Associate Project Manager",
    "jobDescriptionUrl": "https://himalayas.app/companies/vonage/jobs/associate-project-manager-3842637956",
    "companyName": "Vonage",
    "jobID": "b28f4c29-9cbf-48c4-9aab-1d9beb54c18c",
    "jobDescription": "The Service Delivery Team at Vonage provides a unique one on one onboarding experience for high value new accounts. The Associate Project Manager is responsible for project management of the highest segment of new high value accounts.A successful candidate will demonstrate proven leadership experience in a customer service or project management environment. The Associate Project Manager reports directly to the Service Delivery Manager. Candidates for this position may be required to work a schedule that could include nights and/or weekends.IF THIS SOUNDS LIKE YOU, CONTINUE READING BELOW...What you'll doManage the onboarding of high value accountsFacilitate face-to-face communication and project feedback, from initial kickoff through milestone reporting and close-out.Work with cross-functional Vonage stakeholders to define project scope based on client needs and expectations.Participate in calls with Sales to learn about account and advise on best practices for potential deals or deals about to closeMonitor and manage activation and porting dates for all assigned accountsManage/complete multiple projects in a timely manner while still handling daily call/email volumeParticipate in post-project evaluation sessions.Coordinating with internal teams to complete labor intensive tasks which typically fall to the customer for completionAnswer customer questions, via phone or email, on all company supported applicationsProvide customer focused support using clear and descriptive methodsWork with multiple departments to provide internal education and assistanceAdditional relevant duties as assignedCommunicate, implement and support process change initiatives as directed by managementWhat's required for applicationBachelor’s degree in related field preferred or equivalent experience 1-2 years industry experienceOutstanding communication skills; oral and writtenExcellent time management skillsStrong listening skillsConflict management skillsAbility to work in a fast-paced environmentDetail orientedWhat's in it for youIn addition to providing exciting work, career advancement opportunities, and a collaborative work environment, Vonage provides competitive pay and benefits including unlimited discretionary time off and tuition reimbursement.Note: The purpose of this profile is to provide a general summary of essential responsibilities for the position and is not meant as an exhaustive list. Assignments may differ for individuals within the same role based on business conditions, departmental need or geographic location.Elevate your applicationLet our AI craft your perfect cover letter and align your resume to this job's criteria.Optimize my resumeCraft my cover letterBy using our AI tools, you consent to sharing your profile with our AI partner for this purpose.Elevate your applicationLet our AI craft your perfect cover letter and align your resume to this job's criteria.By using our AI tools, you consent to sharing your profile with our AI partner for this purpose.Optimize my resumeCraft my cover letterApply nowJob expired?Please let Vonage know you found this job on Himalayas. This helps us grow!Apply nowApply nowJob expired?Please let Vonage know you found this job on Himalayas. This helps us grow!Apply nowAbout the jobApply beforeSep 01, 2024Posted onJul 03, 2024Job typeFull TimeExperience levelMid-levelLocation requirementsSuggest an editUnited StatesHiring timezonesShow UTC offsetsUnited States +/- 0 hoursJob categoriesAssociate Project ManagerAssociate ManagerJunior Project ManagerProject ManagerProject CoordinatorSkillsProject ManagementCustomer ServiceLeadershipCommunication SkillsTime ManagementCommunicationAbout VonageLearn more about Vonage and their company culture.View company profileHimalayasRemote companiesVonageAssociate Project ManagerApply nowJob expired?Please let Vonage know you found this job on Himalayas. This helps us grow!Apply nowElevate your applicationLet our AI craft your perfect cover letter and align your resume to this job's criteria.Optimize my resumeCraft my cover letterBy using our AI tools, you consent to sharing your profile with our AI partner for this purpose.About the jobApply beforeSep 01, 2024Posted onJul 03, 2024Job typeFull TimeExperience levelMid-levelLocation requirementsSuggest an editUnited StatesHiring timezonesShow UTC offsetsUnited States +/- 0 hoursJob categoriesAssociate Project ManagerAssociate ManagerJunior Project ManagerProject ManagerProject CoordinatorSkillsProject ManagementCustomer ServiceLeadershipCommunication SkillsTime ManagementCommunicationClaim this profileVOVonageCompany sizeSocial mediaVonage's TwitterView company profileVisit vonage.com"
  },
  {
    "jobTitle": "Substation Electrical Engineer",
    "jobDescriptionUrl": "https://himalayas.app/companies/ulteig/jobs/substation-electrical-engineer",
    "companyName": "Ulteig",
    "jobID": "e35a668d-e6dc-48d6-9395-3f41ffb8398b",
    "jobDescription": "The OpportunityUlteig is seeking qualified candidates for the position of Substation Engineer to support Renewables/Utility/Power projects. The Substation Engineer develops and reviews utility substation drawings, including General Arrangements, Elevations, Cable and Conduit Plans, Grounding Plans, AC/DC Schematics, panel elevations, electrical equipment enclosure plans, wiring diagrams, specifications, and reports to ensure that they are complete, accurate, and in accordance with sound engineering practices and client standards.What You'll DoThe Substation Engineer acts as a technical leader and applies standard engineering techniques and procedures on moderately complex projects. Plans, schedules, conducts and/or coordinates detailed phases of assigned project work. Makes design recommendations, adaptations and modifications for utility substations. Performs calculations using engineering formulas and skills. Involved in the resolution of design problems, which may include performing field investigation or observation, detailed design work and detailed quality control (QC) review of design calculations. Coordinates specific design aspects of a project requiring the ability to plan, schedule, conduct, and communicate work with team members. Provide technical guidance to other engineers. What We Expect from YouBachelor's degree in Electrical Engineering required. ABET accredited program or equivalent required.PE License strongly preferred. Ability to obtain within 1 year required.4 years of engineering experience requiredPrior experience working with physical design or protection and control design of electrical power substations requiredCapable of reviewing and producing design drawings, including General Arrangements, Elevations, Cable and Conduit Plans, Grounding Plans, Physical Connection Details, AC/DC schematics, and wiring diagramsAbility to perform AC & DC substation studiesExperience using ground grid modeling software a plusKnowledge of substation protection and control schemes a plusKnowledge of basic relay settings a plusKnowledge of National Electric Code (NEC) a plusKnowledge of National Electrical Safety Code (NESC) a plusKnowledge of Rural Utilities Service (RUS) design guide a plusProven experience in Microsoft Software Applications (Word, Excel, Power Point)Up to 15% travel requiredMust have permanent authorization to work in USAs you consider applying for a position at Ulteig, we encourage you to think outside the box – because we do! You might not meet 100% of the skills listed in a description, but we are committed to hiring people with exceptional talent, ability and potential, and then creating an environment where they can become the best versions of themselves. We don’t want to miss out on the possibility of speaking with the next outstanding Ulteig team member, so please apply if you think this role is a great match for your unique skills and strengths. And, yes, relevant military experience is absolutely considered for transitioning service members.What You Can Expect from UlteigUlteig is a purpose driven organization that has built a culture focused on people – both our clients and our employees –for over 80 years. Working at Ulteig is more than a job, opening opportunities to make an impact by creating and solving for a sustainable future. We recognize our success relies heavily on the dedication and focus of our workforce; this is why we make investing in our employees a top priority. We prioritize flexibility and staying connected to meet your needs and help you achieve your goals. We value your unique perspective, respect your individuality and celebrate your contributions. At Ulteig, we take our own success and the success of our clients personally.We offer our team members:Flexible WorkplaceEmployee OwnershipCompetitive PayComprehensive Benefits PackageCollaborative EnvironmentInnovative CultureOur vision is to be the most trusted partners transforming our world’s critical infrastructure. Ulteig connects people and resources to develop compelling, integrated solutions across multiple Lifeline Sectors®, including Power, Renewables, Transportation and Water. Ulteig is a trusted partner in engineering North America’s essential infrastructure and leverages its expertise with a wide range of public and private clients. At Ulteig, we care deeply about our team, listening to their needs and ensuring they have the tools necessary to be productive whether they choose to work remotely, hybrid or in office. Regardless of where you work, you are empowered to build a workday that best suits your strengths. We strive to ensure a balance and separation between home and work life. We support a flexible working schedule so employees are able to focus on what's important to them.If you would like to be a part of a company that empowers their employees, apply today! Ulteig is a Drug Free WorkplaceACHIEVE | GROW | COLLABORATEAdditional Opportunity Details:Target Base Compensation Range for this role is $95,000 - $128,000* Factors that may be used to determine your actual salary include your job specific skills, education, training, job location, number of years of experience related to this role and comparison to other employees already in this roleThis position will be posted for a minimum of 3 days and will continue to be posted for an average of 60 days until a qualified applicant is selected or the position has been cancelled.Notice to Recruiters and Staffing Agencies: to protect the interests of all parties, Ulteig Engineers, Inc., will not accept unsolicited resumes from any source other than directly from a candidate or an approved vendor that has a written and signed agreement in place with Ulteig. Please do not contact or forward resumes to our company employees or locations. Any unsolicited resumes will be considered Ulteig property. Ulteig is not responsible for any charges or fees related to unsolicited resumes.Elevate your applicationLet our AI craft your perfect cover letter and align your resume to this job's criteria.Optimize my resumeCraft my cover letterBy using our AI tools, you consent to sharing your profile with our AI partner for this purpose.Elevate your applicationLet our AI craft your perfect cover letter and align your resume to this job's criteria.By using our AI tools, you consent to sharing your profile with our AI partner for this purpose.Optimize my resumeCraft my cover letterApply nowJob expired?Please let Ulteig know you found this job on Himalayas. This helps us grow!Apply nowApply nowJob expired?Please let Ulteig know you found this job on Himalayas. This helps us grow!Apply nowAbout the jobApply beforeSep 01, 2024Posted onJul 03, 2024Job typeFull TimeExperience levelMid-levelSalarySalary: 95k-128k USDLocation requirementsSuggest an editUnited StatesHiring timezonesShow UTC offsetsUnited States +/- 0 hoursJob categoriesElectrical EngineerStaff Electrical EngineerProject EngineerField EngineerSkillsElectrical EngineeringElevationsProduct SpecificationTechnical DesignProtection And Control SchemesMicrosoft Office ApplicationsExcelAbout UlteigLearn more about Ulteig and their company culture.View company profileHimalayasRemote companiesUlteigSubstation Electrical EngineerApply nowJob expired?Please let Ulteig know you found this job on Himalayas. This helps us grow!Apply nowElevate your applicationLet our AI craft your perfect cover letter and align your resume to this job's criteria.Optimize my resumeCraft my cover letterBy using our AI tools, you consent to sharing your profile with our AI partner for this purpose.About the jobApply beforeSep 01, 2024Posted onJul 03, 2024Job typeFull TimeExperience levelMid-levelSalarySalary: 95k-128k USDLocation requirementsSuggest an editUnited StatesHiring timezonesShow UTC offsetsUnited States +/- 0 hoursJob categoriesElectrical EngineerStaff Electrical EngineerProject EngineerField EngineerSkillsElectrical EngineeringElevationsProduct SpecificationTechnical DesignProtection And Control SchemesMicrosoft Office ApplicationsExcelClaim this profileULUlteigCompany sizeSocial mediaUlteig's TwitterUlteig's LinkedInView company profileVisit ulteig.com"
  },
  {
    "jobTitle": "IT-Dozent (m/w/x) für Fachinformatiker (remote oder Präsenz)",
    "jobDescriptionUrl": "https://himalayas.app/companies/gfn/jobs/it-dozent-m-w-x-fur-fachinformatiker-remote-oder-prasenz",
    "companyName": "GFN",
    "jobID": "dfaad0e2-bc3c-43ee-9e18-cc7ae74ad8eb",
    "jobDescription": "Die GFN GmbH begleitet als Bildungsanbieter mit IT-Spezialisierung deutschlandweit Menschen bei ihrer Weiterbildung und beruflichen Neuorientierung.Für den Einsatz im geförderten Bildungsbereich suchen wir ab sofort bundesweit Dozenten (m/w/x) auf freiberuflicher Basis und in Festanstellung.AufgabenIT-Trainings zu den folgenden Themen:Planen, Ausführen, Testen und Bereitstellen von SoftwareprojektenEinführung in die Programmierung (UML-Klassendiagramm, Use-Case-Diagramm, EPK, Nassi-Shneiderman-Diagramm, Programmablaufplan, PseudocodeObjektorientierte Programmierung mit JavaProgrammierung mit PythonOracle Certified Associate Java (OCA)Entwickeln und Konzipieren von Datenbanken mit SQLWebentwicklung mit HTML und CSS, JavaScript und PHPQualifikationAbgeschlossene Berufsausbildung in der IT/abgeschlossenes Informatikstudium oder vergleichbare AusbildungAusbildungseignungsprüfung der IHK (AEVO) oder die Bereitschaft, einen solchen Nachweis noch zu erbringenUnterrichtserfahrung in der Erwachsenenbildung, idealerweise im geförderten BildungsbereichAktuelle Herstellerzertifizierungen, z. B. OCA ab Java Version 8 SEProgrammierungserfahrungDu hast Spaß am Unterrichten und bist pädagogisch sowie didaktisch kompetent.Du hast keine Scheu vor heterogenen Gruppen.BenefitsFrühzeitige Auftragsplanung und die Möglichkeit zur langfristigenZusammenarbeitSchulungsmöglichkeiten Online und/oder in PräsenzFaire HonorareProfessionelle Unterstützung bei fachlichen und bei methodisch-didaktischenFragenMöglichkeiten zur aktiven Mitarbeit an neuen SchulungskonzeptenAustauschmöglichkeiten mit anderen Dozenten (m/w/x)Bereitstellung von UnterrichtsinhaltenBei uns erwartet Dich ein vorurteilsfreies, wertschätzendes Miteinander. Wir leben Vielfalt – sowohl mit unseren Teilnehmer:innen als auch im GFN-Team.Interessiert? Dann bewirb Dich jetzt über unser Bewerbungsformular. Falls Du noch Fragen hast, sprich uns gerne an.Wir freuen uns auf Dich!Elevate your applicationLet our AI craft your perfect cover letter and align your resume to this job's criteria.Optimize my resumeCraft my cover letterBy using our AI tools, you consent to sharing your profile with our AI partner for this purpose.Elevate your applicationLet our AI craft your perfect cover letter and align your resume to this job's criteria.By using our AI tools, you consent to sharing your profile with our AI partner for this purpose.Optimize my resumeCraft my cover letterApply nowJob expired?Please let GFN know you found this job on Himalayas. This helps us grow!Apply nowApply nowJob expired?Please let GFN know you found this job on Himalayas. This helps us grow!Apply nowAbout the jobApply beforeSep 01, 2024Posted onJul 03, 2024Job typeContractorExperience levelMid-levelLocation requirementsSuggest an editGermanyHiring timezonesShow UTC offsetsGermany +/- 0 hoursJob categoriesIT TrainerIT EducatorSkillsJavaJavaScriptAbout GFNLearn more about GFN and their company culture.View company profileHimalayasRemote companiesGFNIT-Dozent (m/w/x) für Fachinformatiker (remote oder Präsenz)Apply nowJob expired?Please let GFN know you found this job on Himalayas. This helps us grow!Apply nowElevate your applicationLet our AI craft your perfect cover letter and align your resume to this job's criteria.Optimize my resumeCraft my cover letterBy using our AI tools, you consent to sharing your profile with our AI partner for this purpose.About the jobApply beforeSep 01, 2024Posted onJul 03, 2024Job typeContractorExperience levelMid-levelLocation requirementsSuggest an editGermanyHiring timezonesShow UTC offsetsGermany +/- 0 hoursJob categoriesIT TrainerIT EducatorSkillsJavaJavaScriptClaim this profileGFGFNCompany sizeSocial mediaGFN's LinkedInView company profileVisit gfn.de"
  },
  {
    "jobTitle": "Accounting Controller -20230692996/20232328460",
    "jobDescriptionUrl": "https://himalayas.app/companies/somewhere/jobs/accounting-controller-20230692996-20232328460",
    "companyName": "Somewhere",
    "jobID": "f2ca6edd-587f-484d-9668-974010836c71",
    "jobDescription": "LOOKING FOR FILIPINOS OR PHILIPPINES-BASED CANDIDATESJob Title: Accounting ControllerSchedule: Mondays to Fridays; 9:00 AM to 6:00 PM Eastern TimeSalary: $1,800-$2,500/monthResponsibilitiesManage the day-to-day accounting operations with multiple capital partners. Maintain and establish accounting, financial reporting and internal control systems, policies and procedures.Direct journal entry preparation and review general ledger account reconciliation.Oversee monthly bank reconciliations and cash flow reporting to ensure appropriate cash levels are maintained for operational success.Ensure the general ledger, financial accounts, and reporting systems are in accordance with GAAP and applicable federal, state, and local regulations.Investigate financial discrepancies/anomalies and communicate any issues expediently.Manage Dynamics 365 Business Central utilization and reporting for accounting and finance with multiple capital partners.Lead monthly, quarterly, and year-end accounting close and prepare respective financial statements for review.Manage the year-end financial statement audit and work directly with auditors to facilitate audit requests, prepare audit schedules and ensure timely audit submissions.Work with external tax service providers to ensure compliance with tax regulations for all relevant entities.Assist in the implementation of various accounting policies and procedures associated with real estate transactions.Ability to work in a challenging, fast-paced environment and handle multiple projects at the same time.Accuracy and attention to detail is critical.RequirementsBachelor’s degree in Accounting or Finance. CPA preferred.Minimum of 8-10 years of experience accounting for a real estate company and/or real estate private equity fund.Managerial experienceA strong working knowledge of US GAAP and income tax basis of accounting.Proven ability to effectively communicate directly with JV partners, external auditors and senior management.Desire to work in a fast paced and collaborative environment.Act with a sense of urgency and selflessly serve key stakeholders.Organized with a strong attention to detail.Working knowledge of Microsoft Dynamics 365 Business Central ERP and Coupa spend management platform a PLUS.Strong understanding of real estate taxes.Hands-on attitude.Good people management and communication skills with direct experience managing team members.Strong proficiency utilizing Microsoft Office SuiteElevate your applicationLet our AI craft your perfect cover letter and align your resume to this job's criteria.Optimize my resumeCraft my cover letterBy using our AI tools, you consent to sharing your profile with our AI partner for this purpose.Elevate your applicationLet our AI craft your perfect cover letter and align your resume to this job's criteria.By using our AI tools, you consent to sharing your profile with our AI partner for this purpose.Optimize my resumeCraft my cover letterApply nowJob expired?Please let Somewhere know you found this job on Himalayas. This helps us grow!Apply nowApply nowJob expired?Please let Somewhere know you found this job on Himalayas. This helps us grow!Apply nowAbout the jobApply beforeSep 01, 2024Posted onJul 03, 2024Job typeFull TimeExperience levelManagerSalarySalary: 22k-30k USDLocation requirementsSuggest an editPhilippinesHiring timezonesShow UTC offsetsPhilippines +/- 0 hoursJob categoriesAccounting ManagerCorporate Accounting ManagerSenior Accounting ManagerCost Accounting ManagerAccounting Systems AnalystSkillsAccountingFinancial ReportingInternal ControlsGAAPMicrosoft Dynamics 365Account ReconciliationBank ReconciliationCash Flow ManagementAuditTax ComplianceReal EstateMicrosoft Office SuitePeople ManagementCommunication SkillsCoupaAbout SomewhereLearn more about Somewhere and their company culture.View company profileHimalayasRemote companiesSomewhereAccounting Controller -20230692996/20232328460Apply nowJob expired?Please let Somewhere know you found this job on Himalayas. This helps us grow!Apply nowElevate your applicationLet our AI craft your perfect cover letter and align your resume to this job's criteria.Optimize my resumeCraft my cover letterBy using our AI tools, you consent to sharing your profile with our AI partner for this purpose.About the jobApply beforeSep 01, 2024Posted onJul 03, 2024Job typeFull TimeExperience levelManagerSalarySalary: 22k-30k USDLocation requirementsSuggest an editPhilippinesHiring timezonesShow UTC offsetsPhilippines +/- 0 hoursJob categoriesAccounting ManagerCorporate Accounting ManagerSenior Accounting ManagerCost Accounting ManagerAccounting Systems AnalystSkillsAccountingFinancial ReportingInternal ControlsGAAPMicrosoft Dynamics 365Account ReconciliationBank ReconciliationCash Flow ManagementAuditTax ComplianceReal EstateMicrosoft Office SuitePeople ManagementCommunication SkillsCoupaClaim this profileSOSomewhereCompany sizeSocial mediaSomewhere's LinkedInView company profileVisit somewhere.com"
  },
  {
    "jobTitle": "Blockchain Engineer (Manila -Remote)",
    "jobDescriptionUrl": "https://himalayas.app/companies/token-metrics/jobs/blockchain-engineer-manila-remote-6913080315",
    "companyName": "Token Metrics",
    "jobID": "fba24141-eb1d-420a-8950-2cd8f81f47ae",
    "jobDescription": "Token Metrics is seeking a multi-talented Smart Contract Engineer to facilitate the operations of our Engineering team. As a Smart Contract Engineer, you will closely collaborate with fellow engineers and product managers to build infrastructure to bring Token Metrics privacy and scalability infrastructure to the Ethereum ecosystem. Examples of work include building a cross-chain bridge for moving assets, and implementing a Solidity smart contract to validate blocks for a private and auditable transaction system on Token Metrics.Responsibilities Design, implement, test, and deploy EVM smart contractsWork with external auditors to evaluate security and safety of smart contractsTake engineering projects from concept and design to production, while working with engineering leaders and the product team to create sound and realistic roadmaps.Requirements 3+ years of professional software engineering experience or equivalent blockchain/smart contract development experienceProficiency developing in Solidity; familiarity with precompilesUnderstanding of software engineering and security best practices, in particular smart contract securityExperience interacting with dapps/web3Experience shipping and taking engineering projects to production.About Token MetricsToken Metrics helps crypto investors build profitable portfolios using artificial intelligence-based crypto indices, rankings, and price predictions. Token Metrics has a diverse set of customers, from retail investors and traders to crypto fund managers, in more than 50 countries.Elevate your applicationLet our AI craft your perfect cover letter and align your resume to this job's criteria.Optimize my resumeCraft my cover letterBy using our AI tools, you consent to sharing your profile with our AI partner for this purpose.Elevate your applicationLet our AI craft your perfect cover letter and align your resume to this job's criteria.By using our AI tools, you consent to sharing your profile with our AI partner for this purpose.Optimize my resumeCraft my cover letterApply nowJob expired?Please let Token Metrics know you found this job on Himalayas. This helps us grow!Apply nowApply nowJob expired?Please let Token Metrics know you found this job on Himalayas. This helps us grow!Apply nowAbout the jobApply beforeSep 01, 2024Posted onJul 03, 2024Job typeFull TimeExperience levelMid-levelLocation requirementsSuggest an editPhilippinesHiring timezonesShow UTC offsetsPhilippines +/- 0 hoursJob categoriesBlockchain EngineerBlockchain Protocol EngineerBlockchain DeveloperBlockchain Developer Relations ManagerBlockchain ArchitectBlockchain Technical EvangelistBlockchain AnalystBlockchain Developer AdvocateCryptography EngineerCrypto Quality Assurance (QA) Senior AssociateDistributed Network EngineerCryptographic EngineerDistributed Systems EngineerSr. Backend Software EngineerSkillsSmart Contracts DevelopmentSolidityEthereumEVMBlockchain DevelopmentdAppsWeb3Security Best PracticesEngineering Project ManagementBlockchainSoftware EngineeringAbout Token MetricsLearn more about Token Metrics and their company culture.View company profileWe are a cryptocurrency investment research firm that uses AI and Machine learning along with our set of data scientists, quant traders, and crypto native research analysts to provide timely insights on more than 6,000 crypto and NFT projects. Founded in 2018 by Ian Balina, Token Metrics is headquartered in Austin, Texas, we are happy to serve more than 5,000 customers from more than 50 countries. Our mission is to create the single best crypto analytics platform available anywhere, while also ensuring our products are accessible to everyone – even those on a tight budget.Tech stackLearn about the tools and technologies that Token Metrics uses to build, market, and sell its products.View tech stackReact NativeNode.jsNext.jsJavaScriptPythonHTML5JavaCSS 3R LanguageGraphQLSolidity50 moreToken Metrics employees can create an account to update this tech stack.HimalayasRemote companiesToken MetricsBlockchain Engineer (Manila -Remote)Apply nowJob expired?Please let Token Metrics know you found this job on Himalayas. This helps us grow!Apply nowElevate your applicationLet our AI craft your perfect cover letter and align your resume to this job's criteria.Optimize my resumeCraft my cover letterBy using our AI tools, you consent to sharing your profile with our AI partner for this purpose.About the jobApply beforeSep 01, 2024Posted onJul 03, 2024Job typeFull TimeExperience levelMid-levelLocation requirementsSuggest an editPhilippinesHiring timezonesShow UTC offsetsPhilippines +/- 0 hoursJob categoriesBlockchain EngineerBlockchain Protocol EngineerBlockchain DeveloperBlockchain Developer Relations ManagerBlockchain ArchitectBlockchain Technical EvangelistBlockchain AnalystBlockchain Developer AdvocateCryptography EngineerCrypto Quality Assurance (QA) Senior AssociateDistributed Network EngineerCryptographic EngineerDistributed Systems EngineerSr. Backend Software EngineerSkillsSmart Contracts DevelopmentSolidityEthereumEVMBlockchain DevelopmentdAppsWeb3Security Best PracticesEngineering Project ManagementBlockchainSoftware EngineeringClaim this profileTMToken MetricsCompany size11-50Founded in2018Chief executive officerIan BalinaMarketsCryptocurrencyInvestment ResearchArtificial IntelligenceMachine LearningData ScienceQuantitative TradingBlockchain TechnologyFinancial ServicesAnalyticsNFTEmployees live inUnited StatesIndiaPhilippinesUnited Arab EmiratesSocial mediaToken Metrics's TwitterToken Metrics's LinkedInView company profileVisit tokenmetrics.com"
  },
  {
    "jobTitle": "Senior Ruby Engineer, Integrations Team (EU)",
    "jobDescriptionUrl": "https://himalayas.app/companies/chartmogul/jobs/senior-ruby-engineer-integrations-team-eu",
    "companyName": "ChartMogul",
    "jobID": "53e19873-cf73-464a-81c8-8ba6a4075f95",
    "jobDescription": "Our Integrations Team consists of 5 backend developers working in 5-week-long iterations (inspired by “Shape Up”) to develop and maintain the billing system integrations that provide raw data to the heart of the ChartMogul platform. As an engineer on this team, you will have the opportunity to refine and improve on our existing interactions with major billing services such as Stripe and PayPal, as well as build new integrations with additional services that are on our roadmap. Because of our 5-week cycle structure, you’ll also have lots of opportunities to take ownership over a given feature or project, organize your own work, and see things through to completion.As a Senior Ruby Engineer, you willLearn, understand, and use 3rd-party APIs efficiently to extract data from different billing servicesCollaborate on tackling problems and designing optimal solutions, not just implementing someone else’s designInvestigate complex data to pinpoint precision issues and help improve customer trust in the productCreate and maintain a reliable, developer-friendly test suite, and explain meaning through documentationContribute to the quality of our codebase by reviewing pull requests and providing constructive feedbackLook for new tools and strategies to optimize bottlenecks in our architectureSupport and mentor other engineers on the team in working through complex challenges and honing their technical skillsWhat we work withRuby / Ruby on Rails frameworkPostgresAWS, Docker/Kubernetes and TerraformSidekiq, Faktory, and/or pg_cronDataDog and CI/CD systemsWhile this is a remote position, we are only able to consider candidates who are based in the EU.RequirementsWhat we’re looking for3+ years of experience as a backend engineer in RubyDemonstrable experience in data processing and debugging data issuesExperience with asynchronous processing and handling of large data setsPragmatic approach to software development; how to structure programs and decompose problems, apply patterns, and select the right paradigm for a taskClear communication skills with the ability to understand nuanced product requirements and explain your designs clearlyCollaborative and eager mindset to tackle challenges and contribute to design and architecture decisionsWhat we offerCompetitive compensation and equity packageAnnual performance and compensation reviewFlexible and remote-friendly work culturePaid holidays, paid sick leave, and parental leaveAdventures of a highly innovative, market-leading company, where you’ll experience having an incredibly impactful jobA team of kind and highly dedicated people who all have the same mission: helping SaaS companies succeed!Application ProcessInitial call with our RecruiterTechnical Interview with our Integrations TeamStakeholder Interview with Engineering ManagersFinal interview with our VP of EngineeringReference checksOfferAs a global, distributed workforce in over 20 countries, we know good ideas come from all over. Our different backgrounds, strengths, identities, and experiences make our product and company better. That's why we are committed to a diverse and inclusive workplace that fosters collaboration and innovation.Elevate your applicationLet our AI craft your perfect cover letter and align your resume to this job's criteria.Optimize my resumeCraft my cover letterBy using our AI tools, you consent to sharing your profile with our AI partner for this purpose.Elevate your applicationLet our AI craft your perfect cover letter and align your resume to this job's criteria.By using our AI tools, you consent to sharing your profile with our AI partner for this purpose.Optimize my resumeCraft my cover letterApply nowJob expired?Please let ChartMogul know you found this job on Himalayas. This helps us grow!Apply nowApply nowJob expired?Please let ChartMogul know you found this job on Himalayas. This helps us grow!Apply nowAbout the jobApply beforeSep 01, 2024Posted onJul 03, 2024Job typeFull TimeExperience levelSeniorLocation requirementsSuggest an editOpen to candidates from all countries.Hiring timezonesShow UTC offsetsWorldwideJob categoriesSenior Integration EngineerSenior Full Stack EngineerSenior Backend EngineerSenior Software EngineerSenior Fullstack Software EngineerSenior Backend Software EngineerSenior Solutions EngineerIntegration EngineerSenior Backend DeveloperSkillsRubyRuby on RailsPostgresAWSDockerKubernetesTerraformSidekiqCI CDAPI IntegrationData ProcessingDebuggingAsynchronousChartmogulFaktoryPayPalAbout ChartMogulLearn more about ChartMogul and their company culture.View company profileChartMogul is an analytics platform to help you run your subscription business. You get a complete overview of your global subscriber base; MRR, ARPU, ASP, churn and LTV are presented in a beautiful and easy to use dashboard.Our mission is to build powerful and secure cloud software for subscription businesses of all sizes, with a strong emphasis on good design and ease of use.Tech stackLearn about the tools and technologies that ChartMogul uses to build, market, and sell its products.View tech stackSassRuby on RailsBootstrapJavaScriptHTML5CSS 3RubyGoRustTypeScriptSegment36 moreChartMogul employees can create an account to update this tech stack.Employee benefitsLearn about the employee benefits and perks provided at ChartMogul.View benefitsAnnual education budgetLearning and development stipend to grow your skills.Company retreatsAnnual company retreats so you can meet everyone in person.Paid parental leavePaid family leave for all parents to support you and your family.Stock optionsEvery employee gets equity, so you are rewarded for your best work.View ChartMogul's employee benefitsHimalayasRemote companiesChartMogulSenior Ruby Engineer, Integrations Team (EU)Apply nowJob expired?Please let ChartMogul know you found this job on Himalayas. This helps us grow!Apply nowElevate your applicationLet our AI craft your perfect cover letter and align your resume to this job's criteria.Optimize my resumeCraft my cover letterBy using our AI tools, you consent to sharing your profile with our AI partner for this purpose.About the jobApply beforeSep 01, 2024Posted onJul 03, 2024Job typeFull TimeExperience levelSeniorLocation requirementsSuggest an editOpen to candidates from all countries.Hiring timezonesShow UTC offsetsWorldwideJob categoriesSenior Integration EngineerSenior Full Stack EngineerSenior Backend EngineerSenior Software EngineerSenior Fullstack Software EngineerSenior Backend Software EngineerSenior Solutions EngineerIntegration EngineerSenior Backend DeveloperSkillsRubyRuby on RailsPostgresAWSDockerKubernetesTerraformSidekiqCI CDAPI IntegrationData ProcessingDebuggingAsynchronousChartmogulFaktoryPayPalClaim this profileCHChartMogulCompany size11-50Founded in2014Chief executive officerNick FranklinMarketsAnalyticsBusiness IntelligenceRevenue AnalyticsSaaSEmployees live inSouth KoreaGermanySingaporeUnited KingdomGreeceCanadaSerbiaPortugalCroatiaAustraliaIndiaBangladeshPhilippinesRussian FederationRomaniaSocial mediaChartMogul's TwitterChartMogul's FacebookChartMogul's LinkedInView company profileVisit chartmogul.com"
  },
  {
    "jobTitle": "Senior Engineering Solutions Consultant - (Philippines)",
    "jobDescriptionUrl": "https://himalayas.app/companies/1840-company/jobs/senior-engineering-solutions-consultant-philippines",
    "companyName": "1840 & Company",
    "jobID": "72c18f66-4097-4c34-a644-92e00e72f055",
    "jobDescription": "Our client is one of the world’s leading providers of technology and communications services, transforming the way we connect around the world. We’re a human network that reaches across the globe and works behind the scenes. We anticipate, lead, and believe that listening is where learning begins. In crisis and in celebration, we come together—lifting up our communities and striving to make an impact to move the world forward. If you’re fueled by purpose, and powered by persistence, explore a career with us. Here, you’ll discover the rigor it takes to make a difference and the fulfillment that comes with living the #NetworkLife.We’re investing in our network to improve the way we live, work, and communicate. Our network transformation will be critical for all our future connectivity businesses including new products such as IoT, 5G, and future smart cities. As part of this network transformation, you will help build one network engineered for growth for all lines of business.Work Schedule:40 Hours in a week | In this hybrid role, you'll have a defined work location that includes work from home and a minimum eight assigned office days per month that will be set by your manager.Responsibilities:You will be managing all aspects of implementation of Network Transformation in assigned city. You will be preparing the overall delivery schedule and time line, escalating issues internally and externally to meet deliverables, managing project budget internally and with vendor, and reporting status of deliverables.Driving complex projects and programs to achieve targeted and measured business goals and key objectives.Coordinating and scheduling resources across multiple organizations to align project requirements with business goals and objectives.Identifying, monitoring, reporting and escalating project-related issues to achieve timely resolution.Developing and implementing corrective action plans to mitigate impact to project schedules and overall business objectives.Utilizing project tracking tools and systems to accurately document milestones completions, project issues, corrective action plans, project jeopardies, and overall project completions.Maintaining excellent communication with functional team members and direct management to ensure early identification of issues a timely reporting of status.Requirements:You are the type of person who sees a problem and gets it fixed no matter what. You enjoy the challenge of working through complex, cross-functional issues towards a transformational solution. You’re great at being detail oriented and thrive under the pressure of a deadline, but are also willing to be flexible when the situation is right. You are able to negotiate effectively at all levels of the organization and influence decisions that yield the best results for our company. You’ll need to have:Bachelor’s degree or four or more years of work experience.Four or more years of relevant work experience.Technical or project management experience.Knowledge of PC and software applications including Windows and MS Office.Even better if you have one or more of the following:A degree.PMP certification.Military experience.Engineering, Planning, and/or Operations knowledge, especially with Local and Long-Haul Telecommunications networks.Experience with SRM/SAP as well as expense and/or capital budgets.Excellent verbal and written skills for inter-organizational communications.Strong organization skills and demonstrated ability to manage multiple, often conflicting priorities to successful completion.Experience making independent decisions based on policies, practices and project requirementsBenefits:Our client is proud to be an equal opportunity employer. They know that diversity makes them stronger. They are committed to a collaborative, inclusive environment that encourages authenticity and fosters a sense of belonging. They strive for everyone to feel valued, connected, and empowered to reach their potential and contribute their best.About 1840 & Company:1840 & Company is a global leader in Business Process Outsourcing (BPO) and remote talent solutions, dedicated to propelling businesses forward through our comprehensive suite of services. We specialize in connecting companies with world-class freelance professionals and delivering top-tier outsourcing services, across over 150 countries worldwide.Our mission is to empower growth for forward-thinking businesses, seamlessly bridging any skill or resource gaps with our expertly vetted talent pool. We firmly believe in fostering an environment where exceptional individuals can achieve an optimal work-life balance, working remotely from any location, while maximizing their professional growth and earning potential.We are headquartered in Overland Park, KS, USA with service delivery facilities in the Philippines, India, Ukraine, South Africa and Argentina. We invite you to explore the opportunities we offer and consider joining our exclusive network of global freelance talent. Visit www.1840andco.com to learn more about us. To explore a wealth of career opportunities and find a role that suits your unique skills and aspirations, please visit our dedicated jobs portal at jobs.1840andco.comElevate your applicationLet our AI craft your perfect cover letter and align your resume to this job's criteria.Optimize my resumeCraft my cover letterBy using our AI tools, you consent to sharing your profile with our AI partner for this purpose.Elevate your applicationLet our AI craft your perfect cover letter and align your resume to this job's criteria.By using our AI tools, you consent to sharing your profile with our AI partner for this purpose.Optimize my resumeCraft my cover letterApply nowJob expired?Please let 1840 & Company know you found this job on Himalayas. This helps us grow!Apply nowApply nowJob expired?Please let 1840 & Company know you found this job on Himalayas. This helps us grow!Apply nowAbout the jobApply beforeSep 01, 2024Posted onJul 03, 2024Job typeFull TimeExperience levelSeniorLocation requirementsSuggest an editPhilippinesHiring timezonesShow UTC offsetsPhilippines +/- 0 hoursJob categoriesSenior Solutions EngineerSenior Solutions ConsultantSenior Principal EngineerSenior Solutions ArchitectSenior EngineerSolutions EngineerSenior ConsultantSenior Staff EngineerTechnical Solutions ConsultantSolutions Application EngineerSenior Systems EngineerSolution Architect LeadDeveloperSkillsProject ManagementSAPEngineeringPlanningOperations ManagementTelecommunicationsPMPInternal CommunicationsBudget ManagementDecision Making ProcessesTime ManagementNegotiationDetail OrientedWindowsAbout 1840 & CompanyLearn more about 1840 & Company and their company culture.View company profileHimalayasRemote companies1840 & CompanySenior Engineering Solutions Consultant - (Philippines)Apply nowJob expired?Please let 1840 & Company know you found this job on Himalayas. This helps us grow!Apply nowElevate your applicationLet our AI craft your perfect cover letter and align your resume to this job's criteria.Optimize my resumeCraft my cover letterBy using our AI tools, you consent to sharing your profile with our AI partner for this purpose.About the jobApply beforeSep 01, 2024Posted onJul 03, 2024Job typeFull TimeExperience levelSeniorLocation requirementsSuggest an editPhilippinesHiring timezonesShow UTC offsetsPhilippines +/- 0 hoursJob categoriesSenior Solutions EngineerSenior Solutions ConsultantSenior Principal EngineerSenior Solutions ArchitectSenior EngineerSolutions EngineerSenior ConsultantSenior Staff EngineerTechnical Solutions ConsultantSolutions Application EngineerSenior Systems EngineerSolution Architect LeadDeveloperSkillsProject ManagementSAPEngineeringPlanningOperations ManagementTelecommunicationsPMPInternal CommunicationsBudget ManagementDecision Making ProcessesTime ManagementNegotiationDetail OrientedWindowsClaim this profile1C1840 & CompanyCompany sizeSocial media1840 & Company's Twitter1840 & Company's LinkedInView company profileVisit 1840andco.com"
  },
  {
    "jobTitle": "Java Backend Developer (Latam) Bc6269",
    "jobDescriptionUrl": "https://himalayas.app/companies/nisum/jobs/java-backend-developer-latam-bc6269",
    "companyName": "Nisum",
    "jobID": "0598c0fb-3fb4-41d2-83aa-252faaeb40af",
    "jobDescription": "Nisum is a leading global digital commerce firm headquartered in California, with services spanning digital strategy and transformation, insights and analytics, blockchain, business agility, and custom software development. Founded in 2000 with the customer-centric motto “Building Success Together®,” Nisum has grown to over 1,800 professionals across the United States, Chile,Colombia, India, Pakistan and Canada. A preferred advisor to leading Fortune 500 brands, Nisum enables clients to achieve direct business growth by building the advanced technology they need to reach end customers in today’s world, with immersive and seamless experiences across digital and physical channels.En Nisum Latam buscamos un Backend Developer con mínimo 5 años de experiencia en el rolRequerimientos del cargo Spring FrameworksJava 11+ MicroserviciosAzureDatabases (Sybase, Postgresql) Web StorageJenkinsDockerKubernetesREST APIDesign PatternsRequerimientos deseablesKafka Blob StorageCI/CD¿Qué te ofrecemos?- Pertenecer a una empresa internacional y multicultural que apoya la diversidad.- Formar parte de proyectos internacionales con presencia en Norteamérica, Pakistán, India y Latam.- Entorno de trabajo con amplia experiencia en trabajo remoto y distribuido, usando metodologías ágiles.- Cultura de constante aprendizaje y desarrollo en tecnologías actuales.- Ambiente agradable y colaborativo, con foco en el trabajo en equipo.- Acceso a plataformas de aprendizaje, certificaciones Google Cloud, Databricks, Tech Talks, etc.- Formar parte de diversas iniciativas y participación continua en actividades internas y externas de innovación, hackathon, tecnología, agilidad, charlas, webinars, bienestar y cultura con posibilidades no solo de participar sino de ser expositor.- Si resides en Chile o Colombia además podrás acceder a los beneficios de nuestras respectivas sedes.Para que tengas en cuenta :) Este puesto es full time.Nisum is an Equal Opportunity Employer and we are proud of our ongoing efforts to foster diversity and inclusion in the workplace.Elevate your applicationLet our AI craft your perfect cover letter and align your resume to this job's criteria.Optimize my resumeCraft my cover letterBy using our AI tools, you consent to sharing your profile with our AI partner for this purpose.Elevate your applicationLet our AI craft your perfect cover letter and align your resume to this job's criteria.By using our AI tools, you consent to sharing your profile with our AI partner for this purpose.Optimize my resumeCraft my cover letterApply nowJob expired?Please let Nisum know you found this job on Himalayas. This helps us grow!Apply nowApply nowJob expired?Please let Nisum know you found this job on Himalayas. This helps us grow!Apply nowAbout the jobApply beforeSep 01, 2024Posted onJul 03, 2024Job typeFull TimeExperience levelMid-levelLocation requirementsSuggest an editChileColombiaHiring timezonesShow UTC offsetsChile +/- 0 hours, and 1 other timezoneJob categoriesBackend Java DeveloperJava Backend EngineerBackend Software Development EngineerBack End DeveloperBackend Software EngineerJava DeveloperBackend EngineerJava Based Application DeveloperSkillsJavaAzureSybasePostgreSQLWebJenkinsDockerKubernetesDesign PatternsKafkaBlockchainDatabricksAbout NisumLearn more about Nisum and their company culture.View company profileHimalayasRemote companiesNisumJava Backend Developer (Latam) Bc6269Apply nowJob expired?Please let Nisum know you found this job on Himalayas. This helps us grow!Apply nowElevate your applicationLet our AI craft your perfect cover letter and align your resume to this job's criteria.Optimize my resumeCraft my cover letterBy using our AI tools, you consent to sharing your profile with our AI partner for this purpose.About the jobApply beforeSep 01, 2024Posted onJul 03, 2024Job typeFull TimeExperience levelMid-levelLocation requirementsSuggest an editChileColombiaHiring timezonesShow UTC offsetsChile +/- 0 hours, and 1 other timezoneJob categoriesBackend Java DeveloperJava Backend EngineerBackend Software Development EngineerBack End DeveloperBackend Software EngineerJava DeveloperBackend EngineerJava Based Application DeveloperSkillsJavaAzureSybasePostgreSQLWebJenkinsDockerKubernetesDesign PatternsKafkaBlockchainDatabricksClaim this profileNINisumCompany sizeSocial mediaNisum's TwitterNisum's LinkedInView company profileVisit nisum.com"
  },
  {
    "jobTitle": "Engineering Manager - Workload Integration (Remote across ANZ)",
    "jobDescriptionUrl": "https://himalayas.app/companies/canva/jobs/engineering-manager-workload-integration-remote-across-anz",
    "companyName": "Canva",
    "jobID": "00cbe95c-c353-43f6-b7dc-bde618c998f0",
    "jobDescription": "Company DescriptionJoin the team redefining how the world experiences design.Hey, g'day, mabuhay, kia ora, 你好, hallo, vítejte!Thanks for stopping by. We know job hunting can be a little time-consuming and you're probably keen to find out what's on offer, so we'll get straight to the point.Where and how you can workOur flagship campus is in Sydney. We also have a campus in Melbourne and co-working spaces in Brisbane, Perth and Adelaide. But you have a choice in where and how you work, we trust our Canvanauts to choose the balance that empowers them and their team to achieve their goals.What you’d be doing in this roleAs Canva scales change continues to be part of our DNA. But we like to think that's all part of the fun. So this will give you the flavour of the type of things you'll be working on when you start, but this will likely evolve.About the Group/TeamThe Workload Integration team is responsible for workload identity, workload networking and dynamic configuration. The team is part of the Cloud Platform Group, which is made up of approximately 60 Software Engineers, and their goal is to enable the safe, secure and reliable operation of canva.com and internal workloads. Cloud Platform’s mission is to reduce the complexity of using the Cloud (we use AWS) so that engineers can focus on their own domains. We build products to support engineers across the company to easily provision and configure Cloud resources, release, run and operate workloads. And our goal is to ensure it's all done in the simplest and most secure way possible.About the Role/SpecialtyWorkload Integration is tasked with building out our cloud platform to make it safe and easy for engineers to define and manage their services configuration and communication needs.We aim to hide the complexity of configuring secure, authenticated and observable communication between services behind a simple self-serve platform API.What you’ll do (responsibilities)Defining the roadmap, vision and mission for the team.Regularly catch up with each team member to helm them grow.Provide support to each team member to make sure they are challenged and motivated to perform at their best.Individual performance reviews, setting impact and growth goals.Working with stakeholders and other platform teams to forge Canva’s cloud platform products.What we're looking forWe are looking for engineering managers who can apply infrastructure engineering skills with a platform product mindset. You will need experience managing platform or infrastructure teams and:Skills in software and network engineering.A working understanding of Kubernetes and Kubernetes networking.Understanding of networking protocols e.g. IP, DNS and TLS.Experience working with cloud infrastructure platforms to create a foundation for building secure, reliable and performant systems.Knowledge of web application architecture in the context of cloud providers.Experience using IaC tools like terraform to manage cloud infrastructure.Experience as a software engineer building platform products to accelerate and empower engineers to achieve crazy big goals.What's in it for you?Achieving our crazy big goals motivates us to work hard - and we do - but you'll experience lots of moments of magic, connectivity and fun woven throughout life at Canva, too. We also offer a range of benefits to set you up for every success in and outside of work.Here's a taste of what's on offer:Equity packages - we want our success to be yours tooInclusive parental leave policy that supports all parents & carersAn annual Vibe & Thrive allowance to support your wellbeing, social connection, office setup & moreFlexible leave options that empower you to be a force for good, take time to recharge and supports you personallyCheck out lifeatcanva.com for more info.Other stuff to knowWe make hiring decisions based on your experience, skills and passion, as well as how you can enhance Canva and our culture. When you apply, please tell us the pronouns you use and any reasonable adjustments you may need during the interview process.We celebrate all types of skills and backgrounds at Canva so even if you don’t feel like your skills quite match what’s listed above - we still want to hear from you!Please note that interviews are conducted virtually.Elevate your applicationLet our AI craft your perfect cover letter and align your resume to this job's criteria.Optimize my resumeCraft my cover letterBy using our AI tools, you consent to sharing your profile with our AI partner for this purpose.Elevate your applicationLet our AI craft your perfect cover letter and align your resume to this job's criteria.By using our AI tools, you consent to sharing your profile with our AI partner for this purpose.Optimize my resumeCraft my cover letterApply nowJob expired?Please let Canva know you found this job on Himalayas. This helps us grow!Apply nowApply nowJob expired?Please let Canva know you found this job on Himalayas. This helps us grow!Apply nowAbout the jobApply beforeSep 01, 2024Posted onJul 03, 2024Job typeFull TimeExperience levelManagerLocation requirementsSuggest an editAustraliaNew ZealandHiring timezonesShow UTC offsetsAustralia +/- 0 hours, and 1 other timezoneJob categoriesEngineering ManagerSenior Engineering ManagerGroup Engineering ManagerEngineering ManagementSr. Engineering ManagerEngineering Program Manager (EPM)Engineering Leadership Team LeaderSoftware Engineering ManagerEngineering LeadEngineering DirectorSkillsSoftware EngineeringNetwork EngineeringKubernetesNetwork ProtocolsIPSDNSTLSCloud Platform InfrastructureWeb Application ArchitectureIaC ToolingTerraformInfrastructure EngineeringPlatform ProductsCanvaVibeAbout CanvaLearn more about Canva and their company culture.View company profileCanva is a graphic design platform, used to create social media graphics, presentations, posters, documents and other visual content. Before Canva, creating a professional looking design was a complex process - you had to purchase expensive software; learn how to use it; purchase stock photography and fonts for the software; decide on a layout; slice images; receive photos and content via email; design something; upload and email the pdf only to find revisions needed to be made … and then finally be able to prepare your design for web or print.  Since launching in August 2013, Canva has been changing the way in which we communicate. Today our design tool has attracted over 15 million happy users across 190 countries, who have collectively created more than 1 billion designs.  With an integrated marketplace that has both free and paid stock photography, fonts, illustrations, and thousands of templates; a paid subscription that offers the ability to set up a brand kit so users can save their brand colours, fonts and assets, and ensure consistency across their designs; and a print service that gives our users the ability to produce professional prints in a variety of formats and sizes, delivered straight to their doorstep - Canva is disrupting the way we design.Tech stackLearn about the tools and technologies that Canva uses to build, market, and sell its products.View tech stackSpring BootSpringSpring MVCRxJavaJavaScriptHTML5JavaCSS 3KotlinSwiftObjective-C23 moreCanva employees can create an account to update this tech stack.Employee benefitsLearn about the employee benefits and perks provided at Canva.View benefitsSponsored social clubs and team eventsWe host fun and quirky celebrations.Employee assistance program (EAP)We offer an employee assistance program focused on mental health.Equity benefitsEvery employee gets equity, so you are rewarded for your best work.Pet-friendly officeIf you ever decide to come to the office, you’re welcome to bring a furry friend.View Canva's employee benefitsHimalayasRemote companiesCanvaEngineering Manager - Workload Integration (Remote across ANZ)Apply nowJob expired?Please let Canva know you found this job on Himalayas. This helps us grow!Apply nowElevate your applicationLet our AI craft your perfect cover letter and align your resume to this job's criteria.Optimize my resumeCraft my cover letterBy using our AI tools, you consent to sharing your profile with our AI partner for this purpose.About the jobApply beforeSep 01, 2024Posted onJul 03, 2024Job typeFull TimeExperience levelManagerLocation requirementsSuggest an editAustraliaNew ZealandHiring timezonesShow UTC offsetsAustralia +/- 0 hours, and 1 other timezoneJob categoriesEngineering ManagerSenior Engineering ManagerGroup Engineering ManagerEngineering ManagementSr. Engineering ManagerEngineering Program Manager (EPM)Engineering Leadership Team LeaderSoftware Engineering ManagerEngineering LeadEngineering DirectorSkillsSoftware EngineeringNetwork EngineeringKubernetesNetwork ProtocolsIPSDNSTLSCloud Platform InfrastructureWeb Application ArchitectureIaC ToolingTerraformInfrastructure EngineeringPlatform ProductsCanvaVibeClaim this profileCACanvaCompany size501-1000Founded in2012Chief executive officerMelanie PerkinsMarketsSaaSPublishingGraphic DesignCollaborationCollaboration SoftwarePhoto EditingSocial mediaCanva's TwitterCanva's FacebookCanva's LinkedInView company profileVisit canva.com"
  },
  {
    "jobTitle": "Senior Anime Animator",
    "jobDescriptionUrl": "https://himalayas.app/companies/twine/jobs/senior-anime-animator",
    "companyName": "Twine",
    "jobID": "2f9af429-71cb-4be7-9138-341245b03a5a",
    "jobDescription": "About TwineWe're a thriving ecosystem of top-tier freelancers from around the world. Trusted by Fortune 500 companies and Silicon Valley startups, Twine is the go-to platform for mission-critical projects. With over half a million registered freelancers and a growing roster of 35,000+ companies, we've become the comprehensive solution for freelancing.Our MissionAt Twine, we recognise that companies require a flexible approach to hiring expert freelancers for their most critical projects. Traditional freelance platforms often fall short when it comes to scalability and diversity. That's where we shine. Twine operates as a thriving global freelance network, with diverse experts across various fields, including marketing, engineering, and AI. Our core mission is to empower creators, whether they're businesses or individual freelancers, to thrive in their creative endeavours.About the RoleOur client is seeking a highly skilled professional to serve as both animator and sound specialist for an original anime series project. This full-time, remote contract position requires expertise in anime-style animation, sound design, music composition, and voice acting direction. The ideal candidate will be capable of delivering high-quality work that aligns with the aesthetic of renowned anime productions.Responsibilities:Create and oversee the animation process for a 24-episode anime seriesDevelop and maintain a consistent animation style inspired by \"The Boy and The Heron\"Design and implement sound effects that enhance the storytellingCompose or oversee the composition of original music for the seriesRequirementsProven experience in anime-style animation, with a strong portfolio of workExtensive knowledge of animation software and techniquesProficiency in sound design and audio editing softwareExperience in music composition or ability to direct music composersFamiliarity with voice acting direction and recording processesElevate your applicationLet our AI craft your perfect cover letter and align your resume to this job's criteria.Optimize my resumeCraft my cover letterBy using our AI tools, you consent to sharing your profile with our AI partner for this purpose.Elevate your applicationLet our AI craft your perfect cover letter and align your resume to this job's criteria.By using our AI tools, you consent to sharing your profile with our AI partner for this purpose.Optimize my resumeCraft my cover letterApply nowJob expired?Please let Twine know you found this job on Himalayas. This helps us grow!Apply nowApply nowJob expired?Please let Twine know you found this job on Himalayas. This helps us grow!Apply nowAbout the jobApply beforeSep 01, 2024Posted onJul 03, 2024Job typeFull TimeExperience levelSeniorLocation requirementsSuggest an editUnited StatesHiring timezonesShow UTC offsetsUnited States +/- 0 hoursJob categoriesSenior AnimatorSenior Animation DesignerSkillsAnimationDesignMusicDesign SoftwareAudio EditingAbout TwineLearn more about Twine and their company culture.View company profileHimalayasRemote companiesTwineSenior Anime AnimatorApply nowJob expired?Please let Twine know you found this job on Himalayas. This helps us grow!Apply nowElevate your applicationLet our AI craft your perfect cover letter and align your resume to this job's criteria.Optimize my resumeCraft my cover letterBy using our AI tools, you consent to sharing your profile with our AI partner for this purpose.About the jobApply beforeSep 01, 2024Posted onJul 03, 2024Job typeFull TimeExperience levelSeniorLocation requirementsSuggest an editUnited StatesHiring timezonesShow UTC offsetsUnited States +/- 0 hoursJob categoriesSenior AnimatorSenior Animation DesignerSkillsAnimationDesignMusicDesign SoftwareAudio EditingClaim this profileTWTwineCompany sizeSocial mediaTwine's TwitterTwine's LinkedInView company profileVisit twine.net"
  },
  {
    "jobTitle": "CRM Marketing Manager",
    "jobDescriptionUrl": "https://himalayas.app/companies/whizz/jobs/crm-marketing-manager-8578143840",
    "companyName": "Whizz",
    "jobID": "91fedbce-670b-4b9a-ad49-d6be38e70eee",
    "jobDescription": "At Whizz, we're dedicated to revolutionizing transportation for delivery drivers, ensuring that everyone has access to reliable mobility solutions, irrespective of financial barriers. Our mission is to democratize access to vehicle ownership and financing, empowering drivers to achieve success in their delivery careers. We're committed to making transportation seamless and hassle-free, allowing drivers to focus on delivering top-quality service to their customers.We are seeking a talented and results-driven CRM Marketing Manager to join our marketing team. If you're passionate about creating compelling customer engagement strategies and optimizing marketing funnels, we want to hear from you!Responsibilities:Develop engaging and persuasive copy for email, SMS, and messenger marketing campaigns.Optimize and launch new acquisition funnels using Brevo, Make, and Zapier.Collaborate with AI tools, copywriters, and designers to create compelling images and GIFs for emails and messengers.Use Metabase and other analytical tools to interpret funnel performance, identify drop-off points, and suggest optimization strategies.Design and execute A/B tests to improve conversion rates.Produce detailed reports, extract insights from data and implement changes.Work closely with the sales team to develop content and tools that support the funnel and improve conversion rates.RequirementsMinimum 2 years of experience as a CRM Marketing Manager or similar role.Proficiency in CRM systems (e.g., Brevo, Customer iO) and marketing automation tools (e.g., Make, Zapier).Strong data analysis skills and ability to generate reports using Metabase and Google Sheets/Slides.Experience with A/B testing and experimentation.Excellent copywriting skills with a focus on overcoming banner blindness.Understanding of content marketing and its role in driving acquisition.Familiarity with Agile marketing methodologies.Strong adaptability, business acumen, and results-driven mindset.Excellent English proficiency (C1+); French proficiency (B2+) is a plus.Bachelor's degree in Marketing or related field is preferred but not required.Ready to drive change and revolutionize transportation? Apply now and be part of our journey to transform the industry together!Send a cover letter and your CV to hr@getwhizz.com. The cover letter should explain why your experience and expertise will multiply business performance.Elevate your applicationLet our AI craft your perfect cover letter and align your resume to this job's criteria.Optimize my resumeCraft my cover letterBy using our AI tools, you consent to sharing your profile with our AI partner for this purpose.Elevate your applicationLet our AI craft your perfect cover letter and align your resume to this job's criteria.By using our AI tools, you consent to sharing your profile with our AI partner for this purpose.Optimize my resumeCraft my cover letterApply nowJob expired?Please let Whizz know you found this job on Himalayas. This helps us grow!Apply nowApply nowJob expired?Please let Whizz know you found this job on Himalayas. This helps us grow!Apply nowAbout the jobApply beforeSep 01, 2024Posted onJul 03, 2024Job typeFull TimeExperience levelManagerLocation requirementsSuggest an editIndiaHiring timezonesShow UTC offsetsIndia +/- 0 hoursJob categoriesCRM ManagerMarketing ManagerCRM SpecialistMarketing Automation ManagerCustomer Marketing ManagerCRM Lifecycle MarketingSkillsCRM SystemsCustomer.ioMarketing Automation ToolsMakeZapierMetabaseGoogle SheetsA B TestingData AnalysisCopywritingContent MarketingAgile MethodologiesAbout WhizzLearn more about Whizz and their company culture.View company profileHimalayasRemote companiesWhizzCRM Marketing ManagerApply nowJob expired?Please let Whizz know you found this job on Himalayas. This helps us grow!Apply nowElevate your applicationLet our AI craft your perfect cover letter and align your resume to this job's criteria.Optimize my resumeCraft my cover letterBy using our AI tools, you consent to sharing your profile with our AI partner for this purpose.About the jobApply beforeSep 01, 2024Posted onJul 03, 2024Job typeFull TimeExperience levelManagerLocation requirementsSuggest an editIndiaHiring timezonesShow UTC offsetsIndia +/- 0 hoursJob categoriesCRM ManagerMarketing ManagerCRM SpecialistMarketing Automation ManagerCustomer Marketing ManagerCRM Lifecycle MarketingSkillsCRM SystemsCustomer.ioMarketing Automation ToolsMakeZapierMetabaseGoogle SheetsA B TestingData AnalysisCopywritingContent MarketingAgile MethodologiesClaim this profileWHWhizzCompany sizeSocial mediaWhizz's LinkedInView company profileVisit getwhizz.com"
  },
  {
    "jobTitle": "Account Development Representative - DACH - German Fluency",
    "jobDescriptionUrl": "https://himalayas.app/companies/samsara/jobs/account-development-representative-dach-german-fluency-4585823182",
    "companyName": "Samsara",
    "jobID": "3b1a3165-96f2-47b5-bf10-244001ade94f",
    "jobDescription": "Who we areSamsara (NYSE: IOT) is the pioneer of the Connected Operations™ Cloud, which is a platform that enables organizations that depend on physical operations to harness Internet of Things (IoT) data to develop actionable insights and improve their operations. At Samsara, we are helping improve the safety, efficiency and sustainability of the physical operations that power our global economy. Representing more than 40% of global GDP, these industries are the infrastructure of our planet, including agriculture, construction, field services, transportation, and manufacturing — and we are excited to help digitally transform their operations at scale.Working at Samsara means you’ll help define the future of physical operations and be on a team that’s shaping an exciting array of product solutions, including Video-Based Safety, Vehicle Telematics, Apps and Driver Workflows, Equipment Monitoring, and Site Visibility. As part of a recently public company, you’ll have the autonomy and support to make an impact as we build for the long term.About the RoleAs an Account Development Representative (ADR) at Samsara, you will be trained, both on the job and with formal training programs led by a world-class team of sales professionals, to take on your next role as closing Account Executive. On a daily basis, you will be responsible for sourcing pipelines for our EMEA business, generating opportunities via outbound outreach. We have offices in Munich, Paris and Amsterdam and we offer remote working from Germany, France, The Netherlands and London. Our European headquarters are based in London. You should apply if: You want to impact the industries that run our world: Your efforts will result in real-world impact—helping to keep the lights on, get food into grocery stores, and most importantly, ensure workers return home safely.You are the architect of your own career: If you put in the work, this role won’t be your last at Samsara. Successful ADRs can see promotion to a closing role in two years or less.You love talking to people: In this role, you will average 60+ calls to prospective customers daily.You have an innate curiosity about how businesses work: One day you’ll meet with someone in waste management and the next you may be learning about the inner workings of a food distribution center. Our top sales team members seek to learn the ins and outs of the businesses they support to make a larger impact.You treat rejection as a learning experience: In this role, you will get hung up on and you will get told no. You need to have the resilience to pick up the phone again and again to sell Samsara’s mission.You want to be with the best: Samsara’s high-performance Sales culture means you’ll be surrounded by the best and challenged to go farther than you have before.In this role, you will:Drive pipeline through personalized outreach to prospects via phone, emails and LinkedinHave the opportunity to to participate in trade/shows events to represent the Samsara brand and connect with prospective customers and partners.Become a product expert and learn the Samsara way of sellingKeep meticulous records of interactions with accounts in our CRM (Salesforce.com)Champion, role model, and embed Samsara’s cultural principles (Focus on Customer Success, Build for the Long Term, Adopt a Growth Mindset, Be Inclusive, Win as a Team) as we scale globally and across new officesMinimum requirements for the role:1-3 years professional experience, ideally in customer facing roles6-12 months sales experience as a minimumHighly motivated and committed, with strong desire to work in target driven salesProven track record of consistent over achievement of targets/expectations of previous rolesExcellent communication skills, verbal and writtenCurious and able to ask insightful questionsA champion of a Growth MindsetHighly Proficient in English and in GermanAn ideal candidate also has:Experience in closing-sales rolesProven track record of achievements beyond work (e.g. academics, sports, charity, …)Willingness to collaborate and influence in a “win as a team” environmentExcitement about solving new problems in innovative waysMotivation to help build a fast-growing business in the IoT and SaaS spaceADR pathwaysThrough Samsara’s ADR program, there are always opportunities to move to the next level and take on more responsibility during the program and beyond—those who work hard to grow quickly will have the opportunity to advance their careers. With emphasis on continued professional development, the training doesn't stop after onboarding—we provide opportunities to expand ADRs’ understanding of the market and our competitors, develop hard skills needed in the Sales function, and work with mentors to help our representatives progress through the three levels of our ADR program.ADR I representatives focus on inbound leads—conducting a high volume of conversations, sharing the ins and outs of our products, and fostering relationships with those prospects interested in Samsara. At the ADR I level, we provide plenty of learning opportunities including call sessions with more senior Sales team members, training on tools (Salesforce, Salesloft, Lusha), product knowledge, objection handling, and more. Our representatives at this level are go-getters who are able to progress their careers through the opportunities provided for them.The next level in the program is ADR II, where our representatives work on top of funnel movement, creating high quality sales engagements, and supporting our Account Executives. Along with the leap into outbound work, those at the ADR II level are continually exposed to learning opportunities and enrolled in specialized trainings including professional writing, persona based messaging, , cold calling 2.0, and collaboration and communication with Account Executives. After building their skills in outbound sales and earning sales certifications, our representatives graduate to the final level of the program.The highest level within our organization is ADR III. These ADRs work hand-in-hand with field Account Executives and Enterprise Regional Sales Managers at Samsara. They partner closely on large accounts, implementing detailed territory plans, participating in weekly strategy meetings, and scheduling and attending customer demos. Additionally, ADR IIIs partake in a mentorship program to learn from leadership on the Account Executive team who provide exposure and training ahead of their interview for an Account Executive position.At Samsara, we welcome everyone regardless of their background. All qualified applicants will receive consideration for employment without regard to race, color, religion, national origin, sex, gender, gender identity, sexual orientation, protected veteran status, disability, age, and other characteristics protected by law. We depend on the unique approaches of our team members to help us solve complex problems. We are committed to increasing diversity across our team and ensuring that Samsara is a place where people from all backgrounds can make an impact.BenefitsFull time employees receive a competitive total compensation package along with employee-led remote and flexible working, health benefits, Samsara for Good charity fund, and much, much more. Take a look at our Benefits site to learn more.Accommodations Samsara is an inclusive work environment, and we are committed to ensuring equal opportunity in employment for qualified persons with disabilities. Please email accessibleinterviewing@samsara.com or click hereif you require any reasonable accommodations throughout the recruiting process.Flexible Working At Samsara, we embrace a flexible working model that caters to the diverse needs of our teams. Our offices are open for those who prefer to work in-person and we also support remote work where it aligns with our operational requirements. For certain positions, being close to one of our offices or within a specific geographic area is important to facilitate collaboration, access to resources, or alignment with our service regions. In these cases, the job description will clearly indicate any working location requirements. Our goal is to ensure that all members of our team can contribute effectively, whether they are working on-site, in a hybrid model, or fully remotely. All offers of employment are contingent upon an individual’s ability to secure and maintain the legal right to work at the company and in the specified work location, if applicable.Fraudulent Employment OffersSamsara is aware of scams involving fake job interviews and offers. Please know we do not charge fees to applicants at any stage of the hiring process. Official communication about your application will only come from emails ending in ‘@samsara.com’ or ‘@us-greenhouse-mail.io’. For more information regarding fraudulent employment offers, please visit our blog post here.Elevate your applicationLet our AI craft your perfect cover letter and align your resume to this job's criteria.Optimize my resumeCraft my cover letterBy using our AI tools, you consent to sharing your profile with our AI partner for this purpose.Elevate your applicationLet our AI craft your perfect cover letter and align your resume to this job's criteria.By using our AI tools, you consent to sharing your profile with our AI partner for this purpose.Optimize my resumeCraft my cover letterApply nowJob expired?Please let Samsara know you found this job on Himalayas. This helps us grow!Apply nowApply nowJob expired?Please let Samsara know you found this job on Himalayas. This helps us grow!Apply nowAbout the jobApply beforeSep 01, 2024Posted onJul 03, 2024Job typeFull TimeExperience levelEntry-levelLocation requirementsSuggest an editGermanyHiring timezonesShow UTC offsetsGermany +/- 0 hoursJob categoriesAccount Development RepresentativeAccount Development Representative (ADR)Sales Development RepresentativeSales Development AssociateInternational Sales Account ExecutiveEnterprise Sales Development RepresentativeBusiness Development RepresentativeSales Development SpecialistSales Development Representative (SDR)Sales Development Representative LeadSales Development ManagerMarket Development RepresentativeSkillsSalesOutbound MarketingCold CallingCRM (Salesforce)Account ManagementSales Pipeline ManagementSales PerformanceCustomer SuccessSaaSSalesforceOutbound OutreachAccount Development StrategyPipeline GenerationTrade ShowsProduct KnowledgeObjection HandlingProfessional ServicesPersonasCollaborationCommunicationTerritory PlanningProduct DemosSalesLoftAbout SamsaraLearn more about Samsara and their company culture.View company profileSamsara’s (NYSE: IOT) mission is to increase the safety, efficiency, and sustainability of the operations that power the global economy. Samsara is pioneering the Connected Operations Cloud, which allows businesses that depend on physical operations to harness IoT (Internet of Things) data to develop actionable business insights and improve their operations.  Samsara operates in North America and Europe and serves tens of thousands of customers across a wide range of industries including transportation, wholesale and retail trade, construction, field services, logistics, utilities and energy, government, healthcare and education, manufacturing, and food and beverage.Tech stackLearn about the tools and technologies that Samsara uses to build, market, and sell its products.View tech stackReact NativeSassNuxt.jsJavaScriptPythonHTML5CSS 3GoC++CAmazon FreeRTOS100 moreSamsara employees can create an account to update this tech stack.Employee benefitsLearn about the employee benefits and perks provided at Samsara.View benefitsCo-working space budgetWe have co-working space programs.Flexible schedulingYou can plan your work day your way.Fertility benefitsUp to $15,000 annually in fertility and adoption reimbursement through Carrot.Healthcare benefitsWe offer best-in-class health, dental, and vision insurance for all our employees so they can care for themselves and their families.View Samsara's employee benefitsHimalayasRemote companiesSamsaraAccount Development Representative - DACH - German FluencyApply nowJob expired?Please let Samsara know you found this job on Himalayas. This helps us grow!Apply nowElevate your applicationLet our AI craft your perfect cover letter and align your resume to this job's criteria.Optimize my resumeCraft my cover letterBy using our AI tools, you consent to sharing your profile with our AI partner for this purpose.About the jobApply beforeSep 01, 2024Posted onJul 03, 2024Job typeFull TimeExperience levelEntry-levelLocation requirementsSuggest an editGermanyHiring timezonesShow UTC offsetsGermany +/- 0 hoursJob categoriesAccount Development RepresentativeAccount Development Representative (ADR)Sales Development RepresentativeSales Development AssociateInternational Sales Account ExecutiveEnterprise Sales Development RepresentativeBusiness Development RepresentativeSales Development SpecialistSales Development Representative (SDR)Sales Development Representative LeadSales Development ManagerMarket Development RepresentativeSkillsSalesOutbound MarketingCold CallingCRM (Salesforce)Account ManagementSales Pipeline ManagementSales PerformanceCustomer SuccessSaaSSalesforceOutbound OutreachAccount Development StrategyPipeline GenerationTrade ShowsProduct KnowledgeObjection HandlingProfessional ServicesPersonasCollaborationCommunicationTerritory PlanningProduct DemosSalesLoftClaim this profileSASamsaraCompany size1001-5000Founded in2015Chief executive officerSanjit BiswasMarketsIoTConnected DevicesSoftwareSaaSArtificial IntelligenceB2B SaaSEnterprise SoftwareFleet ManagementFleet Management SoftwareEmployees live inUnited StatesUnited KingdomCanadaMexicoFranceGermanyNetherlandsTaiwanSocial mediaSamsara's TwitterSamsara's FacebookSamsara's LinkedInSamsara's InstagramView company profileVisit samsara.com"
  },
  {
    "jobTitle": "Customer Experience Specialist",
    "jobDescriptionUrl": "https://himalayas.app/companies/spreetail-inc/jobs/customer-experience-specialist",
    "companyName": "Spreetail Inc.",
    "jobID": "baab7905-6519-4236-b055-c56982a83e78",
    "jobDescription": "Spreetail propels brands to increase their ecommerce market share across the globe while improving their operational costs. Learn how we are building one of the fastest-growing ecommerce companies in history: www.spreetail.com. We’re looking for a Customer Experience Specialist to continue building a world-class customer experience across more than 10 marketplace channels that Spreetail partners with. We are committed to providing solutions and building relationships with our customers on a day-to-day basis. How you will achieve success:Communicate directly with our customers via phone and email. Think critically to resolve customer issues and provide appropriate solutions and alternatives within the time limits, and follow up to ensure resolution.Drive innovative and creative solutions to protect revenue. Support our customers, our vendors, and our marketplace partners and provide them with a wonderful experience.Play a critical role in driving many processes that impact departments across Spreetail by advocating for customer initiatives.What experiences will help you in this role: Critical thinking without losing sight of the details.Accepting open feedback and accountability.Ability to multitask and prioritize effectively.Accuracy in typing. Proven track record of effective time management skills. This is a remote position and requires candidates to have an available work-from-home setup Desktop/Laptop system requirements: - 4th generation or higher, at least Intel i3 or equivalent processor; - at least 4GB RAM;- Windows 10 and above or MAC OSX operating system - You are required to provide your own dual monitorsA strong and stable internet connection (A DSL, cable or fiber wired internet service with 10 Mbps plan or higher for primary connection)PC HeadsetA high-definition (HD) external or integrated webcam with at least 720p resolution.Elevate your applicationLet our AI craft your perfect cover letter and align your resume to this job's criteria.Optimize my resumeCraft my cover letterBy using our AI tools, you consent to sharing your profile with our AI partner for this purpose.Elevate your applicationLet our AI craft your perfect cover letter and align your resume to this job's criteria.By using our AI tools, you consent to sharing your profile with our AI partner for this purpose.Optimize my resumeCraft my cover letterApply nowJob expired?Please let Spreetail Inc. know you found this job on Himalayas. This helps us grow!Apply nowApply nowJob expired?Please let Spreetail Inc. know you found this job on Himalayas. This helps us grow!Apply nowAbout the jobApply beforeSep 01, 2024Posted onJul 03, 2024Job typeFull TimeExperience levelMid-levelLocation requirementsSuggest an editColombiaHiring timezonesShow UTC offsetsColombia +/- 0 hoursJob categoriesCustomer Experience SpecialistCustomer Experience RepresentativeCustomer Experience RoleCustomer Experience AssociateCustomer Success SpecialistSkillsCustomer ExperienceCommunicationCritical ThinkingMultitaskingTime ManagementTypingInternetWindowsWindows 10About Spreetail Inc.Learn more about Spreetail Inc. and their company culture.View company profileSpreetail is your full-service ecommerce acceleration partner, built to simplify and scale online sales for hard-to-ship products and more. Since 2006, our ecommerce experts have purchased products from world-class partners, listed these top brands on marketplace giants and fulfilled orders with next-day speed. Now we set our eyes on the future. Spreetail was founded in the Midwest and continues to be a proud member of the region's innovative community. Over the past 17 years, we have grown to better serve our brand partner customers. Today, we operate in 8 states across the US, Canada, The United Kingdom, and Europe. We’re committed to building deep, personal relationships. Part of accomplishing our goals is building a team bond to celebrate wins together. We do this while performing at an ambitious pace, allowing us to take on more responsibility, and giving us an opportunity to stretch our wings and grow.Tech stackLearn about the tools and technologies that Spreetail Inc. uses to build, market, and sell its products.View tech stackNode.jsJavaScriptHTML5CSS 3GoFacebook AdsGoogle Tag ManagerAmazon EC2Google Cloud PlatformAmazon S3Kubernetes32 moreSpreetail Inc. employees can create an account to update this tech stack.HimalayasRemote companiesSpreetail Inc.Customer Experience SpecialistApply nowJob expired?Please let Spreetail Inc. know you found this job on Himalayas. This helps us grow!Apply nowElevate your applicationLet our AI craft your perfect cover letter and align your resume to this job's criteria.Optimize my resumeCraft my cover letterBy using our AI tools, you consent to sharing your profile with our AI partner for this purpose.About the jobApply beforeSep 01, 2024Posted onJul 03, 2024Job typeFull TimeExperience levelMid-levelLocation requirementsSuggest an editColombiaHiring timezonesShow UTC offsetsColombia +/- 0 hoursJob categoriesCustomer Experience SpecialistCustomer Experience RepresentativeCustomer Experience RoleCustomer Experience AssociateCustomer Success SpecialistSkillsCustomer ExperienceCommunicationCritical ThinkingMultitaskingTime ManagementTypingInternetWindowsWindows 10Claim this profileSISpreetail Inc.Company size1001-5000Founded in2006Chief executive officerBrett ThomeMarketsEcommerceMarketplace ManagementSupply Chain ManagementLogisticsEmployees live inUnited StatesPhilippinesUnited KingdomCanadaGermanySocial mediaSpreetail Inc.'s TwitterSpreetail Inc.'s LinkedInView company profileVisit wearespreetail.com"
  },
  {
    "jobTitle": "Senior Software Engineer",
    "jobDescriptionUrl": "https://himalayas.app/companies/appomni/jobs/senior-software-engineer-6412381030",
    "companyName": "AppOmni",
    "jobID": "19f40372-c8b0-47b7-b68d-5c52832c11a6",
    "jobDescription": "About AppOmniAppOmni, a leader in SaaS Security, helps customers achieve secure productivity with their applications. Security teams and owners can quickly detect and mitigate threats using unmatched depth of protection, continuous monitoring, and comprehensive visibility. Trusted by over 25% of the Fortune 100, AppOmni specializes in securing diverse SaaS environments.About the RoleThis position in a rapidly growing security engineering company is an opportunity to take ownership of significant engineering decisions and implement technology to improve the security of enterprise SaaS deployments and their customers and end-users.Your work will directly and meaningfully impact securing our customers and their data - which may include your data! These are challenging engineering problems in an exciting part of the security industry without defined solutions. Successful candidates will have a history of solid problem-solving skills, the ability to think creatively, and top-notch engineering skills.What You’ll DoAs a Senior Software Engineer on the Core Engineering team, you will contribute directly to major components of AppOmni’s SaaS Security Posture Management (SSPM) platform. In collaboration with technical leadership, you will be responsible for the design and development of significant areas of the codebase that support security monitoring and management of SaaS platforms and remediation workflows to support customers in improving their security posture. What We’re Looking ForExcellent technical and non-technical communication skillsA quality-oriented approach to building and testing applications, including strong unit testing capabilities. Our engineers are expected to test their own code!At least seven years of hands-on experience with Python 3 and Django3+ years of hands-on experience working with Looker and Postgres SQL10+ years of software engineering experience, including object-oriented design, data structure design, and work on abstracted codebasesAn interest in data, security, and data securityA knack for designing elegant solutions to complex problems requiring piecing together data from various sourcesAbility to work with and integrate external APIsYou might also haveExperience with Django Rest Framework (DRF)Experience with Kubernetes, GKE, and PostgresExperience deploying and maintaining production applications in IaaS platformsPrior Application, Product, or Enterprise Security experienceThe technology you'll work withExperience writing integrations and/or connected apps for one or more of the following SaaS platforms: Microsoft365, ServiceNow, Workday, AtlassianPython3DjangoDjango Rest FrameworkLookerCeleryRedisPostgresGoogle Cloud Platform + Google Kubernetes EngineCultureOur flexible, remote-first team is collaborative and supportive as we move quickly to research and develop new ideas, deliver new features to our customers, and iterate on ideas and innovations. We accomplish this by focusing on our five core values: Trust, Transparency, Quality, Customer Focus, and Delivery. Our team is determined to make a difference to positively impact our way of life by securing the technology that is changing the world.AppOmni is proud to be Certified by Great Place to WorkⓇ, as we seek to build a culture where all employees feel appreciated and supported, especially with clear and honest leadership, employee recognition, and an environment that fosters innovation and collaboration.We believe diversity fuels innovation and drives growth by bringing a wealth of different perspectives and skills. We’re committed to fostering an inclusive environment where every employee feels valued, heard, and empowered to reach their full potential. Join us in building a workplace where we can all thrive.https://appomni.com/careers/Compensation & BenefitsAppOmni is committed to supporting our employee’s financial, professional and personal well-being. To do this, we take a holistic view of compensation, one that values not just the immediate financial package, but also long-term growth of both our employees and our company. We're committed to pay equity and transparency and encourage all candidates to discuss their salary expectations with us early in the application process.Our total rewards package includes the following:Base Salary: The annual base salary compensation range in the U.S. for this role is: $142,800 - $196,350. Final offer amounts are determined by factors such as the final candidate’s skills, qualifications, and experience, as well as business considerations and peer compensation. Stock Options: Our vision is to not just grow as a company but to grow together. By offering stock options, we are inviting you to be an integral part of our journey forward.Benefits: The many benefits of employment with AppOmni include working remotely, new hire home office / computer equipment stipend, generous paid time off, paid company holidays, paid floating holidays, paid parental leave, paid sick time and paid family leave for applicable states, health insurance - medical, dental, and vision with HSA option, LifeWorks Employee Assistance Program, company-provided life insurance, AD&D, STD/LTD and additional supplemental life insurance options, 401(k) and Roth retirement saving accounts, and a monthly wellness benefit reimbursement. All benefits are subject to eligibility requirements and plan details.The application window is anticipated to close by July 15, 2024.AppOmni is an equal-opportunity employer. Applicants will not be discriminated against because of race, color, creed, national origin, ancestry, citizenship status, sex, sexual orientation, gender identity or expression, age, religion, disability, pregnancy, marital status, veteran status, medical condition, genetic information, or any other characteristic protected by law. AppOmni is also committed to providing reasonable accommodations to qualified individuals with disabilities and disabled veterans in our job application procedures. If you need assistance or an accommodation due to a disability, you may contact us at employeesuccess@appomni.com.Elevate your applicationLet our AI craft your perfect cover letter and align your resume to this job's criteria.Optimize my resumeCraft my cover letterBy using our AI tools, you consent to sharing your profile with our AI partner for this purpose.Elevate your applicationLet our AI craft your perfect cover letter and align your resume to this job's criteria.By using our AI tools, you consent to sharing your profile with our AI partner for this purpose.Optimize my resumeCraft my cover letterApply nowJob expired?Please let AppOmni know you found this job on Himalayas. This helps us grow!Apply nowApply nowJob expired?Please let AppOmni know you found this job on Himalayas. This helps us grow!Apply nowAbout the jobApply beforeSep 01, 2024Posted onJul 03, 2024Job typeFull TimeExperience levelSeniorSalarySalary: 143k-196k USDLocation requirementsSuggest an editUnited StatesHiring timezonesShow UTC offsetsUnited States +/- 0 hoursJob categoriesSenior Software EngineerSenior Software Development EngineerSenior Software DeveloperSr. Software EngineerSenior Staff Software EngineerSenior Fullstack Software EngineerSenior Fullstack Software Development EngineerSenior EngineerSr. Staff Software EngineerSenior Backend Software EngineerSenior Software Quality EngineerSenior C++ Software EngineerSenior Software Quality Assurance EngineerSenior IT EngineerSenior Software Engineer In TestSkillsPython 3DjangoLookerDjango REST FrameworkKubernetesGKEPostgresServiceNowWorkdayAtlassianCeleryRedisGoogle Cloud PlatformSQLAbout AppOmniLearn more about AppOmni and their company culture.View company profileHimalayasRemote companiesAppOmniSenior Software EngineerApply nowJob expired?Please let AppOmni know you found this job on Himalayas. This helps us grow!Apply nowElevate your applicationLet our AI craft your perfect cover letter and align your resume to this job's criteria.Optimize my resumeCraft my cover letterBy using our AI tools, you consent to sharing your profile with our AI partner for this purpose.About the jobApply beforeSep 01, 2024Posted onJul 03, 2024Job typeFull TimeExperience levelSeniorSalarySalary: 143k-196k USDLocation requirementsSuggest an editUnited StatesHiring timezonesShow UTC offsetsUnited States +/- 0 hoursJob categoriesSenior Software EngineerSenior Software Development EngineerSenior Software DeveloperSr. Software EngineerSenior Staff Software EngineerSenior Fullstack Software EngineerSenior Fullstack Software Development EngineerSenior EngineerSr. Staff Software EngineerSenior Backend Software EngineerSenior Software Quality EngineerSenior C++ Software EngineerSenior Software Quality Assurance EngineerSenior IT EngineerSenior Software Engineer In TestSkillsPython 3DjangoLookerDjango REST FrameworkKubernetesGKEPostgresServiceNowWorkdayAtlassianCeleryRedisGoogle Cloud PlatformSQLClaim this profileAPAppOmniCompany sizeSocial mediaAppOmni's LinkedInView company profileVisit appomni.com"
  }
]